<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>码客Mark</title>
  <subtitle>预测未来最好的方法是在现在创造未来</subtitle>
  <link href="/atom.xml" rel="self"/>
  
  <link href="http://code.idea4j.com/"/>
  <updated>2016-12-22T01:39:54.317Z</updated>
  <id>http://code.idea4j.com/</id>
  
  <author>
    <name>markee</name>
    <email>wangjinguang66@163.com</email>
  </author>
  
  <generator uri="http://hexo.io/">Hexo</generator>
  
  <entry>
    <title>jenkins 安装</title>
    <link href="http://code.idea4j.com/2016/12/21/jenkins/"/>
    <id>http://code.idea4j.com/2016/12/21/jenkins/</id>
    <published>2016-12-21T12:42:02.000Z</published>
    <updated>2016-12-22T01:39:54.317Z</updated>
    
    <content type="html"><![CDATA[<p>&#x5B89;&#x88C5;jenkins&#x7A33;&#x5B9A;&#x7248;&#x672C;</p>
<p>sudo wget -O /etc/yum.repos.d/jenkins.repo <a href="http://pkg.jenkins-ci.org/redhat-stable/jenkins.repo" target="_blank" rel="external">http://pkg.jenkins-ci.org/redhat-stable/jenkins.repo</a><br>sudo rpm &#x2013;import <a href="http://pkg.jenkins-ci.org/redhat-stable/jenkins-ci.org.key" target="_blank" rel="external">http://pkg.jenkins-ci.org/redhat-stable/jenkins-ci.org.key</a><br>sudo yum install jenkins</p>
<p>&#x8FDB;&#x5165;jenkins&#x7684;&#x7CFB;&#x7EDF;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5E76;&#x4FEE;&#x6539;&#x76F8;&#x5173;&#x7AEF;&#x53E3;&#x53F7;<br>vi /etc/sysconfig/jenkins<br>jenkins&#x7684;&#x9ED8;&#x8BA4;JENKINS_PORT&#x662F;8080&#xFF0C;&#x8FD9;&#x540C;tomcat&#x7684;&#x9ED8;&#x8BA4;&#x7AEF;&#x53E3;&#x51B2;&#x7A81;,&#x6539;&#x4E3A;9099&#x3002;</p>
<p>service jenkins start</p>
<p>&#x8BBF;&#x95EE;&#x5730;&#x5740;<br>&#x4F1A;&#x63D0;&#x793A;&#x8F93;&#x5165;&#x5BC6;&#x7801;  copy&#x63D0;&#x793A;&#x4E2D;&#x6587;&#x4EF6;&#x91CC;&#x7684;&#x5BC6;&#x7801;&#x63D0;&#x4EA4;<br>&#x5B89;&#x88C5;&#x63D2;&#x4EF6;</p>
]]></content>
    
    <summary type="html">
    
      jenkins 安装
    
    </summary>
    
      <category term="CI" scheme="http://code.idea4j.com/categories/CI/"/>
    
    
      <category term="CI" scheme="http://code.idea4j.com/tags/CI/"/>
    
  </entry>
  
  <entry>
    <title>linux 端口查看</title>
    <link href="http://code.idea4j.com/2016/12/21/linux2/"/>
    <id>http://code.idea4j.com/2016/12/21/linux2/</id>
    <published>2016-12-21T05:39:06.000Z</published>
    <updated>2016-12-22T01:46:00.090Z</updated>
    
    <content type="html"><![CDATA[<p>linux&#x5F00;&#x542F;&#x5141;&#x8BB8;&#x5916;&#x7F51;&#x8BBF;&#x95EE;&#x7684;&#x7AEF;&#x53E3;</p>
<p>LINUX&#x5F00;&#x542F;&#x5141;&#x8BB8;&#x5BF9;&#x5916;&#x8BBF;&#x95EE;&#x7684;&#x7F51;&#x7EDC;&#x7AEF;&#x53E3; </p>
<p>LINUX&#x901A;&#x8FC7;&#x4E0B;&#x9762;&#x7684;&#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x5F00;&#x542F;&#x5141;&#x8BB8;&#x5BF9;&#x5916;&#x8BBF;&#x95EE;&#x7684;&#x7F51;&#x7EDC;&#x7AEF;&#x53E3;&#xFF1A; </p>
<p>/sbin/iptables -I INPUT -p tcp &#x2013;dport 8000 -j ACCEPT #&#x5F00;&#x542F;8000&#x7AEF;&#x53E3; </p>
<p>/etc/rc.d/init.d/iptables save #&#x4FDD;&#x5B58;&#x914D;&#x7F6E; </p>
<p>/etc/rc.d/init.d/iptables restart #&#x91CD;&#x542F;&#x670D;&#x52A1; </p>
<p>&#x67E5;&#x770B;&#x7AEF;&#x53E3;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x5F00;&#x653E; </p>
<p>/etc/init.d/iptables status</p>
]]></content>
    
    <summary type="html">
    
      linux 端口查看
    
    </summary>
    
      <category term="Linux" scheme="http://code.idea4j.com/categories/Linux/"/>
    
    
      <category term="Linux" scheme="http://code.idea4j.com/tags/Linux/"/>
    
  </entry>
  
  <entry>
    <title>linux下的文件结构，每个文件夹用途</title>
    <link href="http://code.idea4j.com/2016/12/21/linux1/"/>
    <id>http://code.idea4j.com/2016/12/21/linux1/</id>
    <published>2016-12-21T03:17:36.000Z</published>
    <updated>2016-12-22T01:40:14.960Z</updated>
    
    <content type="html"><![CDATA[<p>linux&#x4E0B;&#x7684;&#x6587;&#x4EF6;&#x7ED3;&#x6784;&#xFF0C;&#x6BCF;&#x4E2A;&#x6587;&#x4EF6;&#x5939;&#x7528;&#x9014;<br>/bin &#x4E8C;&#x8FDB;&#x5236;&#x53EF;&#x6267;&#x884C;&#x547D;&#x4EE4;<br>/dev &#x8BBE;&#x5907;&#x7279;&#x6B8A;&#x6587;&#x4EF6;<br>/etc &#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x548C;&#x914D;&#x7F6E;&#x6587;&#x4EF6;<br>/etc/rc.d &#x542F;&#x52A8;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x548C;&#x811A;&#x672C;<br>/home &#x7528;&#x6237;&#x4E3B;&#x76EE;&#x5F55;&#x7684;&#x57FA;&#x70B9;&#xFF0C;&#x6BD4;&#x5982;&#x7528;&#x6237;user&#x7684;&#x4E3B;&#x76EE;&#x5F55;&#x5C31;&#x662F;/home/user&#xFF0C;&#x53EF;&#x4EE5;&#x7528;~user&#x8868;&#x793A;<br>/lib &#x6807;&#x51C6;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x5E93;&#xFF0C;&#x53C8;&#x53EB;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x5171;&#x4EAB;&#x5E93;&#xFF0C;&#x4F5C;&#x7528;&#x7C7B;&#x4F3C;windows&#x91CC;&#x7684;.dll&#x6587;&#x4EF6;<br>/sbin &#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x547D;&#x4EE4;&#xFF0C;&#x8FD9;&#x91CC;&#x5B58;&#x653E;&#x7684;&#x662F;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x4F7F;&#x7528;&#x7684;&#x7BA1;&#x7406;&#x7A0B;&#x5E8F;<br>/tmp &#x516C;&#x7528;&#x7684;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#x5B58;&#x50A8;&#x70B9;<br>/root &#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x7684;&#x4E3B;&#x76EE;&#x5F55;&#xFF08;&#x5475;&#x5475;&#xFF0C;&#x7279;&#x6743;&#x9636;&#x7EA7;&#xFF09;<br>/mnt &#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x662F;&#x8BA9;&#x7528;&#x6237;&#x4E34;&#x65F6;&#x6302;&#x8F7D;&#x5176;&#x4ED6;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;<br>/lost+found &#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x5E73;&#x65F6;&#x662F;&#x7A7A;&#x7684;&#xFF0C;&#x7CFB;&#x7EDF;&#x975E;&#x6B63;&#x5E38;&#x5173;&#x673A;&#x800C;&#x7559;&#x4E0B;&#x201C;&#x65E0;&#x5BB6;&#x53EF;&#x5F52;&#x201D;&#x7684;&#x6587;&#x4EF6;&#xFF08;windows&#x4E0B;&#x53EB;&#x4EC0;&#x4E48;.chk&#xFF09;&#x5C31;&#x5728;&#x8FD9;&#x91CC;<br>/proc &#x865A;&#x62DF;&#x7684;&#x76EE;&#x5F55;&#xFF0C;&#x662F;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x7684;&#x6620;&#x5C04;&#x3002;&#x53EF;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x6765;&#x83B7;&#x53D6;&#x7CFB;&#x7EDF;&#x4FE1;&#x606F;&#x3002;<br>/var &#x67D0;&#x4E9B;&#x5927;&#x6587;&#x4EF6;&#x7684;&#x6EA2;&#x51FA;&#x533A;&#xFF0C;&#x6BD4;&#x65B9;&#x8BF4;&#x5404;&#x79CD;&#x670D;&#x52A1;&#x7684;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;<br>/usr &#x6700;&#x5E9E;&#x5927;&#x7684;&#x76EE;&#x5F55;&#xFF0C;&#x8981;&#x7528;&#x5230;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x6587;&#x4EF6;&#x51E0;&#x4E4E;&#x90FD;&#x5728;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x3002;&#x5176;&#x4E2D;&#x5305;&#x542B;&#xFF1A;<br>/usr/x11r6 &#x5B58;&#x653E;x window&#x7684;&#x76EE;&#x5F55;<br>/usr/bin &#x4F17;&#x591A;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;<br>/usr/sbin &#x8D85;&#x7EA7;&#x7528;&#x6237;&#x7684;&#x4E00;&#x4E9B;&#x7BA1;&#x7406;&#x7A0B;&#x5E8F;<br>/usr/doc linux&#x6587;&#x6863;<br>/usr/include linux&#x4E0B;&#x5F00;&#x53D1;&#x548C;&#x7F16;&#x8BD1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x8981;&#x7684;&#x5934;&#x6587;&#x4EF6;<br>/usr/lib &#x5E38;&#x7528;&#x7684;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x5E93;&#x548C;&#x8F6F;&#x4EF6;&#x5305;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;<br>/usr/man &#x5E2E;&#x52A9;&#x6587;&#x6863;<br>/usr/src &#x6E90;&#x4EE3;&#x7801;&#xFF0C;linux&#x5185;&#x6838;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#x5C31;&#x653E;&#x5728;/usr/src/linux&#x91CC;<br>/usr/local/bin &#x672C;&#x5730;&#x589E;&#x52A0;&#x7684;&#x547D;&#x4EE4;<br>/usr/local/lib &#x672C;&#x5730;&#x589E;&#x52A0;&#x7684;&#x5E93;&#x6839;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF; </p>
<p>&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6839;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x6240;&#x5360;&#x7A7A;&#x95F4;&#x4E00;&#x822C;&#x5E94;&#x8BE5;&#x6BD4;&#x8F83;&#x5C0F;&#xFF0C;&#x56E0;&#x4E3A;&#x5176;&#x4E2D;&#x7684;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x6587;&#x4EF6;&#x90FD;&#x4E0D;&#x9700;&#x8981;<br>&#x7ECF;&#x5E38;&#x6539;&#x52A8;&#xFF0C;&#x800C;&#x4E14;&#x5305;&#x62EC;&#x4E25;&#x683C;&#x7684;&#x6587;&#x4EF6;&#x548C;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x4E0D;&#x7ECF;&#x5E38;&#x6539;&#x53D8;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0D;&#x5BB9;&#x6613;&#x635F;&#x574F;&#x3002;<br>&#x9664;&#x4E86;&#x53EF;&#x80FD;&#x7684;&#x4E00;&#x4E2A;&#x53EB;/ v m l i n u z&#x6807;&#x51C6;&#x7684;&#x7CFB;&#x7EDF;&#x5F15;&#x5BFC;&#x6620;&#x50CF;&#x4E4B;&#x5916;&#xFF0C;&#x6839;&#x76EE;&#x5F55;&#x4E00;&#x822C;&#x4E0D;&#x542B;&#x4EFB;&#x4F55;&#x6587;&#x4EF6;&#x3002;&#x6240;&#x6709;<br>&#x5176;&#x4ED6;&#x6587;&#x4EF6;&#x5728;&#x6839;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5B50;&#x76EE;&#x5F55;&#x4E2D;&#x3002; </p>
<ol>
<li>/bin&#x76EE;&#x5F55;<br>/ b i n&#x76EE;&#x5F55;&#x5305;&#x542B;&#x4E86;&#x5F15;&#x5BFC;&#x542F;&#x52A8;&#x6240;&#x9700;&#x7684;&#x547D;&#x4EE4;&#x6216;&#x666E;&#x901A;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x7528;&#x7684;&#x547D;&#x4EE4;(&#x53EF;&#x80FD;&#x5728;&#x5F15;&#x5BFC;&#x542F;&#x52A8;&#x540E;)&#x3002;&#x8FD9;&#x4E9B;<br>&#x547D;&#x4EE4;&#x90FD;&#x662F;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x7684;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;( b i n&#x662F;b i n a r y - -&#x4E8C;&#x8FDB;&#x5236;&#x7684;&#x7B80;&#x79F0;)&#xFF0C;&#x591A;&#x662F;&#x7CFB;&#x7EDF;&#x4E2D;&#x91CD;&#x8981;&#x7684;&#x7CFB;&#x7EDF;&#x6587;&#x4EF6;&#x3002; </li>
<li>/sbin&#x76EE;&#x5F55;<br>/ s b i n&#x76EE;&#x5F55;&#x7C7B;&#x4F3C;/bin &#xFF0C;&#x4E5F;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x3002;&#x56E0;&#x4E3A;&#x5176;&#x4E2D;&#x7684;&#x5927;&#x90E8;&#x5206;&#x6587;&#x4EF6;&#x591A;&#x662F;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x4F7F;<br>&#x7528;&#x7684;&#x57FA;&#x672C;&#x7684;&#x7CFB;&#x7EDF;&#x7A0B;&#x5E8F;&#xFF0C;&#x6240;&#x4EE5;&#x867D;&#x7136;&#x666E;&#x901A;&#x7528;&#x6237;&#x5FC5;&#x8981;&#x4E14;&#x5141;&#x8BB8;&#x65F6;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x4E00;&#x822C;&#x4E0D;&#x7ED9;&#x666E;&#x901A;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x3002; </li>
<li>/etc&#x76EE;&#x5F55;<br>/ e t c&#x76EE;&#x5F55;&#x5B58;&#x653E;&#x7740;&#x5404;&#x79CD;&#x7CFB;&#x7EDF;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x4E86;&#x7528;&#x6237;&#x4FE1;&#x606F;&#x6587;&#x4EF6;/ e t c / p a s s w d&#xFF0C;&#x7CFB;&#x7EDF;&#x521D;&#x59CB;&#x5316;&#x6587;<br>&#x4EF6;/ e t c / r c&#x7B49;&#x3002;l i n u x&#x6B63;&#x662F;*&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x624D;&#x5F97;&#x4EE5;&#x6B63;&#x5E38;&#x5730;&#x8FD0;&#x884C;&#x3002; </li>
<li>/root&#x76EE;&#x5F55;<br>/root &#x76EE;&#x5F55;&#x662F;&#x8D85;&#x7EA7;&#x7528;&#x6237;&#x7684;&#x76EE;&#x5F55;&#x3002; </li>
<li>/lib&#x76EE;&#x5F55;<br>/ l i b&#x76EE;&#x5F55;&#x662F;&#x6839;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x7684;&#x5171;&#x4EAB;&#x5E93;&#xFF0C;&#x5B58;&#x653E;&#x4E86;&#x6839;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x6240;&#x9700;&#x7684;&#x5171;&#x4EAB;&#x6587;<br>&#x4EF6;&#x3002;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x5305;&#x542B;&#x4E86;&#x53EF;&#x88AB;&#x8BB8;&#x591A;&#x7A0B;&#x5E8F;&#x5171;&#x4EAB;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x6BCF;&#x4E2A;&#x7A0B;&#x5E8F;&#x90FD;&#x5305;&#x542B;&#x6709;&#x76F8;&#x540C;&#x7684;&#x5B50;&#x7A0B;&#x5E8F;&#x7684;&#x526F;<br>&#x672C;&#xFF0C;&#x6545;&#x53EF;&#x4EE5;&#x4F7F;&#x5F97;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x53D8;&#x5F97;&#x66F4;&#x5C0F;&#xFF0C;&#x8282;&#x7701;&#x7A7A;&#x95F4;&#x3002; </li>
<li>/lib/modules &#x76EE;&#x5F55;<br>/lib/modules &#x76EE;&#x5F55;&#x5305;&#x542B;&#x7CFB;&#x7EDF;&#x6838;&#x5FC3;&#x53EF;&#x52A0;&#x8F7D;&#x5404;&#x79CD;&#x6A21;&#x5757;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x90A3;&#x4E9B;&#x5728;&#x6062;&#x590D;&#x635F;&#x574F;&#x7684;&#x7CFB;&#x7EDF;&#x65F6;&#x91CD;&#x65B0;&#x5F15;<br>&#x5BFC;&#x7CFB;&#x7EDF;&#x6240;&#x9700;&#x7684;&#x6A21;&#x5757;(&#x4F8B;&#x5982;&#x7F51;&#x7EDC;&#x548C;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x9A71;&#x52A8;)&#x3002; </li>
<li>/dev&#x76EE;&#x5F55;<br>/ d e v&#x76EE;&#x5F55;&#x5B58;&#x653E;&#x4E86;&#x8BBE;&#x5907;&#x6587;&#x4EF6;&#xFF0C;&#x5373;&#x8BBE;&#x5907;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#xFF0C;&#x7528;&#x6237;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x8BBF;&#x95EE;&#x5916;&#x90E8;&#x8BBE;&#x5907;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x7528;<br>&#x6237;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBF;&#x95EE;/ d e v / m o u s e&#x6765;&#x8BBF;&#x95EE;&#x9F20;&#x6807;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x5C31;&#x50CF;&#x8BBF;&#x95EE;&#x5176;&#x4ED6;&#x6587;&#x4EF6;&#x4E00;&#x6837;&#x3002; </li>
<li>/tmp&#x76EE;&#x5F55;<br>/tmp &#x76EE;&#x5F55;&#x5B58;&#x653E;&#x7A0B;&#x5E8F;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x4EA7;&#x751F;&#x7684;&#x4FE1;&#x606F;&#x548C;&#x6570;&#x636E;&#x3002;&#x4F46;&#x5728;&#x5F15;&#x5BFC;&#x542F;&#x52A8;&#x540E;&#xFF0C;&#x8FD0;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#x6700;&#x597D;&#x4F7F;&#x7528;<br>/ v a r / t m p&#x6765;&#x4EE3;&#x66FF;/tmp &#xFF0C;&#x56E0;&#x4E3A;&#x524D;&#x8005;&#x53EF;&#x80FD;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x3002; </li>
<li>/boot&#x76EE;&#x5F55;<br>/ b o o t&#x76EE;&#x5F55;&#x5B58;&#x653E;&#x5F15;&#x5BFC;&#x52A0;&#x8F7D;&#x5668;(bootstrap loader)&#x4F7F;&#x7528;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5982;l i l o&#xFF0C;&#x6838;&#x5FC3;&#x6620;&#x50CF;&#x4E5F;&#x7ECF;&#x5E38;&#x653E;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;<br>&#x800C;&#x4E0D;&#x662F;&#x653E;&#x5728;&#x6839;&#x76EE;&#x5F55;&#x4E2D;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6709;&#x8BB8;&#x591A;&#x6838;&#x5FC3;&#x6620;&#x50CF;&#xFF0C;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x5C31;&#x53EF;&#x80FD;&#x53D8;&#x5F97;&#x5F88;&#x5927;&#xFF0C;&#x8FD9;&#x65F6;&#x4F7F;&#x7528;&#x5355;&#x72EC;&#x7684;<br>&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4F1A;&#x66F4;&#x597D;&#x4E00;&#x4E9B;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x8981;&#x786E;&#x4FDD;&#x6838;&#x5FC3;&#x6620;&#x50CF;&#x5FC5;&#x987B;&#x5728;i d e&#x786C;&#x76D8;&#x7684;&#x524D;1 0 2 4&#x67F1;&#x9762;&#x5185;&#x3002; </li>
<li>/mnt&#x76EE;&#x5F55;<br>/ m n t&#x76EE;&#x5F55;&#x662F;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x4E34;&#x65F6;&#x5B89;&#x88C5;( m o u n t )&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5B89;&#x88C5;&#x70B9;&#x3002;&#x7A0B;&#x5E8F;&#x5E76;&#x4E0D;&#x81EA;&#x52A8;&#x652F;&#x6301;&#x5B89;&#x88C5;&#x5230;<br>/mnt &#x3002;/mnt &#x4E0B;&#x9762;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x8BB8;&#x591A;&#x5B50;&#x76EE;&#x5F55;&#xFF0C;&#x4F8B;&#x5982;/mnt/dosa &#x53EF;&#x80FD;&#x662F;&#x4F7F;&#x7528;m s d o s&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x8F6F;&#x9A71;&#xFF0C;<br>&#x800C;/mnt/exta &#x53EF;&#x80FD;&#x662F;&#x4F7F;&#x7528;e x t 2&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x8F6F;&#x9A71;&#xFF0C;/mnt/cdrom &#x5149;&#x9A71;&#x7B49;&#x7B49;&#x3002; </li>
<li>/proc, /usr,/var,/home&#x76EE;&#x5F55;<br>&#x5176;&#x4ED6;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5B89;&#x88C5;&#x70B9;&#x3002;<br>&#x4E0B;&#x9762;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#xFF1B; <h2 id="etc&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"><a href="#etc&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;" class="headerlink" title="/etc&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"></a>/etc&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</h2>/etc &#x76EE;&#x5F55;&#x5305;&#x542B;&#x5404;&#x79CD;&#x7CFB;&#x7EDF;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x4E0B;&#x9762;&#x8BF4;&#x660E;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x3002;&#x5176;&#x4ED6;&#x7684;&#x4F60;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x5B83;&#x4EEC;&#x5C5E;&#x4E8E;&#x54EA;&#x4E2A;<br>&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x9605;&#x8BFB;&#x8BE5;&#x7A0B;&#x5E8F;&#x7684;m a n&#x9875;&#x3002;&#x8BB8;&#x591A;&#x7F51;&#x7EDC;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E5F;&#x5728;/etc &#x4E2D;&#x3002; </li>
<li>/etc/rc&#x6216;/etc/rc.d&#x6216;/etc/rc?.d<br>&#x542F;&#x52A8;&#x3001;&#x6216;&#x6539;&#x53D8;&#x8FD0;&#x884C;&#x7EA7;&#x65F6;&#x8FD0;&#x884C;&#x7684;&#x811A;&#x672C;&#x6216;&#x811A;&#x672C;&#x7684;&#x76EE;&#x5F55;&#x3002; </li>
<li>/etc/passwd<br>&#x7528;&#x6237;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x57DF;&#x7ED9;&#x51FA;&#x4E86;&#x7528;&#x6237;&#x540D;&#x3001;&#x771F;&#x5B9E;&#x59D3;&#x540D;&#x3001;&#x7528;&#x6237;&#x8D77;&#x59CB;&#x76EE;&#x5F55;&#x3001;&#x52A0;&#x5BC6;&#x53E3;&#x4EE4;&#x548C;&#x7528;&#x6237;&#x7684;&#x5176;<br>&#x4ED6;&#x4FE1;&#x606F;&#x3002; </li>
<li>/etc/fdprm<br>&#x8F6F;&#x76D8;&#x53C2;&#x6570;&#x8868;&#xFF0C;&#x7528;&#x4EE5;&#x8BF4;&#x660E;&#x4E0D;&#x540C;&#x7684;&#x8F6F;&#x76D8;&#x683C;&#x5F0F;&#x3002;&#x53EF;&#x7528;setfdprm &#x8FDB;&#x884C;&#x8BBE;&#x7F6E;&#x3002;&#x66F4;&#x591A;&#x7684;&#x4FE1;&#x606F;&#x89C1;s e t f d p r m<br>&#x7684;&#x5E2E;&#x52A9;&#x9875;&#x3002; </li>
<li>/etc/fstab<br>&#x6307;&#x5B9A;&#x542F;&#x52A8;&#x65F6;&#x9700;&#x8981;&#x81EA;&#x52A8;&#x5B89;&#x88C5;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5217;&#x8868;&#x3002;&#x4E5F;&#x5305;&#x62EC;&#x7528;swapon -a&#x542F;&#x7528;&#x7684;s w a p&#x533A;&#x7684;&#x4FE1;&#x606F;&#x3002; </li>
<li>/etc/group<br>&#x7C7B;&#x4F3C;/etc/passwd &#xFF0C;&#x4F46;&#x8BF4;&#x660E;&#x7684;&#x4E0D;&#x662F;&#x7528;&#x6237;&#x4FE1;&#x606F;&#x800C;&#x662F;&#x7EC4;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x5305;&#x62EC;&#x7EC4;&#x7684;&#x5404;&#x79CD;&#x6570;&#x636E;&#x3002; </li>
<li>/etc/inittab<br>init &#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002; </li>
<li>/etc/issue<br>&#x5305;&#x62EC;&#x7528;&#x6237;&#x5728;&#x767B;&#x5F55;&#x63D0;&#x793A;&#x7B26;&#x524D;&#x7684;&#x8F93;&#x51FA;&#x4FE1;&#x606F;&#x3002;&#x901A;&#x5E38;&#x5305;&#x62EC;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x6BB5;&#x77ED;&#x8BF4;&#x660E;&#x6216;&#x6B22;&#x8FCE;&#x4FE1;&#x606F;&#x3002;&#x5177;&#x4F53;&#x5185;<br>&#x5BB9;&#x7531;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x786E;&#x5B9A;&#x3002; </li>
<li>/etc/magic<br>&#x201C;f i l e&#x201D;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;&#x5305;&#x542B;&#x4E0D;&#x540C;&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x201C;f i l e&#x201D;&#x57FA;&#x4E8E;&#x5B83;&#x731C;&#x6D4B;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x3002; </li>
<li>/etc/motd<br>m o t d&#x662F;message of the day&#x7684;&#x7F29;&#x5199;&#xFF0C;&#x7528;&#x6237;&#x6210;&#x529F;&#x767B;&#x5F55;&#x540E;&#x81EA;&#x52A8;&#x8F93;&#x51FA;&#x3002;&#x5185;&#x5BB9;&#x7531;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x786E;&#x5B9A;&#x3002;<br>&#x5E38;&#x7528;&#x4E8E;&#x901A;&#x544A;&#x4FE1;&#x606F;&#xFF0C;&#x5982;&#x8BA1;&#x5212;&#x5173;&#x673A;&#x65F6;&#x95F4;&#x7684;&#x8B66;&#x544A;&#x7B49;&#x3002; </li>
<li>/etc/mtab<br>&#x5F53;&#x524D;&#x5B89;&#x88C5;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5217;&#x8868;&#x3002;&#x7531;&#x811A;&#x672C;( s c r i t p )&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5E76;&#x7531;mount &#x547D;&#x4EE4;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#x3002;&#x5F53;&#x9700;&#x8981;&#x4E00;<br>&#x4E2A;&#x5F53;&#x524D;&#x5B89;&#x88C5;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5217;&#x8868;&#x65F6;&#x4F7F;&#x7528;(&#x4F8B;&#x5982;df &#x547D;&#x4EE4;)&#x3002; </li>
<li>/etc/shadow<br>&#x5728;&#x5B89;&#x88C5;&#x4E86;&#x5F71;&#x5B50;( s h a d o w )&#x53E3;&#x4EE4;&#x8F6F;&#x4EF6;&#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x5F71;&#x5B50;&#x53E3;&#x4EE4;&#x6587;&#x4EF6;&#x3002;&#x5F71;&#x5B50;&#x53E3;&#x4EE4;&#x6587;&#x4EF6;&#x5C06;/ e t c / p a s s w d<br>&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x52A0;&#x5BC6;&#x53E3;&#x4EE4;&#x79FB;&#x52A8;&#x5230;/ e t c / s h a d o w&#x4E2D;&#xFF0C;&#x800C;&#x540E;&#x8005;&#x53EA;&#x5BF9;&#x8D85;&#x7EA7;&#x7528;&#x6237;( r o o t )&#x53EF;&#x8BFB;&#x3002;&#x8FD9;&#x4F7F;&#x7834;&#x8BD1;&#x53E3;&#x4EE4;&#x66F4;&#x56F0;<br>&#x96BE;&#xFF0C;&#x4EE5;&#x6B64;&#x589E;&#x52A0;&#x7CFB;&#x7EDF;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002; </li>
<li>/etc/login.defs<br>l o g i n&#x547D;&#x4EE4;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002; </li>
<li>/etc/printcap<br>&#x7C7B;&#x4F3C;/etc/termcap &#xFF0C;&#x4F46;&#x9488;&#x5BF9;&#x6253;&#x5370;&#x673A;&#x3002;&#x8BED;&#x6CD5;&#x4E0D;&#x540C;&#x3002; </li>
<li>/etc/profile &#x3001;/ e t c / c s h . l o g i n&#x3001;/etc/csh.cshrc<br>&#x767B;&#x5F55;&#x6216;&#x542F;&#x52A8;&#x65F6;b o u r n e&#x6216;c shells&#x6267;&#x884C;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x8FD9;&#x5141;&#x8BB8;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x4E3A;&#x6240;&#x6709;&#x7528;&#x6237;&#x5EFA;&#x7ACB;&#x5168;&#x5C40;&#x7F3A;&#x7701;&#x73AF;&#x5883;&#x3002; </li>
<li>/etc/securetty<br>&#x786E;&#x8BA4;&#x5B89;&#x5168;&#x7EC8;&#x7AEF;&#xFF0C;&#x5373;&#x54EA;&#x4E2A;&#x7EC8;&#x7AEF;&#x5141;&#x8BB8;&#x8D85;&#x7EA7;&#x7528;&#x6237;( r o o t )&#x767B;&#x5F55;&#x3002;&#x4E00;&#x822C;&#x53EA;&#x5217;&#x51FA;&#x865A;&#x62DF;&#x63A7;&#x5236;&#x53F0;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;<br>&#x53EF;&#x80FD;(&#x81F3;&#x5C11;&#x5F88;&#x56F0;&#x96BE;)&#x901A;&#x8FC7;&#x8C03;&#x5236;&#x89E3;&#x8C03;&#x5668;( m o d e m )&#x6216;&#x7F51;&#x7EDC;&#x95EF;&#x5165;&#x7CFB;&#x7EDF;&#x5E76;&#x5F97;&#x5230;&#x8D85;&#x7EA7;&#x7528;&#x6237;&#x7279;&#x6743;&#x3002; </li>
<li>/etc/shells<br>&#x5217;&#x51FA;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7684;s h e l l&#x3002;chsh &#x547D;&#x4EE4;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x5728;&#x672C;&#x6587;&#x4EF6;&#x6307;&#x5B9A;&#x8303;&#x56F4;&#x5185;&#x6539;&#x53D8;&#x767B;&#x5F55;&#x7684;s h e l l&#x3002;&#x63D0;&#x4F9B;&#x4E00;<br>&#x53F0;&#x673A;&#x5668;f t p&#x670D;&#x52A1;&#x7684;&#x670D;&#x52A1;&#x8FDB;&#x7A0B;ftpd &#x68C0;&#x67E5;&#x7528;&#x6237;s h e l l&#x662F;&#x5426;&#x5217;&#x5728;/etc/shells &#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#xFF0C;&#x5C06;&#x4E0D;&#x5141;<br>&#x8BB8;&#x8BE5;&#x7528;&#x6237;&#x767B;&#x5F55;&#x3002; </li>
<li>/etc/termcap<br>&#x7EC8;&#x7AEF;&#x6027;&#x80FD;&#x6570;&#x636E;&#x5E93;&#x3002;&#x8BF4;&#x660E;&#x4E0D;&#x540C;&#x7684;&#x7EC8;&#x7AEF;&#x7528;&#x4EC0;&#x4E48;&#x201C;&#x8F6C;&#x4E49;&#x5E8F;&#x5217;&#x201D;&#x63A7;&#x5236;&#x3002;&#x5199;&#x7A0B;&#x5E8F;&#x65F6;&#x4E0D;&#x76F4;&#x63A5;&#x8F93;&#x51FA;&#x8F6C;&#x4E49;<br>&#x5E8F;&#x5217;(&#x8FD9;&#x6837;&#x53EA;&#x80FD;&#x5DE5;&#x4F5C;&#x4E8E;&#x7279;&#x5B9A;&#x54C1;&#x724C;&#x7684;&#x7EC8;&#x7AEF;)&#xFF0C;&#x800C;&#x662F;&#x4ECE;/etc/termcap &#x4E2D;&#x67E5;&#x627E;&#x8981;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x7684;&#x6B63;&#x786E;&#x5E8F;&#x5217;&#x3002;<br>&#x8FD9;&#x6837;&#xFF0C;&#x591A;&#x6570;&#x7684;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5728;&#x591A;&#x6570;&#x7EC8;&#x7AEF;&#x4E0A;&#x8FD0;&#x884C;&#x3002;</li>
</ol>
<h2 id="dev&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"><a href="#dev&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;" class="headerlink" title="/dev&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"></a>/dev&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</h2><p>/dev &#x76EE;&#x5F55;&#x5305;&#x62EC;&#x6240;&#x6709;&#x8BBE;&#x5907;&#x7684;&#x8BBE;&#x5907;&#x6587;&#x4EF6;&#x3002;&#x8BBE;&#x5907;&#x6587;&#x4EF6;&#x7528;&#x7279;&#x5B9A;&#x7684;&#x7EA6;&#x5B9A;&#x547D;&#x540D;&#xFF0C;&#x8FD9;&#x5728;&#x8BBE;&#x5907;&#x5217;&#x8868;&#x4E2D;&#x8BF4;&#x660E;&#x3002;<br>&#x8BBE;&#x5907;&#x6587;&#x4EF6;&#x5728;&#x5B89;&#x88C5;&#x65F6;&#x7531;&#x7CFB;&#x7EDF;&#x4EA7;&#x751F;&#xFF0C;&#x4EE5;&#x540E;&#x53EF;&#x4EE5;&#x7528;/dev/makedev &#x63CF;&#x8FF0;&#x3002;/ d e v / m a k e d e v.local &#x662F;<br>&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x4E3A;&#x672C;&#x5730;&#x8BBE;&#x5907;&#x6587;&#x4EF6;(&#x6216;&#x8FDE;&#x63A5;)&#x5199;&#x7684;&#x63CF;&#x8FF0;&#x6587;&#x7A3F;(&#x5373;&#x5982;&#x4E00;&#x4E9B;&#x975E;&#x6807;&#x51C6;&#x8BBE;&#x5907;&#x9A71;&#x52A8;&#x4E0D;&#x662F;&#x6807;&#x51C6;<br>makedev &#x7684;&#x4E00;&#x90E8;&#x5206;)&#x3002;&#x4E0B;&#x9762;&#x7B80;&#x8981;&#x4ECB;&#x7ECD;/ d e v&#x4E0B;&#x4E00;&#x4E9B;&#x5E38;&#x7528;&#x6587;&#x4EF6;&#x3002; </p>
<ol>
<li>/dev/console<br>&#x7CFB;&#x7EDF;&#x63A7;&#x5236;&#x53F0;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x76F4;&#x63A5;&#x548C;&#x7CFB;&#x7EDF;&#x8FDE;&#x63A5;&#x7684;&#x76D1;&#x89C6;&#x5668;&#x3002; </li>
<li>/dev/hd<br>i d e&#x786C;&#x76D8;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x63A5;&#x53E3;&#x3002;&#x5982;&#xFF1A; / d e v / h d a&#x6307;&#x7684;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x786C;&#x76D8;&#xFF0C; h a d 1&#x5219;&#x662F;&#x6307;/ d e v / h d a&#x7684;&#x7B2C;&#x4E00;&#x4E2A;<br>&#x5206;&#x533A;&#x3002;&#x5982;&#x7CFB;&#x7EDF;&#x4E2D;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x786C;&#x76D8;&#xFF0C;&#x5219;&#x4F9D;&#x6B21;&#x4E3A;/ d e v / h d b&#x3001;/ d e v / h d c&#x3001;. . . . . .&#xFF1B;&#x5982;&#x6709;&#x591A;&#x4E2A;&#x5206;&#x533A;&#x5219;&#x4F9D;&#x6B21;&#x4E3A;<br>h d a 1&#x3001;h d a 2 . . . . . . </li>
<li>/dev/sd<br>s c s i&#x78C1;&#x76D8;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x63A5;&#x53E3;&#x3002;&#x5982;&#x6709;&#x7CFB;&#x7EDF;&#x6709;s c s i&#x786C;&#x76D8;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x8BBF;&#x95EE;/ d e v / h a d&#xFF0C;&#x800C;&#x4F1A;&#x8BBF;&#x95EE;/ d e v / s d a&#x3002; </li>
<li>/dev/fd<br>&#x8F6F;&#x9A71;&#x8BBE;&#x5907;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x3002;&#x5982;&#xFF1A; / d e v / f d 0&#x6307;&#x7CFB;&#x7EDF;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x8F6F;&#x76D8;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x901A;&#x5E38;&#x6240;&#x8BF4;&#x7684;a&#xFF1A;&#x76D8;&#xFF0C;<br>/ d e v / f d 1&#x6307;&#x7B2C;&#x4E8C;&#x4E2A;&#x8F6F;&#x76D8;&#xFF0C;. . . . . .&#x800C;/ d e v / f d 1 h 1 4 4 0&#x5219;&#x8868;&#x793A;&#x8BBF;&#x95EE;&#x9A71;&#x52A8;&#x5668;1&#x4E2D;&#x7684;4 . 5&#x9AD8;&#x5BC6;&#x76D8;&#x3002; </li>
<li>/dev/st<br>s c s i&#x78C1;&#x5E26;&#x9A71;&#x52A8;&#x5668;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x3002; </li>
<li>/dev/tty<br>&#x63D0;&#x4F9B;&#x865A;&#x62DF;&#x63A7;&#x5236;&#x53F0;&#x652F;&#x6301;&#x3002;&#x5982;&#xFF1A; / d e v / t t y 1&#x6307;&#x7684;&#x662F;&#x7CFB;&#x7EDF;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x63A7;&#x5236;&#x53F0;&#xFF0C; / d e v / t t y 2&#x5219;&#x662F;&#x7CFB;&#x7EDF;<br>&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x865A;&#x62DF;&#x63A7;&#x5236;&#x53F0;&#x3002; </li>
<li>/dev/pty<br>&#x63D0;&#x4F9B;&#x8FDC;&#x7A0B;&#x767B;&#x9646;&#x4F2A;&#x7EC8;&#x7AEF;&#x652F;&#x6301;&#x3002;&#x5728;&#x8FDB;&#x884C;te l n e t&#x767B;&#x5F55;&#x65F6;&#x5C31;&#x8981;&#x7528;&#x5230;/ d e v / p t y&#x8BBE;&#x5907;&#x3002; </li>
<li>/dev/ttys<br>&#x8BA1;&#x7B97;&#x673A;&#x4E32;&#x884C;&#x63A5;&#x53E3;&#xFF0C;&#x5BF9;&#x4E8E;d o s&#x6765;&#x8BF4;&#x5C31;&#x662F;&#x201C; c o m 1&#x201D;&#x53E3;&#x3002; </li>
<li>/dev/cua<br>&#x8BA1;&#x7B97;&#x673A;&#x4E32;&#x884C;&#x63A5;&#x53E3;&#xFF0C;&#x4E0E;&#x8C03;&#x5236;&#x89E3;&#x8C03;&#x5668;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x7684;&#x8BBE;&#x5907;&#x3002; </li>
<li>/dev/null<br>&#x201C;&#x9ED1;&#x6D1E;&#x201D;&#xFF0C;&#x6240;&#x6709;&#x5199;&#x5165;&#x8BE5;&#x8BBE;&#x5907;&#x7684;&#x4FE1;&#x606F;&#x90FD;&#x5C06;&#x6D88;&#x5931;&#x3002;&#x4F8B;&#x5982;&#xFF1A;&#x5F53;&#x60F3;&#x8981;&#x5C06;&#x5C4F;&#x5E55;&#x4E0A;&#x7684;&#x8F93;&#x51FA;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x8D77;&#x6765;<br>&#x65F6;&#xFF0C;&#x53EA;&#x8981;&#x5C06;&#x8F93;&#x51FA;&#x4FE1;&#x606F;&#x8F93;&#x5165;&#x5230;/ d e v / n u l l&#x4E2D;&#x5373;&#x53EF;&#x3002; <h2 id="usr&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"><a href="#usr&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;" class="headerlink" title="/usr&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"></a>/usr&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</h2>/usr &#x662F;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x76EE;&#x5F55;&#xFF0C;&#x901A;&#x5E38;&#x8FD9;&#x4E00;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5F88;&#x5927;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7A0B;&#x5E8F;&#x5B89;&#x88C5;&#x5728;&#x8FD9;&#x91CC;&#x3002;/usr &#x91CC;&#x7684;<br>&#x6240;&#x6709;&#x6587;&#x4EF6;&#x4E00;&#x822C;&#x6765;&#x81EA;l i n u x&#x53D1;&#x884C;&#x7248;( d i s t r i b u t i o n )&#xFF1B;&#x672C;&#x5730;&#x5B89;&#x88C5;&#x7684;&#x7A0B;&#x5E8F;&#x548C;&#x5176;&#x4ED6;&#x4E1C;&#x897F;&#x5728;/usr/local &#x4E0B;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5728;&#x5347;&#x7EA7;&#x65B0;&#x7248;&#x7CFB;&#x7EDF;&#x6216;&#x65B0;&#x53D1;&#x884C;&#x7248;&#x65F6;&#x65E0;&#x987B;&#x91CD;&#x65B0;&#x5B89;&#x88C5;&#x5168;&#x90E8;&#x7A0B;&#x5E8F;&#x3002;/usr &#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x8BB8;&#x591A;&#x5185;&#x5BB9;&#x662F;<br>&#x53EF;&#x9009;&#x7684;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x4F1A;&#x4F7F;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x7CFB;&#x7EDF;&#x66F4;&#x52A0;&#x6709;&#x6548;&#x3002;/ u s r&#x53EF;&#x5BB9;&#x7EB3;&#x8BB8;&#x591A;&#x5927;&#x578B;&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#x548C;&#x5B83;&#x4EEC;&#x7684;&#x914D;&#x7F6E;<br>&#x6587;&#x4EF6;&#x3002;&#x4E0B;&#x9762;&#x5217;&#x51FA;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x76EE;&#x5F55;(&#x4E00;&#x4E9B;&#x4E0D;&#x592A;&#x91CD;&#x8981;&#x7684;&#x76EE;&#x5F55;&#x88AB;&#x7701;&#x7565;&#x4E86;)&#x3002; </li>
<li>/usr/x11r6<br>&#x5305;&#x542B;x wi n d o w&#x7CFB;&#x7EDF;&#x7684;&#x6240;&#x6709;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x3001;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x548C;&#x652F;&#x6301;&#x6587;&#x4EF6;&#x3002;&#x4E3A;&#x7B80;&#x5316;x&#x7684;&#x5F00;&#x53D1;&#x548C;&#x5B89;&#x88C5;&#xFF0C;<br>x&#x7684;&#x6587;&#x4EF6;&#x6CA1;&#x6709;&#x96C6;&#x6210;&#x5230;&#x7CFB;&#x7EDF;&#x4E2D;&#x3002;x wi n d o w&#x7CFB;&#x7EDF;&#x662F;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x5F3A;&#x5927;&#x7684;&#x56FE;&#x5F62;&#x73AF;&#x5883;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x56FE;&#x5F62;<br>&#x5DE5;&#x5177;&#x7A0B;&#x5E8F;&#x3002;&#x7528;&#x6237;&#x5982;&#x679C;&#x5BF9;microsoft wi n d o w s&#x6216;m a c h i n t o s h&#x6BD4;&#x8F83;&#x719F;&#x6089;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x5BF9;x wi n d o w&#x7CFB;&#x7EDF;&#x611F;&#x5230;&#x675F;&#x624B;&#x65E0;&#x7B56;&#x4E86;&#x3002; </li>
<li>/usr/x386<br>&#x7C7B;&#x4F3C;/ u s r / x 11r6 &#xFF0C;&#x4F46;&#x662F;&#x662F;&#x4E13;&#x95E8;&#x7ED9;x 11 release 5&#x7684;&#x3002; </li>
<li>/usr/bin<br>&#x96C6;&#x4E2D;&#x4E86;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7528;&#x6237;&#x547D;&#x4EE4;&#xFF0C;&#x662F;&#x7CFB;&#x7EDF;&#x7684;&#x8F6F;&#x4EF6;&#x5E93;&#x3002;&#x53E6;&#x6709;&#x4E9B;&#x547D;&#x4EE4;&#x5728;/bin &#x6216;/usr/local/bin &#x4E2D;&#x3002; </li>
<li>/usr/sbin<br>&#x5305;&#x62EC;&#x4E86;&#x6839;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x547D;&#x4EE4;&#xFF0C;&#x4F8B;&#x5982;&#x591A;&#x6570;&#x670D;&#x52A1;&#x7A0B;&#x5E8F;&#x3002; </li>
<li>/usr/man&#x3001;/ u s r / i n f o&#x3001;/ u s r / d o c<br>&#x8FD9;&#x4E9B;&#x76EE;&#x5F55;&#x5305;&#x542B;&#x6240;&#x6709;&#x624B;&#x518C;&#x9875;&#x3001;g n u&#x4FE1;&#x606F;&#x6587;&#x6863;&#x548C;&#x5404;&#x79CD;&#x5176;&#x4ED6;&#x6587;&#x6863;&#x6587;&#x4EF6;&#x3002;&#x6BCF;&#x4E2A;&#x8054;&#x673A;&#x624B;&#x518C;&#x7684;&#x201C;&#x8282;&#x201D;<br>&#x90FD;&#x6709;&#x4E24;&#x4E2A;&#x5B50;&#x76EE;&#x5F55;&#x3002;&#x4F8B;&#x5982;&#xFF1A; / u s r / m a n / m a n 1&#x4E2D;&#x5305;&#x542B;&#x8054;&#x673A;&#x624B;&#x518C;&#x7B2C;&#x4E00;&#x8282;&#x7684;&#x6E90;&#x7801;(&#x6CA1;&#x6709;&#x683C;&#x5F0F;&#x5316;&#x7684;&#x539F;&#x59CB;&#x6587;<br>&#x4EF6;)&#xFF0C;/ u s r / m a n / c a t 1&#x5305;&#x542B;&#x7B2C;&#x4E00;&#x8282;&#x5DF2;&#x683C;&#x5F0F;&#x5316;&#x7684;&#x5185;&#x5BB9;&#x3002;l&#x8054;&#x673A;&#x624B;&#x518C;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;&#x4E5D;&#x8282;&#xFF1A;&#x5185;&#x90E8;&#x547D;&#x4EE4;&#x3001;&#x7CFB;&#x7EDF;&#x8C03;<br>&#x7528;&#x3001;&#x5E93;&#x51FD;&#x6570;&#x3001;&#x8BBE;&#x5907;&#x3001;&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x3001;&#x6E38;&#x620F;&#x3001;&#x5B8F;&#x8F6F;&#x4EF6;&#x5305;&#x3001;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x548C;&#x6838;&#x5FC3;&#x7A0B;&#x5E8F;&#x3002; </li>
<li>/usr/include<br>&#x5305;&#x542B;&#x4E86;c&#x8BED;&#x8A00;&#x7684;&#x5934;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x591A;&#x4EE5;. h&#x7ED3;&#x5C3E;&#xFF0C;&#x7528;&#x6765;&#x63CF;&#x8FF0;c&#x8BED;&#x8A00;&#x7A0B;&#x5E8F;&#x4E2D;&#x7528;&#x5230;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3001;<br>&#x5B50;&#x8FC7;&#x7A0B;&#x548C;&#x5E38;&#x91CF;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x5E94;&#x8BE5;&#x653E;&#x5728;/usr/lib &#x4E0B;&#xFF0C;&#x4F46;&#x4E60;&#x60EF;&#x4E0A;&#x4E00;&#x76F4;&#x6CBF;&#x7528;&#x4E86;&#x8FD9;&#x4E2A;&#x540D;<br>&#x5B57;&#x3002; </li>
<li>/usr/lib<br>&#x5305;&#x542B;&#x4E86;&#x7A0B;&#x5E8F;&#x6216;&#x5B50;&#x7CFB;&#x7EDF;&#x7684;&#x4E0D;&#x53D8;&#x7684;&#x6570;&#x636E;&#x6587;&#x4EF6;&#xFF0C;&#x5305;&#x62EC;&#x4E00;&#x4E9B;s i t e - w i d e&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;&#x540D;&#x5B57;l i b&#x6765;&#x6E90;&#x4E8E;&#x5E93;<br>(library); &#x7F16;&#x7A0B;&#x7684;&#x539F;&#x59CB;&#x5E93;&#x4E5F;&#x5B58;&#x5728;/usr/lib &#x91CC;&#x3002;&#x5F53;&#x7F16;&#x8BD1;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x7A0B;&#x5E8F;&#x4FBF;&#x4F1A;&#x548C;&#x5176;&#x4E2D;&#x7684;&#x5E93;&#x8FDB;&#x884C;&#x8FDE;&#x63A5;&#x3002;&#x4E5F;<br>&#x6709;&#x8BB8;&#x591A;&#x7A0B;&#x5E8F;&#x628A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5B58;&#x5165;&#x5176;&#x4E2D;&#x3002; </li>
<li>/usr/local<br>&#x672C;&#x5730;&#x5B89;&#x88C5;&#x7684;&#x8F6F;&#x4EF6;&#x548C;&#x5176;&#x4ED6;&#x6587;&#x4EF6;&#x653E;&#x5728;&#x8FD9;&#x91CC;&#x3002;&#x8FD9;&#x4E0E;/ u s r&#x5F88;&#x76F8;&#x4F3C;&#x3002;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x8FD9;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x5927;<br>&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#xFF0C;&#x5982;t e x&#x3001;e m a c s&#x7B49;&#x3002; <h2 id="var&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"><a href="#var&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;" class="headerlink" title="/var&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"></a>/var&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</h2>/var &#x5305;&#x542B;&#x7CFB;&#x7EDF;&#x4E00;&#x822C;&#x8FD0;&#x884C;&#x65F6;&#x8981;&#x6539;&#x53D8;&#x7684;&#x6570;&#x636E;&#x3002;&#x901A;&#x5E38;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x6240;&#x5728;&#x7684;&#x76EE;&#x5F55;&#x7684;&#x5927;&#x5C0F;&#x662F;&#x8981;&#x7ECF;&#x5E38;&#x53D8;&#x5316;<br>&#x6216;&#x6269;&#x5145;&#x7684;&#x3002;&#x539F;&#x6765;/ v a r&#x76EE;&#x5F55;&#x4E2D;&#x6709;&#x4E9B;&#x5185;&#x5BB9;&#x662F;&#x5728;/ u s r&#x4E2D;&#x7684;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x4FDD;&#x6301;/ u s r&#x76EE;&#x5F55;&#x7684;&#x76F8;&#x5BF9;&#x7A33;&#x5B9A;&#xFF0C;&#x5C31;&#x628A;&#x90A3;<br>&#x4E9B;&#x9700;&#x8981;&#x7ECF;&#x5E38;&#x6539;&#x53D8;&#x7684;&#x76EE;&#x5F55;&#x653E;&#x5230;/ v a r&#x4E2D;&#x4E86;&#x3002;&#x6BCF;&#x4E2A;&#x7CFB;&#x7EDF;&#x662F;&#x7279;&#x5B9A;&#x7684;&#xFF0C;&#x5373;&#x4E0D;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4E0E;&#x5176;&#x4ED6;&#x8BA1;&#x7B97;&#x673A;&#x5171;&#x4EAB;&#x3002;<br>&#x4E0B;&#x9762;&#x5217;&#x51FA;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x76EE;&#x5F55;(&#x4E00;&#x4E9B;&#x4E0D;&#x592A;&#x91CD;&#x8981;&#x7684;&#x76EE;&#x5F55;&#x7701;&#x7565;&#x4E86;)&#x3002; </li>
<li>/var/catman<br>&#x5305;&#x62EC;&#x4E86;&#x683C;&#x5F0F;&#x5316;&#x8FC7;&#x7684;&#x5E2E;&#x52A9;( m a n )&#x9875;&#x3002;&#x5E2E;&#x52A9;&#x9875;&#x7684;&#x6E90;&#x6587;&#x4EF6;&#x4E00;&#x822C;&#x5B58;&#x5728;/ u s r / m a n / m a n&#x4E2D;&#xFF1B;&#x6709;&#x4E9B;m a n&#x9875;<br>&#x53EF;&#x80FD;&#x6709;&#x9884;&#x683C;&#x5F0F;&#x5316;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x5B58;&#x5728;/ u s r / m a n / c a t&#x4E2D;&#x3002;&#x800C;&#x5176;&#x4ED6;&#x7684;m a n&#x9875;&#x5728;&#x7B2C;&#x4E00;&#x6B21;&#x770B;&#x65F6;&#x90FD;&#x9700;&#x8981;&#x683C;&#x5F0F;&#x5316;&#xFF0C;<br>&#x683C;&#x5F0F;&#x5316;&#x5B8C;&#x7684;&#x7248;&#x672C;&#x5B58;&#x5728;/var/man &#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x5176;&#x4ED6;&#x4EBA;&#x518D;&#x770B;&#x76F8;&#x540C;&#x7684;&#x9875;&#x65F6;&#x5C31;&#x65E0;&#x987B;&#x7B49;&#x5F85;&#x683C;&#x5F0F;&#x5316;&#x4E86;&#x3002;<br>(/var/catman &#x7ECF;&#x5E38;&#x88AB;&#x6E05;&#x9664;&#xFF0C;&#x5C31;&#x50CF;&#x6E05;&#x9664;&#x4E34;&#x65F6;&#x76EE;&#x5F55;&#x4E00;&#x6837;&#x3002;) </li>
<li>/var/lib<br>&#x5B58;&#x653E;&#x7CFB;&#x7EDF;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x65F6;&#x8981;&#x6539;&#x53D8;&#x7684;&#x6587;&#x4EF6;&#x3002; </li>
<li>/var/local<br>&#x5B58;&#x653E;/usr/local &#x4E2D;&#x5B89;&#x88C5;&#x7684;&#x7A0B;&#x5E8F;&#x7684;&#x53EF;&#x53D8;&#x6570;&#x636E;(&#x5373;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x5B89;&#x88C5;&#x7684;&#x7A0B;&#x5E8F;)&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x5FC5;&#x8981;&#xFF0C;<br>&#x5373;&#x4F7F;&#x672C;&#x5730;&#x5B89;&#x88C5;&#x7684;&#x7A0B;&#x5E8F;&#x4E5F;&#x4F1A;&#x4F7F;&#x7528;&#x5176;&#x4ED6;/var &#x76EE;&#x5F55;&#xFF0C;&#x4F8B;&#x5982;/var/lock &#x3002; </li>
<li>/var/lock<br>&#x9501;&#x5B9A;&#x6587;&#x4EF6;&#x3002;&#x8BB8;&#x591A;&#x7A0B;&#x5E8F;&#x9075;&#x5FAA;&#x5728;/var/lock &#x4E2D;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x9501;&#x5B9A;&#x6587;&#x4EF6;&#x7684;&#x7EA6;&#x5B9A;&#xFF0C;&#x4EE5;&#x7528;&#x6765;&#x652F;&#x6301;&#x4ED6;&#x4EEC;&#x6B63;&#x5728;<br>&#x4F7F;&#x7528;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x8BBE;&#x5907;&#x6216;&#x6587;&#x4EF6;&#x3002;&#x5176;&#x4ED6;&#x7A0B;&#x5E8F;&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#x4E2A;&#x9501;&#x5B9A;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x518D;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x8BBE;&#x5907;&#x6216;&#x6587;<br>&#x4EF6;&#x3002; </li>
<li>/var/log<br>&#x5404;&#x79CD;&#x7A0B;&#x5E8F;&#x7684;&#x65E5;&#x5FD7;( l o g )&#x6587;&#x4EF6;&#xFF0C;&#x5C24;&#x5176;&#x662F;login (/var/log/wtmp log&#x7EAA;&#x5F55;&#x6240;&#x6709;&#x5230;&#x7CFB;&#x7EDF;&#x7684;&#x767B;&#x5F55;&#x548C;&#x6CE8;<br>&#x9500;) &#x548C;syslog (/var/log/messages &#x7EAA;&#x5F55;&#x5B58;&#x50A8;&#x6240;&#x6709;&#x6838;&#x5FC3;&#x548C;&#x7CFB;&#x7EDF;&#x7A0B;&#x5E8F;&#x4FE1;&#x606F;)&#x3002;/var/log &#x91CC;&#x7684;&#x6587;&#x4EF6;&#x7ECF;&#x5E38;&#x4E0D;<br>&#x786E;&#x5B9A;&#x5730;&#x589E;&#x957F;&#xFF0C;&#x5E94;&#x8BE5;&#x5B9A;&#x671F;&#x6E05;&#x9664;&#x3002; </li>
<li>/var/run<br>&#x4FDD;&#x5B58;&#x5728;&#x4E0B;&#x4E00;&#x6B21;&#x7CFB;&#x7EDF;&#x5F15;&#x5BFC;&#x524D;&#x6709;&#x6548;&#x7684;&#x5173;&#x4E8E;&#x7CFB;&#x7EDF;&#x7684;&#x4FE1;&#x606F;&#x6587;&#x4EF6;&#x3002;&#x4F8B;&#x5982;&#xFF0C; /var/run/utmp &#x5305;&#x542B;&#x5F53;&#x524D;&#x767B;<br>&#x5F55;&#x7684;&#x7528;&#x6237;&#x7684;&#x4FE1;&#x606F;&#x3002; </li>
<li>/var/spool<br>&#x653E;&#x7F6E;&#x201C;&#x5047;&#x8131;&#x673A;( s p o o l )&#x201D;&#x7A0B;&#x5E8F;&#x7684;&#x76EE;&#x5F55;&#xFF0C;&#x5982;m a i l&#x3001;n e w s&#x3001;&#x6253;&#x5370;&#x961F;&#x5217;&#x548C;&#x5176;&#x4ED6;&#x961F;&#x5217;&#x5DE5;&#x4F5C;&#x7684;&#x76EE;&#x5F55;&#x3002;&#x6BCF;<br>&#x4E2A;&#x4E0D;&#x540C;&#x7684;s p o o l&#x5728;/var/spool &#x4E0B;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5B50;&#x76EE;&#x5F55;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x7528;&#x6237;&#x7684;&#x90AE;&#x7BB1;&#x5C31;&#x5B58;&#x653E;&#x5728;/var/spool/mail &#x4E2D;&#x3002; </li>
<li>/var/tmp<br>&#x6BD4;/tmp &#x5141;&#x8BB8;&#x66F4;&#x5927;&#x7684;&#x6216;&#x9700;&#x8981;&#x5B58;&#x5728;&#x8F83;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#x3002;<br>&#x6CE8;&#x610F;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x53EF;&#x80FD;&#x4E0D;&#x5141;&#x8BB8;/var/tmp &#x6709;&#x5F88;&#x65E7;&#x7684;&#x6587;&#x4EF6;&#x3002; <h2 id="proc&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"><a href="#proc&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;" class="headerlink" title="/proc&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"></a>/proc&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</h2>/proc &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x662F;&#x4E00;&#x4E2A;&#x4F2A;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x76EE;&#x5F55;&#xFF0C;&#x56E0;&#x800C;&#x8FD9;&#x662F;&#x4E00;<br>&#x4E2A;&#x975E;&#x5E38;&#x7279;&#x6B8A;&#x7684;&#x76EE;&#x5F55;&#x3002;&#x5B83;&#x5E76;&#x4E0D;&#x5B58;&#x5728;&#x4E8E;&#x67D0;&#x4E2A;&#x78C1;&#x76D8;&#x4E0A;&#xFF0C;&#x800C;&#x662F;&#x7531;&#x6838;&#x5FC3;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x4EA7;&#x751F;&#x3002;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x7528;&#x4E8E;&#x63D0;<br>&#x4F9B;&#x5173;&#x4E8E;&#x7CFB;&#x7EDF;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x4E0B;&#x9762;&#x8BF4;&#x660E;&#x4E00;&#x4E9B;&#x6700;&#x91CD;&#x8981;&#x7684;&#x6587;&#x4EF6;&#x548C;&#x76EE;&#x5F55;(/proc &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5728;proc man&#x9875;&#x4E2D;&#x6709;&#x66F4;&#x8BE6;<br>&#x7EC6;&#x7684;&#x8BF4;&#x660E;)&#x3002; </li>
<li>/proc/x<br>&#x5173;&#x4E8E;&#x8FDB;&#x7A0B;x&#x7684;&#x4FE1;&#x606F;&#x76EE;&#x5F55;&#xFF0C;&#x8FD9;&#x4E00;x&#x662F;&#x8FD9;&#x4E00;&#x8FDB;&#x7A0B;&#x7684;&#x6807;&#x8BC6;&#x53F7;&#x3002;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x5728;/proc &#x4E0B;&#x6709;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;&#x81EA;<br>&#x5DF1;&#x8FDB;&#x7A0B;&#x53F7;&#x7684;&#x76EE;&#x5F55;&#x3002; </li>
<li>/proc/cpuinfo<br>&#x5B58;&#x653E;&#x5904;&#x7406;&#x5668;( c p u )&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5982;c p u&#x7684;&#x7C7B;&#x578B;&#x3001;&#x5236;&#x9020;&#x5546;&#x3001;&#x578B;&#x53F7;&#x548C;&#x6027;&#x80FD;&#x7B49;&#x3002; </li>
<li>/proc/devices<br>&#x5F53;&#x524D;&#x8FD0;&#x884C;&#x7684;&#x6838;&#x5FC3;&#x914D;&#x7F6E;&#x7684;&#x8BBE;&#x5907;&#x9A71;&#x52A8;&#x7684;&#x5217;&#x8868;&#x3002; </li>
<li>/proc/dma<br>&#x663E;&#x793A;&#x5F53;&#x524D;&#x4F7F;&#x7528;&#x7684;d m a&#x901A;&#x9053;&#x3002; </li>
<li>/proc/filesystems<br>&#x6838;&#x5FC3;&#x914D;&#x7F6E;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4FE1;&#x606F;&#x3002; </li>
<li>/proc/interrupts<br>&#x663E;&#x793A;&#x88AB;&#x5360;&#x7528;&#x7684;&#x4E2D;&#x65AD;&#x4FE1;&#x606F;&#x548C;&#x5360;&#x7528;&#x8005;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4EE5;&#x53CA;&#x88AB;&#x5360;&#x7528;&#x7684;&#x6570;&#x91CF;&#x3002; </li>
<li>/proc/ioports<br>&#x5F53;&#x524D;&#x4F7F;&#x7528;&#x7684;i / o&#x7AEF;&#x53E3;&#x3002; </li>
<li>/proc/kcore<br>&#x7CFB;&#x7EDF;&#x7269;&#x7406;&#x5185;&#x5B58;&#x6620;&#x50CF;&#x3002;&#x4E0E;&#x7269;&#x7406;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#xFF0C;&#x7136;&#x800C;&#x5B9E;&#x9645;&#x4E0A;&#x6CA1;&#x6709;&#x5360;&#x7528;&#x8FD9;&#x4E48;&#x591A;&#x5185;&#x5B58;&#xFF1B;&#x5B83;&#x4EC5;<br>&#x4EC5;&#x662F;&#x5728;&#x7A0B;&#x5E8F;&#x8BBF;&#x95EE;&#x5B83;&#x65F6;&#x624D;&#x88AB;&#x521B;&#x5EFA;&#x3002;(&#x6CE8;&#x610F;&#xFF1A;&#x9664;&#x975E;&#x4F60;&#x628A;&#x5B83;&#x62F7;&#x8D1D;&#x5230;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#xFF0C;&#x5426;&#x5219;/proc &#x4E0B;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;<br>&#x4E1C;&#x897F;&#x5360;&#x7528;&#x4EFB;&#x4F55;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x3002;) </li>
<li>/proc/kmsg<br>&#x6838;&#x5FC3;&#x8F93;&#x51FA;&#x7684;&#x6D88;&#x606F;&#x3002;&#x4E5F;&#x4F1A;&#x88AB;&#x9001;&#x5230;s y s l o g&#x3002; </li>
<li>/proc/ksyms<br>&#x6838;&#x5FC3;&#x7B26;&#x53F7;&#x8868;&#x3002; </li>
<li>/proc/loadavg<br>&#x7CFB;&#x7EDF;&#x201C;&#x5E73;&#x5747;&#x8D1F;&#x8F7D;&#x201D;&#xFF1B; 3&#x4E2A;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#x6307;&#x793A;&#x5668;&#x6307;&#x51FA;&#x7CFB;&#x7EDF;&#x5F53;&#x524D;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x3002; </li>
<li>/proc/meminfo<br>&#x5404;&#x79CD;&#x5B58;&#x50A8;&#x5668;&#x4F7F;&#x7528;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC;&#x7269;&#x7406;&#x5185;&#x5B58;&#x548C;&#x4EA4;&#x6362;&#x5206;&#x533A;( s w a p )&#x3002; </li>
<li>/proc/modules<br>&#x5B58;&#x653E;&#x5F53;&#x524D;&#x52A0;&#x8F7D;&#x4E86;&#x54EA;&#x4E9B;&#x6838;&#x5FC3;&#x6A21;&#x5757;&#x4FE1;&#x606F;&#x3002; </li>
<li>/proc/net<br>&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#x3002; </li>
<li>/proc/self<br>&#x5B58;&#x653E;&#x5230;&#x67E5;&#x770B;/proc &#x7684;&#x7A0B;&#x5E8F;&#x7684;&#x8FDB;&#x7A0B;&#x76EE;&#x5F55;&#x7684;&#x7B26;&#x53F7;&#x8FDE;&#x63A5;&#x3002;&#x5F53;2&#x4E2A;&#x8FDB;&#x7A0B;&#x67E5;&#x770B;/proc &#x65F6;&#xFF0C;&#x8FD9;&#x5C06;&#x4F1A;&#x662F;&#x4E0D;&#x540C;<br>&#x7684;&#x8FDE;&#x63A5;&#x3002;&#x8FD9;&#x4E3B;&#x8981;&#x4FBF;&#x4E8E;&#x7A0B;&#x5E8F;&#x5F97;&#x5230;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x8FDB;&#x7A0B;&#x76EE;&#x5F55;&#x3002; </li>
<li>/proc/stat<br>&#x7CFB;&#x7EDF;&#x7684;&#x4E0D;&#x540C;&#x72B6;&#x6001;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x7CFB;&#x7EDF;&#x542F;&#x52A8;&#x540E;&#x9875;&#x9762;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#x7684;&#x6B21;&#x6570;&#x3002; </li>
<li>/proc/uptime<br>&#x7CFB;&#x7EDF;&#x542F;&#x52A8;&#x7684;&#x65F6;&#x95F4;&#x957F;&#x5EA6;&#x3002; </li>
<li>/proc/version<br>&#x6838;&#x5FC3;&#x7248;&#x672C;&#x3002;</li>
</ol>
]]></content>
    
    <summary type="html">
    
      linux下的文件结构，每个文件夹用途
    
    </summary>
    
      <category term="Linux" scheme="http://code.idea4j.com/categories/Linux/"/>
    
    
      <category term="Linux" scheme="http://code.idea4j.com/tags/Linux/"/>
    
  </entry>
  
  <entry>
    <title>linux下svn安装</title>
    <link href="http://code.idea4j.com/2016/12/21/svn1/"/>
    <id>http://code.idea4j.com/2016/12/21/svn1/</id>
    <published>2016-12-21T03:15:45.000Z</published>
    <updated>2016-12-22T01:42:23.950Z</updated>
    
    <content type="html"><![CDATA[<p>&#x5B89;&#x88C5;&#x6B65;&#x9AA4;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>yum install subversion</li>
<li>&#x67E5;&#x770B;&#x5B89;&#x88C5;&#x7248;&#x672C; svnserve &#x2013;version</li>
<li>&#x521B;&#x5EFA;SVN&#x7248;&#x672C;&#x5E93;&#x76EE;&#x5F55; mkdir -p /var/svn/idea4j</li>
<li>&#x521B;&#x5EFA;&#x7248;&#x672C;&#x5E93;  svnadmin create /var/svn/idea4j<br>&#x6267;&#x884C;&#x4E86;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x4E4B;&#x540E;&#x4F1A;&#x5728;/var/svn/idea4j&#x76EE;&#x5F55;&#x4E0B;&#x751F;&#x6210;&#x5982;&#x4E0B;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;:conf  db  format  hooks  locks  README.txt</li>
<li>&#x8FDB;&#x5165;conf&#x76EE;&#x5F55;&#xFF08;&#x8BE5;svn&#x7248;&#x672C;&#x5E93;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF09;cd conf/<br>authz&#x6587;&#x4EF6;&#x662F;&#x6743;&#x9650;&#x63A7;&#x5236;&#x6587;&#x4EF6;<br>passwd&#x662F;&#x5E10;&#x53F7;&#x5BC6;&#x7801;&#x6587;&#x4EF6;<br>svnserve.conf SVN&#x670D;&#x52A1;&#x914D;&#x7F6E;&#x6587;&#x4EF6;</li>
<li>&#x8BBE;&#x7F6E;&#x5E10;&#x53F7;&#x5BC6;&#x7801; vi passwd<br>&#x5728;[users]&#x5757;&#x4E2D;&#x6DFB;&#x52A0;&#x7528;&#x6237;&#x548C;&#x5BC6;&#x7801;&#xFF0C;&#x683C;&#x5F0F;&#xFF1A;&#x5E10;&#x53F7;=&#x5BC6;&#x7801;&#xFF0C;&#x5982;markee=guagua99</li>
<li>&#x8BBE;&#x7F6E;&#x6743;&#x9650; vim authz<br>```txt<br>[groups]<br>#&#x589E;&#x52A0;&#x7EC4;<br>developers = markee<br>product = markee<br>[idea4j:/]<br>#&#x7EC4;&#x6743;&#x9650;<br>@developers=rw</li>
</ol>
<ul>
<li>=<br>``` </li>
</ul>
<ol>
<li><p>&#x4FEE;&#x6539;svnserve.conf&#x6587;&#x4EF6;  vi svnserve.conf<br>&#x6253;&#x5F00;&#x4E0B;&#x9762;&#x7684;&#x51E0;&#x4E2A;&#x6CE8;&#x91CA;&#xFF1A;<br>anon-access = read #&#x533F;&#x540D;&#x7528;&#x6237;&#x53EF;&#x8BFB;<br>auth-access = write #&#x6388;&#x6743;&#x7528;&#x6237;&#x53EF;&#x5199;<br>password-db = passwd #&#x4F7F;&#x7528;&#x54EA;&#x4E2A;&#x6587;&#x4EF6;&#x4F5C;&#x4E3A;&#x8D26;&#x53F7;&#x6587;&#x4EF6;<br>authz-db = authz #&#x4F7F;&#x7528;&#x54EA;&#x4E2A;&#x6587;&#x4EF6;&#x4F5C;&#x4E3A;&#x6743;&#x9650;&#x6587;&#x4EF6;<br>realm = /var/svn/idea4j # &#x8BA4;&#x8BC1;&#x7A7A;&#x95F4;&#x540D;&#xFF0C;&#x7248;&#x672C;&#x5E93;&#x6240;&#x5728;&#x76EE;&#x5F55;</p>
</li>
<li><p>&#x542F;&#x52A8;svn&#x7248;&#x672C;&#x5E93;  svnserve -d -r /var/svn/idea4j&#xFF08;&#x505C;&#x6B62;SVN&#x547D;&#x4EE4;  killall svnserve&#xFF09;</p>
</li>
</ol>
<ol>
<li>&#x9A8C;&#x8BC1;svn<br>mkdir test<br>svn import test svn://192.168.152.128/zd/svn/project/ -m &#x201C;zhudan&#x201D;</li>
</ol>
]]></content>
    
    <summary type="html">
    
      linux下svn安装
    
    </summary>
    
      <category term="svn" scheme="http://code.idea4j.com/categories/svn/"/>
    
    
      <category term="svn" scheme="http://code.idea4j.com/tags/svn/"/>
    
  </entry>
  
  <entry>
    <title>堆分配参数</title>
    <link href="http://code.idea4j.com/2016/12/19/jvm2/"/>
    <id>http://code.idea4j.com/2016/12/19/jvm2/</id>
    <published>2016-12-19T07:42:09.000Z</published>
    <updated>2016-12-19T09:50:39.418Z</updated>
    
    <content type="html"><![CDATA[<ul>
<li>-Xms:&#x8BBE;&#x7F6E;java&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x65F6;&#x7684;&#x521D;&#x59CB;&#x5806;&#x5927;&#x5C0F;&#x3002;</li>
<li>-Xmx:&#x8BBE;&#x7F6E;java&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x80FD;&#x83B7;&#x5F97;&#x7684;&#x6700;&#x5927;&#x5806;&#x5927;&#x5C0F;&#x3002;</li>
<li>-Xss:&#x8BBE;&#x7F6E;java&#x7EBF;&#x7A0B;&#x6808;&#x5927;&#x5C0F;&#x3002;</li>
<li>-XX:MinHeapFreeRatio:&#x8BBE;&#x7F6E;&#x5806;&#x7A7A;&#x95F4;&#x6700;&#x5C0F;&#x7A7A;&#x95F2;&#x6BD4;&#x4F8B;&#x3002;JVM&#x5728;&#x5806;&#x7A7A;&#x95F2;&#x5185;&#x5B58;&#x5C0F;&#x4E8E;&#x6B64;&#x503C;&#x65F6;&#x4F1A;&#x6269;&#x5C55;&#x7A7A;&#x95F4;&#x3002;</li>
<li>-XX:MaxHeapFreeRatio:&#x8BBE;&#x7F6E;&#x5806;&#x7A7A;&#x95F4;&#x6700;&#x5927;&#x7A7A;&#x95F2;&#x6BD4;&#x4F8B;&#x3002;JVM&#x5728;&#x5806;&#x7A7A;&#x95F2;&#x5185;&#x5B58;&#x5927;&#x4E8E;&#x6B64;&#x503C;&#x65F6;&#x4F1A;&#x538B;&#x7F29;&#x7A7A;&#x95F4;&#x3002;&#x3002;</li>
<li>-XX:NewSize:&#x8BBE;&#x7F6E;&#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;&#x3002;</li>
<li>-XX:NewRatio:&#x8BBE;&#x7F6E;&#x65B0;&#x751F;&#x4EE3;&#x548C;&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x6BD4;&#x4F8B;&#xFF0C;&#x5B83;&#x7B49;&#x4E8E;&#x8001;&#x5E74;&#x4EE3;/&#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;&#x3002;</li>
<li>-XX:SurviorRatio:&#x65B0;&#x751F;&#x4EE3;&#x4E2D;eden&#x533A;&#x4E0E;survivior&#x533A;&#x7684;&#x6BD4;&#x4F8B;&#x3002;</li>
<li>-XX:MaxPermSize:&#x8BBE;&#x7F6E;&#x6700;&#x5927;&#x6301;&#x4E45;&#x533A;&#x5806;&#x5927;&#x5C0F;&#x3002;</li>
<li>-XX:PermSize:&#x8BBE;&#x7F6E;&#x6C38;&#x4E45;&#x533A;&#x7684;&#x521D;&#x59CB;&#x503C;&#x3002;</li>
<li>-XX:TargetSurvivorRatio:&#x8BBE;&#x7F6E;survivior&#x533A;&#x7684;&#x53EF;&#x4F7F;&#x7528;&#x7387;&#x3002;&#x5F53;survivior&#x533A;&#x7684;&#x7A7A;&#x95F4;&#x4F7F;&#x7528;&#x7387;&#x8FBE;&#x5230;&#x8FD9;&#x4E2A;&#x503C;&#x662F;&#xFF0C;&#x4F1A;&#x5C06;&#x5BF9;&#x8C61;&#x9001;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x3002;</li>
</ul>
]]></content>
    
    <summary type="html">
    
      与java程序堆内存相关的jvm参数
    
    </summary>
    
      <category term="jvm" scheme="http://code.idea4j.com/categories/jvm/"/>
    
    
      <category term="jvm" scheme="http://code.idea4j.com/tags/jvm/"/>
    
  </entry>
  
  <entry>
    <title>开发中遇到的异常</title>
    <link href="http://code.idea4j.com/2016/12/16/questions/"/>
    <id>http://code.idea4j.com/2016/12/16/questions/</id>
    <published>2016-12-16T03:04:21.000Z</published>
    <updated>2016-12-21T06:23:52.039Z</updated>
    
    <content type="html"><![CDATA[<p>1.&#x5F02;&#x5E38;&#x4E2D;&#x51FA;&#x73B0;Mapped Statements collection does not contain value for<br>mybatis mapper.xml &#x548C; &#x5B9E;&#x4F53;Mapper (&#x5373;Dao) &#x4E0D;&#x5BF9;&#x5E94; &#xFF0C;&#x68C0;&#x67E5;namespace&#x662F;&#x5426;&#x5BF9;&#x5E94;</p>
<p>2.svnserve.conf:12: Option expected&#x7684;&#x95EE;&#x9898;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;<br>subversion&#x8BFB;&#x53D6;&#x914D;&#x7F6E;&#x6587;&#x4EF6;svnserve.conf&#x65F6;&#xFF0C;&#x65E0;&#x6CD5;&#x8BC6;&#x522B;&#x6709;&#x524D;&#x7F6E;&#x7A7A;&#x683C;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;</p>
]]></content>
    
    <summary type="html">
    
      开发中遇到的异常
    
    </summary>
    
      <category term="异常" scheme="http://code.idea4j.com/categories/%E5%BC%82%E5%B8%B8/"/>
    
    
      <category term="异常" scheme="http://code.idea4j.com/tags/%E5%BC%82%E5%B8%B8/"/>
    
  </entry>
  
  <entry>
    <title>mybatis generator 配置文件</title>
    <link href="http://code.idea4j.com/2016/12/12/mybatis1/"/>
    <id>http://code.idea4j.com/2016/12/12/mybatis1/</id>
    <published>2016-12-12T09:04:37.000Z</published>
    <updated>2016-12-16T03:31:42.126Z</updated>
    
    <content type="html"><![CDATA[<figure class="highlight xml"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div><div class="line">22</div><div class="line">23</div><div class="line">24</div><div class="line">25</div><div class="line">26</div><div class="line">27</div><div class="line">28</div><div class="line">29</div><div class="line">30</div><div class="line">31</div><div class="line">32</div><div class="line">33</div><div class="line">34</div><div class="line">35</div><div class="line">36</div><div class="line">37</div><div class="line">38</div><div class="line">39</div><div class="line">40</div><div class="line">41</div><div class="line">42</div><div class="line">43</div><div class="line">44</div><div class="line">45</div><div class="line">46</div><div class="line">47</div><div class="line">48</div><div class="line">49</div><div class="line">50</div><div class="line">51</div><div class="line">52</div><div class="line">53</div><div class="line">54</div><div class="line">55</div><div class="line">56</div><div class="line">57</div><div class="line">58</div><div class="line">59</div><div class="line">60</div><div class="line">61</div><div class="line">62</div><div class="line">63</div><div class="line">64</div><div class="line">65</div><div class="line">66</div><div class="line">67</div><div class="line">68</div></pre></td><td class="code"><pre><div class="line">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot; ?&gt;  </div><div class="line"><span class="meta">&lt;!DOCTYPE generatorConfiguration PUBLIC &quot;-//mybatis.org//DTD MyBatis Generator Configuration 1.0//EN&quot; </span></div><div class="line">&quot;http://mybatis.org/dtd/mybatis-generator-config_1_0.dtd&quot; &gt;  </div><div class="line"><span class="tag">&lt;<span class="name">generatorConfiguration</span>&gt;</span>  </div><div class="line">    <span class="comment">&lt;!-- &#x5F15;&#x5165;&#x914D;&#x7F6E;&#x6587;&#x4EF6; --&gt;</span>  </div><div class="line">    <span class="tag">&lt;<span class="name">properties</span> <span class="attr">resource</span>=<span class="string">&quot;init.properties&quot;</span>/&gt;</span>  </div><div class="line">      </div><div class="line">    <span class="comment">&lt;!-- &#x6307;&#x5B9A;&#x6570;&#x636E;&#x8FDE;&#x63A5;&#x9A71;&#x52A8;jar&#x5730;&#x5740; --&gt;</span>  </div><div class="line">    <span class="tag">&lt;<span class="name">classPathEntry</span> <span class="attr">location</span>=<span class="string">&quot;${classPath}&quot;</span> /&gt;</span>  </div><div class="line">      </div><div class="line">    <span class="comment">&lt;!-- &#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x4E00;&#x4E2A;context --&gt;</span>  </div><div class="line">    <span class="tag">&lt;<span class="name">context</span> <span class="attr">id</span>=<span class="string">&quot;infoGuardian&quot;</span>&gt;</span>  </div><div class="line">        <span class="comment">&lt;!-- &#x6CE8;&#x91CA; --&gt;</span>  </div><div class="line">        <span class="tag">&lt;<span class="name">commentGenerator</span> &gt;</span>  </div><div class="line">            <span class="tag">&lt;<span class="name">property</span> <span class="attr">name</span>=<span class="string">&quot;suppressAllComments&quot;</span> <span class="attr">value</span>=<span class="string">&quot;false&quot;</span>/&gt;</span><span class="comment">&lt;!-- &#x662F;&#x5426;&#x53D6;&#x6D88;&#x6CE8;&#x91CA; --&gt;</span>  </div><div class="line">            <span class="tag">&lt;<span class="name">property</span> <span class="attr">name</span>=<span class="string">&quot;suppressDate&quot;</span> <span class="attr">value</span>=<span class="string">&quot;true&quot;</span> /&gt;</span> <span class="comment">&lt;!-- &#x662F;&#x5426;&#x751F;&#x6210;&#x6CE8;&#x91CA;&#x4EE3;&#x65F6;&#x95F4;&#x6233;--&gt;</span>  </div><div class="line">        <span class="tag">&lt;/<span class="name">commentGenerator</span>&gt;</span>  </div><div class="line">          </div><div class="line">        <span class="comment">&lt;!-- jdbc&#x8FDE;&#x63A5; --&gt;</span>  </div><div class="line">        <span class="tag">&lt;<span class="name">jdbcConnection</span> <span class="attr">driverClass</span>=<span class="string">&quot;${jdbc_driver}&quot;</span>  </span></div><div class="line">            <span class="attr">connectionURL</span>=<span class="string">&quot;${jdbc_url}&quot;</span> <span class="attr">userId</span>=<span class="string">&quot;${jdbc_user}&quot;</span>  </div><div class="line">            <span class="attr">password</span>=<span class="string">&quot;${jdbc_password}&quot;</span> /&gt;  </div><div class="line">          </div><div class="line">        <span class="comment">&lt;!-- &#x7C7B;&#x578B;&#x8F6C;&#x6362; --&gt;</span>  </div><div class="line">        <span class="tag">&lt;<span class="name">javaTypeResolver</span>&gt;</span>  </div><div class="line">            <span class="comment">&lt;!-- &#x662F;&#x5426;&#x4F7F;&#x7528;bigDecimal&#xFF0C; false&#x53EF;&#x81EA;&#x52A8;&#x8F6C;&#x5316;&#x4EE5;&#x4E0B;&#x7C7B;&#x578B;&#xFF08;Long, Integer, Short, etc.&#xFF09; --&gt;</span>  </div><div class="line">            <span class="tag">&lt;<span class="name">property</span> <span class="attr">name</span>=<span class="string">&quot;forceBigDecimals&quot;</span> <span class="attr">value</span>=<span class="string">&quot;false&quot;</span>/&gt;</span>  </div><div class="line">        <span class="tag">&lt;/<span class="name">javaTypeResolver</span>&gt;</span>  </div><div class="line">          </div><div class="line">        <span class="comment">&lt;!-- &#x751F;&#x6210;&#x5B9E;&#x4F53;&#x7C7B;&#x5730;&#x5740; --&gt;</span>    </div><div class="line">        <span class="tag">&lt;<span class="name">javaModelGenerator</span> <span class="attr">targetPackage</span>=<span class="string">&quot;com.oop.eksp.user.model&quot;</span>  </span></div><div class="line">            <span class="attr">targetProject</span>=<span class="string">&quot;${project}&quot;</span> &gt;  </div><div class="line">            <span class="comment">&lt;!-- &#x662F;&#x5426;&#x5728;&#x5F53;&#x524D;&#x8DEF;&#x5F84;&#x4E0B;&#x65B0;&#x52A0;&#x4E00;&#x5C42;schema,eg&#xFF1A;fase&#x8DEF;&#x5F84;com.oop.eksp.user.model&#xFF0C; true:com.oop.eksp.user.model.[schemaName] --&gt;</span>  </div><div class="line">            <span class="tag">&lt;<span class="name">property</span> <span class="attr">name</span>=<span class="string">&quot;enableSubPackages&quot;</span> <span class="attr">value</span>=<span class="string">&quot;false&quot;</span>/&gt;</span>  </div><div class="line">            <span class="comment">&lt;!-- &#x662F;&#x5426;&#x9488;&#x5BF9;string&#x7C7B;&#x578B;&#x7684;&#x5B57;&#x6BB5;&#x5728;set&#x7684;&#x65F6;&#x5019;&#x8FDB;&#x884C;trim&#x8C03;&#x7528; --&gt;</span>  </div><div class="line">            <span class="tag">&lt;<span class="name">property</span> <span class="attr">name</span>=<span class="string">&quot;trimStrings&quot;</span> <span class="attr">value</span>=<span class="string">&quot;true&quot;</span>/&gt;</span>  </div><div class="line">        <span class="tag">&lt;/<span class="name">javaModelGenerator</span>&gt;</span>  </div><div class="line">          </div><div class="line">        <span class="comment">&lt;!-- &#x751F;&#x6210;mapxml&#x6587;&#x4EF6; --&gt;</span>  </div><div class="line">        <span class="tag">&lt;<span class="name">sqlMapGenerator</span> <span class="attr">targetPackage</span>=<span class="string">&quot;com.oop.eksp.user.data&quot;</span>  </span></div><div class="line">            <span class="attr">targetProject</span>=<span class="string">&quot;${project}&quot;</span> &gt;  </div><div class="line">            <span class="comment">&lt;!-- &#x662F;&#x5426;&#x5728;&#x5F53;&#x524D;&#x8DEF;&#x5F84;&#x4E0B;&#x65B0;&#x52A0;&#x4E00;&#x5C42;schema,eg&#xFF1A;fase&#x8DEF;&#x5F84;com.oop.eksp.user.model&#xFF0C; true:com.oop.eksp.user.model.[schemaName] --&gt;</span>  </div><div class="line">            <span class="tag">&lt;<span class="name">property</span> <span class="attr">name</span>=<span class="string">&quot;enableSubPackages&quot;</span> <span class="attr">value</span>=<span class="string">&quot;false&quot;</span> /&gt;</span>  </div><div class="line">        <span class="tag">&lt;/<span class="name">sqlMapGenerator</span>&gt;</span>  </div><div class="line">          </div><div class="line">        <span class="comment">&lt;!-- &#x751F;&#x6210;mapxml&#x5BF9;&#x5E94;client&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x63A5;&#x53E3;dao --&gt;</span>      </div><div class="line">        <span class="tag">&lt;<span class="name">javaClientGenerator</span> <span class="attr">targetPackage</span>=<span class="string">&quot;com.oop.eksp.user.data&quot;</span>  </span></div><div class="line">            <span class="attr">targetProject</span>=<span class="string">&quot;${project}&quot;</span> <span class="attr">type</span>=<span class="string">&quot;XMLMAPPER&quot;</span> &gt;  </div><div class="line">            <span class="comment">&lt;!-- &#x662F;&#x5426;&#x5728;&#x5F53;&#x524D;&#x8DEF;&#x5F84;&#x4E0B;&#x65B0;&#x52A0;&#x4E00;&#x5C42;schema,eg&#xFF1A;fase&#x8DEF;&#x5F84;com.oop.eksp.user.model&#xFF0C; true:com.oop.eksp.user.model.[schemaName] --&gt;</span>  </div><div class="line">            <span class="tag">&lt;<span class="name">property</span> <span class="attr">name</span>=<span class="string">&quot;enableSubPackages&quot;</span> <span class="attr">value</span>=<span class="string">&quot;false&quot;</span> /&gt;</span>  </div><div class="line">        <span class="tag">&lt;/<span class="name">javaClientGenerator</span>&gt;</span>  </div><div class="line">          </div><div class="line">        <span class="comment">&lt;!-- &#x914D;&#x7F6E;&#x8868;&#x4FE1;&#x606F; --&gt;</span>      </div><div class="line">        <span class="tag">&lt;<span class="name">table</span> <span class="attr">schema</span>=<span class="string">&quot;${jdbc_user}&quot;</span> <span class="attr">tableName</span>=<span class="string">&quot;s_user&quot;</span>  </span></div><div class="line">            <span class="attr">domainObjectName</span>=<span class="string">&quot;UserEntity&quot;</span> <span class="attr">enableCountByExample</span>=<span class="string">&quot;false&quot;</span>  </div><div class="line">            <span class="attr">enableDeleteByExample</span>=<span class="string">&quot;false&quot;</span> <span class="attr">enableSelectByExample</span>=<span class="string">&quot;false&quot;</span>  </div><div class="line">            <span class="attr">enableUpdateByExample</span>=<span class="string">&quot;false&quot;</span>&gt;  </div><div class="line">            <span class="comment">&lt;!-- schema&#x5373;&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x540D; tableName&#x4E3A;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x636E;&#x5E93;&#x8868; domainObjectName&#x662F;&#x8981;&#x751F;&#x6210;&#x7684;&#x5B9E;&#x4F53;&#x7C7B; enable*ByExample   </span></div><div class="line">                &#x662F;&#x5426;&#x751F;&#x6210; example&#x7C7B;   --&gt;  </div><div class="line">              </div><div class="line">            <span class="comment">&lt;!-- &#x5FFD;&#x7565;&#x5217;&#xFF0C;&#x4E0D;&#x751F;&#x6210;bean &#x5B57;&#x6BB5; --&gt;</span>  </div><div class="line">            <span class="tag">&lt;<span class="name">ignoreColumn</span> <span class="attr">column</span>=<span class="string">&quot;FRED&quot;</span> /&gt;</span>  </div><div class="line">            <span class="comment">&lt;!-- &#x6307;&#x5B9A;&#x5217;&#x7684;java&#x6570;&#x636E;&#x7C7B;&#x578B; --&gt;</span>  </div><div class="line">            <span class="tag">&lt;<span class="name">columnOverride</span> <span class="attr">column</span>=<span class="string">&quot;LONG_VARCHAR_FIELD&quot;</span> <span class="attr">jdbcType</span>=<span class="string">&quot;VARCHAR&quot;</span> /&gt;</span>  </div><div class="line">        <span class="tag">&lt;/<span class="name">table</span>&gt;</span>  </div><div class="line">  </div><div class="line">    <span class="tag">&lt;/<span class="name">context</span>&gt;</span>  </div><div class="line"><span class="tag">&lt;/<span class="name">generatorConfiguration</span>&gt;</span></div></pre></td></tr></table></figure>]]></content>
    
    <summary type="html">
    
      mybatis generator xml详解
    
    </summary>
    
      <category term="mybatis" scheme="http://code.idea4j.com/categories/mybatis/"/>
    
    
      <category term="mybatis" scheme="http://code.idea4j.com/tags/mybatis/"/>
    
  </entry>
  
  <entry>
    <title>jinyan</title>
    <link href="http://code.idea4j.com/2016/12/08/jinyan/"/>
    <id>http://code.idea4j.com/2016/12/08/jinyan/</id>
    <published>2016-12-08T02:19:08.000Z</published>
    <updated>2016-12-08T05:29:38.310Z</updated>
    
    <content type="html"><![CDATA[<p>1.&#x7ED9;&#x6240;&#x6709;&#x4EBA;&#x53C2;&#x4E0E;&#x611F;</p>
]]></content>
    
    <summary type="html">
    
      &lt;p&gt;1.&amp;#x7ED9;&amp;#x6240;&amp;#x6709;&amp;#x4EBA;&amp;#x53C2;&amp;#x4E0E;&amp;#x611F;&lt;/p&gt;

    
    </summary>
    
      <category term="其他" scheme="http://code.idea4j.com/categories/%E5%85%B6%E4%BB%96/"/>
    
    
      <category term="其他" scheme="http://code.idea4j.com/tags/%E5%85%B6%E4%BB%96/"/>
    
  </entry>
  
  <entry>
    <title>Java API 学习之ClassLoader</title>
    <link href="http://code.idea4j.com/2016/12/08/javaapi1/"/>
    <id>http://code.idea4j.com/2016/12/08/javaapi1/</id>
    <published>2016-12-08T02:13:42.000Z</published>
    <updated>2016-12-08T02:37:07.979Z</updated>
    
    <content type="html"><![CDATA[<h3 id="&#x57FA;&#x672C;&#x4FE1;&#x606F;"><a href="#&#x57FA;&#x672C;&#x4FE1;&#x606F;" class="headerlink" title="&#x57FA;&#x672C;&#x4FE1;&#x606F;"></a>&#x57FA;&#x672C;&#x4FE1;&#x606F;</h3><ul>
<li>&#x5305;&#xFF1A;java.lang</li>
<li>&#x7236;&#x7C7B;&#xFF1A;java.lang.Object</li>
<li>&#x7C7B;&#x5C5E;&#x6027;&#xFF1A;&#x62BD;&#x8C61;&#x7C7B;</li>
<li>&#x5B9A;&#x4E49;&#x8BED;&#x53E5;&#xFF1A;public abstract class ClassLoader extends Object</li>
</ul>
<h3 id="&#x6982;&#x5FF5;&#x548C;&#x7528;&#x9014;"><a href="#&#x6982;&#x5FF5;&#x548C;&#x7528;&#x9014;" class="headerlink" title="&#x6982;&#x5FF5;&#x548C;&#x7528;&#x9014;"></a>&#x6982;&#x5FF5;&#x548C;&#x7528;&#x9014;</h3><p>&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x662F;&#x8D1F;&#x8D23;&#x52A0;&#x8F7D;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x5982;&#x679C;&#x7ED9;&#x5B9A;&#x7C7B;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x540D;&#x79F0;&#xFF0C;&#x90A3;&#x4E48;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4F1A;&#x8BD5;&#x56FE;&#x67E5;&#x627E;&#x6216;&#x751F;&#x6210;&#x6784;&#x6210;&#x7C7B;&#x5B9A;&#x4E49;&#x7684;&#x6570;&#x636E;&#x3002;&#x4E00;&#x822C;&#x7B56;&#x7565;&#x662F;&#x5C06;&#x540D;&#x79F0;&#x8F6C;&#x6362;<br>&#x4E3A;&#x67D0;&#x4E2A;&#x6587;&#x4EF6;&#x540D;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x8BFB;&#x53D6;&#x8BE5;&#x540D;&#x79F0;&#x7684;&#x201C;&#x7C7B;&#x6587;&#x4EF6;&#x201D;&#x3002;<br>&#x6BCF;&#x4E2A; Class &#x5BF9;&#x8C61;&#x90FD;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x5BF9;&#x5B9A;&#x4E49;&#x5B83;&#x7684; ClassLoader &#x7684;&#x5F15;&#x7528;&#x3002;&#x6BCF;&#x4E2A;Class&#x6709;&#x4E00;&#x4E2A;getClassLoader()<br>&#x6570;&#x7EC4;&#x7C7B;&#x7684; Class &#x5BF9;&#x8C61;&#x4E0D;&#x662F;&#x7531;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x7531; Java &#x8FD0;&#x884C;&#x65F6;&#x6839;&#x636E;&#x9700;&#x8981;&#x81EA;&#x52A8;&#x521B;&#x5EFA;&#x3002;&#x6570;&#x7EC4;&#x7C7B;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x7531; Class.getClassLoader()<br>&#x8FD4;&#x56DE;&#xFF0C;&#x8BE5;&#x52A0;&#x8F7D;&#x5668;&#x4E0E;&#x5176;&#x5143;&#x7D20;&#x7C7B;&#x578B;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF1B;&#x5982;&#x679C;&#x8BE5;&#x5143;&#x7D20;&#x7C7B;&#x578B;&#x662F;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#xFF0C;&#x5219;&#x8BE5;&#x6570;&#x7EC4;&#x7C7B;&#x6CA1;&#x6709;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x3002;</p>
]]></content>
    
    <summary type="html">
    
      &lt;h3 id=&quot;&amp;#x57FA;&amp;#x672C;&amp;#x4FE1;&amp;#x606F;&quot;&gt;&lt;a href=&quot;#&amp;#x57FA;&amp;#x672C;&amp;#x4FE1;&amp;#x606F;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x57FA;&amp;#x672C;&amp;#x4FE1;&amp;#x6
    
    </summary>
    
      <category term="java" scheme="http://code.idea4j.com/categories/java/"/>
    
    
      <category term="java" scheme="http://code.idea4j.com/tags/java/"/>
    
  </entry>
  
  <entry>
    <title>Lua语言积累</title>
    <link href="http://code.idea4j.com/2016/12/05/lua1/"/>
    <id>http://code.idea4j.com/2016/12/05/lua1/</id>
    <published>2016-12-05T11:11:25.000Z</published>
    <updated>2016-12-05T11:19:32.389Z</updated>
    
    <content type="html"><![CDATA[<p>&#x5B66;&#x4E60;&#x53C2;&#x8003;&#x7F51;&#x7AD9;&#xFF1A;</p>
<p><a href="http://book.luaer.cn/" target="_blank" rel="external">http://book.luaer.cn/</a><br><a href="http://lua-users.org/wiki/TutorialDirectory" target="_blank" rel="external">http://lua-users.org/wiki/TutorialDirectory</a></p>
]]></content>
    
    <summary type="html">
    
      lua
    
    </summary>
    
      <category term="Lua" scheme="http://code.idea4j.com/categories/Lua/"/>
    
    
      <category term="Lua" scheme="http://code.idea4j.com/tags/Lua/"/>
    
  </entry>
  
  <entry>
    <title>sql语句：根据身份证得到省份、生日、性别</title>
    <link href="http://code.idea4j.com/2016/11/30/sqljl/"/>
    <id>http://code.idea4j.com/2016/11/30/sqljl/</id>
    <published>2016-11-30T08:08:54.000Z</published>
    <updated>2016-11-30T08:18:05.724Z</updated>
    
    <content type="html"><![CDATA[<h3 id="&#x6839;&#x636E;&#x8EAB;&#x4EFD;&#x8BC1;&#x5F97;&#x5230;&#x7701;&#x4EFD;"><a href="#&#x6839;&#x636E;&#x8EAB;&#x4EFD;&#x8BC1;&#x5F97;&#x5230;&#x7701;&#x4EFD;" class="headerlink" title="&#x6839;&#x636E;&#x8EAB;&#x4EFD;&#x8BC1;&#x5F97;&#x5230;&#x7701;&#x4EFD;"></a>&#x6839;&#x636E;&#x8EAB;&#x4EFD;&#x8BC1;&#x5F97;&#x5230;&#x7701;&#x4EFD;</h3><p>CASE<br>WHEN SUBSTRING(id_card_no,1,2)=11  THEN  &#x2018;&#x5317;&#x4EAC;&#x5E02;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=12  THEN  &#x2018;&#x5929;&#x6D25;&#x5E02;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=13  THEN  &#x2018;&#x6CB3;&#x5317;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=14  THEN  &#x2018;&#x5C71;&#x897F;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=15  THEN  &#x2018;&#x5185;&#x8499;&#x53E4;&#x81EA;&#x6CBB;&#x533A;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=21  THEN  &#x2018;&#x8FBD;&#x5B81;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=22  THEN  &#x2018;&#x5409;&#x6797;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=23  THEN  &#x2018;&#x9ED1;&#x9F99;&#x6C5F;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=31  THEN  &#x2018;&#x4E0A;&#x6D77;&#x5E02;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=32  THEN  &#x2018;&#x6C5F;&#x82CF;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=33  THEN  &#x2018;&#x6D59;&#x6C5F;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=34  THEN  &#x2018;&#x5B89;&#x5FBD;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=35  THEN  &#x2018;&#x798F;&#x5EFA;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=36  THEN  &#x2018;&#x6C5F;&#x897F;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=37  THEN  &#x2018;&#x5C71;&#x4E1C;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=41  THEN  &#x2018;&#x6CB3;&#x5357;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=42  THEN  &#x2018;&#x6E56;&#x5317;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=43  THEN  &#x2018;&#x6E56;&#x5357;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=44  THEN  &#x2018;&#x5E7F;&#x4E1C;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=45  THEN  &#x2018;&#x5E7F;&#x897F;&#x58EE;&#x65CF;&#x81EA;&#x6CBB;&#x533A;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=46  THEN  &#x2018;&#x6D77;&#x5357;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=50  THEN  &#x2018;&#x91CD;&#x5E86;&#x5E02;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=51  THEN  &#x2018;&#x56DB;&#x5DDD;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=52  THEN  &#x2018;&#x8D35;&#x5DDE;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=53  THEN  &#x2018;&#x4E91;&#x5357;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=54  THEN  &#x2018;&#x897F;&#x85CF;&#x81EA;&#x6CBB;&#x533A;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=61  THEN  &#x2018;&#x9655;&#x897F;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=62  THEN  &#x2018;&#x7518;&#x8083;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=63  THEN  &#x2018;&#x9752;&#x6D77;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=64  THEN  &#x2018;&#x5B81;&#x590F;&#x56DE;&#x65CF;&#x81EA;&#x6CBB;&#x533A;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=65  THEN  &#x2018;&#x65B0;&#x7586;&#x7EF4;&#x543E;&#x5C14;&#x81EA;&#x6CBB;&#x533A;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=71  THEN  &#x2018;&#x53F0;&#x6E7E;&#x7701;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=81  THEN  &#x2018;&#x9999;&#x6E2F;&#x7279;&#x522B;&#x884C;&#x653F;&#x533A;&#x2019;<br>WHEN SUBSTRING(id_card_no,1,2)=91  THEN  &#x2018;&#x6FB3;&#x95E8;&#x7279;&#x522B;&#x884C;&#x653F;&#x533A;&#x2019;<br>END AS &#x2018;&#x7701;&#x4EFD;&#x2019;,</p>
<h3 id="&#x751F;&#x65E5;"><a href="#&#x751F;&#x65E5;" class="headerlink" title="&#x751F;&#x65E5;"></a>&#x751F;&#x65E5;</h3><p>SUBSTRING(id_card_no,7,8) AS &#x2018;&#x751F;&#x65E5;&#x2019;</p>
<h3 id="&#x6027;&#x522B;"><a href="#&#x6027;&#x522B;" class="headerlink" title="&#x6027;&#x522B;"></a>&#x6027;&#x522B;</h3><p>CASE WHEN (SUBSTRING(u.id_card_no,LENGTH(u.id_card_no)-1,1)%2=0) THEN &#x2018;&#x5973;&#x2019; ELSE &#x2018;&#x7537;&#x2019; END</p>
]]></content>
    
    <summary type="html">
    
      根据身份证得到省份、生日、性别
    
    </summary>
    
      <category term="mysql" scheme="http://code.idea4j.com/categories/mysql/"/>
    
    
      <category term="mysql" scheme="http://code.idea4j.com/tags/mysql/"/>
    
  </entry>
  
  <entry>
    <title>js与jQuery 获取父窗、子窗的iframe</title>
    <link href="http://code.idea4j.com/2016/11/28/jqiframe/"/>
    <id>http://code.idea4j.com/2016/11/28/jqiframe/</id>
    <published>2016-11-28T08:48:31.000Z</published>
    <updated>2016-11-28T08:57:19.213Z</updated>
    
    <content type="html"><![CDATA[<p>&#x4ECA;&#x5929;&#x722C;&#x53D6;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x7684;&#x65F6;&#x5019;&#xFF0C;chrome&#x5F00;&#x53D1;&#x7740;&#x5DE5;&#x5177;&#x660E;&#x660E;&#x770B;&#x5230;&#x4E86;&#x4E00;&#x4E2A;input&#x4E0A;&#x7684;id&#xFF0C;&#x4F46;&#x662F;&#x7528;jQuery &#x5374;&#x5F97;&#x4E0D;&#x5230;&#xFF0C;&#x4ED4;&#x7EC6;&#x89C2;&#x5BDF;Dom&#x624D;&#x53D1;&#x73B0;<br>&#x6B64;id&#x662F;&#x5728;&#x4E00;&#x4E2A;iframe&#x91CC;&#x9762;&#xFF0C;&#x4E8E;&#x662F;&#x67E5;&#x8BE2;&#x4EE5;&#x4E9B;&#x8D44;&#x6599;&#x603B;&#x7ED3;&#x5982;&#x4E0B;&#xFF1A;</p>
<h2 id="js"><a href="#js" class="headerlink" title="js"></a>js</h2><h3 id="&#x5728;&#x7236;&#x7A97;&#x53E3;&#x4E2D;&#x83B7;&#x53D6;iframe&#x4E2D;&#x7684;&#x5143;&#x7D20;"><a href="#&#x5728;&#x7236;&#x7A97;&#x53E3;&#x4E2D;&#x83B7;&#x53D6;iframe&#x4E2D;&#x7684;&#x5143;&#x7D20;" class="headerlink" title="&#x5728;&#x7236;&#x7A97;&#x53E3;&#x4E2D;&#x83B7;&#x53D6;iframe&#x4E2D;&#x7684;&#x5143;&#x7D20;"></a>&#x5728;&#x7236;&#x7A97;&#x53E3;&#x4E2D;&#x83B7;&#x53D6;iframe&#x4E2D;&#x7684;&#x5143;&#x7D20;</h3><p>1&#x3001;<br>&#x683C;&#x5F0F;&#xFF1A;window.frames[&#x201C;iframe&#x7684;name&#x503C;&#x201D;].document.getElementByIdx_x(&#x201C;iframe&#x4E2D;&#x63A7;&#x4EF6;&#x7684;ID&#x201D;).click();<br>&#x5B9E;&#x4F8B;&#xFF1A;window.frames[&#x201C;ifm&#x201D;].document.getElementByIdx_x(&#x201C;btnOk&#x201D;).click();<br>2&#x3001;<br>&#x683C;&#x5F0F;&#xFF1A;<br>var obj=document.getElementByIdx_x(&#x201C;iframe&#x7684;name&#x201D;).contentWindow;<br>var ifmObj=obj.document.getElementByIdx_x(&#x201C;iframe&#x4E2D;&#x63A7;&#x4EF6;&#x7684;ID&#x201D;);<br>ifmObj.click();<br>&#x5B9E;&#x4F8B;&#xFF1A;<br>var obj=document.getElementByIdx_x(&#x201C;ifm&#x201D;).contentWindow;<br>var ifmObj=obj.document.getElementByIdx_x(&#x201C;btnOk&#x201D;);<br>ifmObj.click();</p>
<h3 id="&#x5728;iframe&#x4E2D;&#x83B7;&#x53D6;&#x7236;&#x7A97;&#x53E3;&#x7684;&#x5143;&#x7D20;"><a href="#&#x5728;iframe&#x4E2D;&#x83B7;&#x53D6;&#x7236;&#x7A97;&#x53E3;&#x7684;&#x5143;&#x7D20;" class="headerlink" title="&#x5728;iframe&#x4E2D;&#x83B7;&#x53D6;&#x7236;&#x7A97;&#x53E3;&#x7684;&#x5143;&#x7D20;"></a>&#x5728;iframe&#x4E2D;&#x83B7;&#x53D6;&#x7236;&#x7A97;&#x53E3;&#x7684;&#x5143;&#x7D20;</h3><p>&#x683C;&#x5F0F;&#xFF1A;window.parent.document.getElementByIdx_x(&#x201C;&#x7236;&#x7A97;&#x53E3;&#x7684;&#x5143;&#x7D20;ID&#x201D;).click();<br>&#x5B9E;&#x4F8B;&#xFF1A;window.parent.document.getElementByIdx_x(&#x201C;btnOk&#x201D;).click();</p>
<h2 id="jquery"><a href="#jquery" class="headerlink" title="jquery"></a>jquery</h2><h3 id="&#x5728;&#x7236;&#x7A97;&#x53E3;&#x4E2D;&#x83B7;&#x53D6;iframe&#x4E2D;&#x7684;&#x5143;&#x7D20;-1"><a href="#&#x5728;&#x7236;&#x7A97;&#x53E3;&#x4E2D;&#x83B7;&#x53D6;iframe&#x4E2D;&#x7684;&#x5143;&#x7D20;-1" class="headerlink" title="&#x5728;&#x7236;&#x7A97;&#x53E3;&#x4E2D;&#x83B7;&#x53D6;iframe&#x4E2D;&#x7684;&#x5143;&#x7D20;"></a>&#x5728;&#x7236;&#x7A97;&#x53E3;&#x4E2D;&#x83B7;&#x53D6;iframe&#x4E2D;&#x7684;&#x5143;&#x7D20;</h3><p>1&#x3001;<br>&#x683C;&#x5F0F;&#xFF1A;$(&#x201C;#iframe&#x7684;ID&#x201D;).contents().find(&#x201C;#iframe&#x4E2D;&#x7684;&#x63A7;&#x4EF6;ID&#x201D;).click();//jquery &#x65B9;&#x6CD5;1<br>&#x5B9E;&#x4F8B;&#xFF1A;$(&#x201C;#ifm&#x201D;).contents().find(&#x201C;#btnOk&#x201D;).click();//jquery &#x65B9;&#x6CD5;1<br>2&#x3001;<br>&#x683C;&#x5F0F;&#xFF1A;$(&#x201C;#iframe&#x4E2D;&#x7684;&#x63A7;&#x4EF6;ID&#x201D;,document.frames(&#x201C;frame&#x7684;name&#x201D;).document).click();//jquery &#x65B9;&#x6CD5;2<br>&#x5B9E;&#x4F8B;&#xFF1A;$(&#x201C;#btnOk&#x201D;,document.frames(&#x201C;ifm&#x201D;).document).click();//jquery &#x65B9;&#x6CD5;2</p>
<h3 id="&#x5728;iframe&#x4E2D;&#x83B7;&#x53D6;&#x7236;&#x7A97;&#x53E3;&#x7684;&#x5143;&#x7D20;-1"><a href="#&#x5728;iframe&#x4E2D;&#x83B7;&#x53D6;&#x7236;&#x7A97;&#x53E3;&#x7684;&#x5143;&#x7D20;-1" class="headerlink" title="&#x5728;iframe&#x4E2D;&#x83B7;&#x53D6;&#x7236;&#x7A97;&#x53E3;&#x7684;&#x5143;&#x7D20;"></a>&#x5728;iframe&#x4E2D;&#x83B7;&#x53D6;&#x7236;&#x7A97;&#x53E3;&#x7684;&#x5143;&#x7D20;</h3><p>&#x683C;&#x5F0F;&#xFF1A;$(&#x2018;#&#x7236;&#x7A97;&#x53E3;&#x4E2D;&#x7684;&#x5143;&#x7D20;ID&#x2019;, parent.document).click();<br>&#x5B9E;&#x4F8B;&#xFF1A;$(&#x2018;#btnOk&#x2019;, parent.document).click();</p>
]]></content>
    
    <summary type="html">
    
      js与jQuery 获取父窗、子窗的iframe
    
    </summary>
    
      <category term="jQuery" scheme="http://code.idea4j.com/categories/jQuery/"/>
    
    
      <category term="jQuery" scheme="http://code.idea4j.com/tags/jQuery/"/>
    
      <category term="iframe" scheme="http://code.idea4j.com/tags/iframe/"/>
    
  </entry>
  
  <entry>
    <title>sql优化</title>
    <link href="http://code.idea4j.com/2016/11/14/sqlty/"/>
    <id>http://code.idea4j.com/2016/11/14/sqlty/</id>
    <published>2016-11-14T06:24:28.000Z</published>
    <updated>2016-11-14T09:14:40.244Z</updated>
    
    <content type="html"><![CDATA[<ol>
<li>&#x5BF9;&#x67E5;&#x8BE2;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#xFF0C;&#x5E94;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5168;&#x8868;&#x626B;&#x63CF;&#xFF0C;&#x9996;&#x5148;&#x5E94;&#x8003;&#x8651;&#x5728; where &#x53CA; order by &#x6D89;&#x53CA;&#x7684;&#x5217;&#x4E0A;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x3002;</li>
<li>&#x5E94;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5728; where &#x5B50;&#x53E5;&#x4E2D;&#x4F7F;&#x7528;!=&#x6216;&lt;&gt;&#x64CD;&#x4F5C;&#x7B26;&#xFF0C;&#x5426;&#x5219;&#x5C06;&#x5F15;&#x64CE;&#x653E;&#x5F03;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x800C;&#x8FDB;&#x884C;&#x5168;&#x8868;&#x626B;&#x63CF;&#x3002;</li>
<li>&#x5E94;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5728; where &#x5B50;&#x53E5;&#x4E2D;&#x5BF9;&#x5B57;&#x6BB5;&#x8FDB;&#x884C; null &#x503C;&#x5224;&#x65AD;&#xFF0C;&#x5426;&#x5219;&#x5C06;&#x5BFC;&#x81F4;&#x5F15;&#x64CE;&#x653E;&#x5F03;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x800C;&#x8FDB;&#x884C;&#x5168;&#x8868;&#x626B;&#x63CF;&#xFF0C;&#x5982;&#xFF1A;<br>select id from t where num is null<br>&#x53EF;&#x4EE5;&#x5728;num&#x4E0A;&#x8BBE;&#x7F6E;&#x9ED8;&#x8BA4;&#x503C;0&#xFF0C;&#x786E;&#x4FDD;&#x8868;&#x4E2D;num&#x5217;&#x6CA1;&#x6709;null&#x503C;&#xFF0C;&#x7136;&#x540E;&#x8FD9;&#x6837;&#x67E5;&#x8BE2;&#xFF1A;<br>select id from t where num=0</li>
<li>&#x5E94;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5728; where &#x5B50;&#x53E5;&#x4E2D;&#x4F7F;&#x7528; or &#x6765;&#x8FDE;&#x63A5;&#x6761;&#x4EF6;&#xFF0C;&#x5426;&#x5219;&#x5C06;&#x5BFC;&#x81F4;&#x5F15;&#x64CE;&#x653E;&#x5F03;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x800C;&#x8FDB;&#x884C;&#x5168;&#x8868;&#x626B;&#x63CF;&#xFF0C;&#x5982;&#xFF1A;<br>select id from t where num=10 or num=20<br>&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x67E5;&#x8BE2;&#xFF1A;<br>select id from t where num=10<br>union all<br>select id from t where num=20</li>
<li>&#x4E0B;&#x9762;&#x7684;&#x67E5;&#x8BE2;&#x4E5F;&#x5C06;&#x5BFC;&#x81F4;&#x5168;&#x8868;&#x626B;&#x63CF;&#xFF1A;<br>select id from t where name like &#x2018;%abc%&#x2019;<br>&#x82E5;&#x8981;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5168;&#x6587;&#x68C0;&#x7D22;&#x3002;</li>
<li>in &#x548C; not in &#x4E5F;&#x8981;&#x614E;&#x7528;&#xFF0C;&#x5426;&#x5219;&#x4F1A;&#x5BFC;&#x81F4;&#x5168;&#x8868;&#x626B;&#x63CF;&#xFF0C;&#x5982;&#xFF1A;<br>select id from t where num in(1,2,3)<br>&#x5BF9;&#x4E8E;&#x8FDE;&#x7EED;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x80FD;&#x7528; between &#x5C31;&#x4E0D;&#x8981;&#x7528; in &#x4E86;&#xFF1A;<br>select id from t where num between 1 and 3</li>
<li>&#x5982;&#x679C;&#x5728; where &#x5B50;&#x53E5;&#x4E2D;&#x4F7F;&#x7528;&#x53C2;&#x6570;&#xFF0C;&#x4E5F;&#x4F1A;&#x5BFC;&#x81F4;&#x5168;&#x8868;&#x626B;&#x63CF;&#x3002;&#x56E0;&#x4E3A;SQL&#x53EA;&#x6709;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x624D;&#x4F1A;&#x89E3;&#x6790;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x4F46;&#x4F18;&#x5316;&#x7A0B;&#x5E8F;&#x4E0D;&#x80FD;&#x5C06;&#x8BBF;&#x95EE;&#x8BA1;&#x5212;&#x7684;&#x9009;&#x62E9;&#x63A8;&#x8FDF;&#x5230;&#x8FD0;&#x884C;&#x65F6;;&#x5B83;&#x5FC5;&#x987B;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x8FDB;&#x884C;&#x9009;&#x62E9;&#x3002;&#x7136; &#x800C;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x5EFA;&#x7ACB;&#x8BBF;&#x95EE;&#x8BA1;&#x5212;&#xFF0C;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x8FD8;&#x662F;&#x672A;&#x77E5;&#x7684;&#xFF0C;&#x56E0;&#x800C;&#x65E0;&#x6CD5;&#x4F5C;&#x4E3A;&#x7D22;&#x5F15;&#x9009;&#x62E9;&#x7684;&#x8F93;&#x5165;&#x9879;&#x3002;&#x5982;&#x4E0B;&#x9762;&#x8BED;&#x53E5;&#x5C06;&#x8FDB;&#x884C;&#x5168;&#x8868;&#x626B;&#x63CF;&#xFF1A;<br>select id from t where num=@num<br>&#x53EF;&#x4EE5;&#x6539;&#x4E3A;&#x5F3A;&#x5236;&#x67E5;&#x8BE2;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#xFF1A;<br>select id from t with(index(&#x7D22;&#x5F15;&#x540D;)) where num=@num</li>
<li>&#x5E94;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5728; where &#x5B50;&#x53E5;&#x4E2D;&#x5BF9;&#x5B57;&#x6BB5;&#x8FDB;&#x884C;&#x8868;&#x8FBE;&#x5F0F;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x5C06;&#x5BFC;&#x81F4;&#x5F15;&#x64CE;&#x653E;&#x5F03;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x800C;&#x8FDB;&#x884C;&#x5168;&#x8868;&#x626B;&#x63CF;&#x3002;&#x5982;&#xFF1A;<br>select id from t where num/2=100<br>&#x5E94;&#x6539;&#x4E3A;:<br>select id from t where num=100*2</li>
<li>&#x5E94;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5728;where&#x5B50;&#x53E5;&#x4E2D;&#x5BF9;&#x5B57;&#x6BB5;&#x8FDB;&#x884C;&#x51FD;&#x6570;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x5C06;&#x5BFC;&#x81F4;&#x5F15;&#x64CE;&#x653E;&#x5F03;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x800C;&#x8FDB;&#x884C;&#x5168;&#x8868;&#x626B;&#x63CF;&#x3002;&#x5982;&#xFF1A;<br>select id from t where substring(name,1,3)=&#x2019;abc&#x2019;&#x2013;name&#x4EE5;abc&#x5F00;&#x5934;&#x7684;id<br>select id from t where datediff(day,createdate,&#x2019;2005-11-30&#x2019;)=0&#x2013;&#x2019;2005-11-30&#x2019;&#x751F;&#x6210;&#x7684;id<br>&#x5E94;&#x6539;&#x4E3A;:<br>select id from t where name like &#x2018;abc%&#x2019;<br>select id from t where createdate&gt;=&#x2019;2005-11-30&#x2019; and createdate&lt;&#x2019;2005-12-1&#x2019;</li>
<li>&#x4E0D;&#x8981;&#x5728; where &#x5B50;&#x53E5;&#x4E2D;&#x7684;&#x201C;=&#x201D;&#x5DE6;&#x8FB9;&#x8FDB;&#x884C;&#x51FD;&#x6570;&#x3001;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#x6216;&#x5176;&#x4ED6;&#x8868;&#x8FBE;&#x5F0F;&#x8FD0;&#x7B97;&#xFF0C;&#x5426;&#x5219;&#x7CFB;&#x7EDF;&#x5C06;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x3002;</li>
<li>&#x5728;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x5B57;&#x6BB5;&#x4F5C;&#x4E3A;&#x6761;&#x4EF6;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x8BE5;&#x7D22;&#x5F15;&#x662F;&#x590D;&#x5408;&#x7D22;&#x5F15;&#xFF0C;&#x90A3;&#x4E48;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x5230;&#x8BE5;&#x7D22;&#x5F15;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x4F5C;&#x4E3A;&#x6761;&#x4EF6;&#x65F6;&#x624D;&#x80FD;&#x4FDD;&#x8BC1;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x8BE5;&#x7D22;&#x5F15;&#xFF0C;&#x5426;&#x5219;&#x8BE5;&#x7D22;&#x5F15;&#x5C06;&#x4E0D;&#x4F1A;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x8BA9;&#x5B57;&#x6BB5;&#x987A;&#x5E8F;&#x4E0E;&#x7D22;&#x5F15;&#x987A;&#x5E8F;&#x76F8;&#x4E00;&#x81F4;&#x3002;</li>
<li><p>&#x4E0D;&#x8981;&#x5199;&#x4E00;&#x4E9B;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#x67E5;&#x8BE2;&#xFF0C;&#x5982;&#x9700;&#x8981;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x7A7A;&#x8868;&#x7ED3;&#x6784;&#xFF1A;<br>select col1,col2 into #t from t where 1=0<br>&#x8FD9;&#x7C7B;&#x4EE3;&#x7801;&#x4E0D;&#x4F1A;&#x8FD4;&#x56DE;&#x4EFB;&#x4F55;&#x7ED3;&#x679C;&#x96C6;&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x6D88;&#x8017;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x7684;&#xFF0C;&#x5E94;&#x6539;&#x6210;&#x8FD9;&#x6837;&#xFF1A;<br>create table #t(&#x2026;)</p>
</li>
<li><p>&#x5F88;&#x591A;&#x65F6;&#x5019;&#x7528; exists &#x4EE3;&#x66FF; in &#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x9009;&#x62E9;&#xFF1A;<br>select num from a where num in(select num from b)<br>&#x7528;&#x4E0B;&#x9762;&#x7684;&#x8BED;&#x53E5;&#x66FF;&#x6362;&#xFF1A;<br>select num from a where exists(select 1 from b where num=a.num)</p>
</li>
<li>&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7D22;&#x5F15;&#x5BF9;&#x67E5;&#x8BE2;&#x90FD;&#x6709;&#x6548;&#xFF0C;SQL&#x662F;&#x6839;&#x636E;&#x8868;&#x4E2D;&#x6570;&#x636E;&#x6765;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x7684;&#xFF0C;&#x5F53;&#x7D22;&#x5F15;&#x5217;&#x6709;&#x5927;&#x91CF;&#x6570;&#x636E;&#x91CD;&#x590D;&#x65F6;&#xFF0C;SQL&#x67E5;&#x8BE2;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x53BB;&#x5229;&#x7528;&#x7D22;&#x5F15;&#xFF0C;&#x5982;&#x4E00;&#x8868;&#x4E2D;&#x6709;&#x5B57;&#x6BB5;sex&#xFF0C;male&#x3001;female&#x51E0;&#x4E4E;&#x5404;&#x4E00;&#x534A;&#xFF0C;&#x90A3;&#x4E48;&#x5373;&#x4F7F;&#x5728;sex&#x4E0A;&#x5EFA;&#x4E86;&#x7D22;&#x5F15;&#x4E5F;&#x5BF9;&#x67E5;&#x8BE2;&#x6548;&#x7387;&#x8D77;&#x4E0D;&#x4E86;&#x4F5C;&#x7528;&#x3002;</li>
<li>&#x7D22;&#x5F15;&#x5E76;&#x4E0D;&#x662F;&#x8D8A;&#x591A;&#x8D8A;&#x597D;&#xFF0C;&#x7D22;&#x5F15;&#x56FA;&#x7136;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x76F8;&#x5E94;&#x7684; select &#x7684;&#x6548;&#x7387;&#xFF0C;&#x4F46;&#x540C;&#x65F6;&#x4E5F;&#x964D;&#x4F4E;&#x4E86; insert &#x53CA; update &#x7684;&#x6548;&#x7387;&#xFF0C;&#x56E0;&#x4E3A; insert &#x6216; update &#x65F6;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x91CD;&#x5EFA;&#x7D22;&#x5F15;&#xFF0C;&#x6240;&#x4EE5;&#x600E;&#x6837;&#x5EFA;&#x7D22;&#x5F15;&#x9700;&#x8981;&#x614E;&#x91CD;&#x8003;&#x8651;&#xFF0C;&#x89C6;&#x5177;&#x4F53;&#x60C5;&#x51B5;&#x800C;&#x5B9A;&#x3002;&#x4E00;&#x4E2A;&#x8868;&#x7684;&#x7D22;&#x5F15;&#x6570;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x8D85;&#x8FC7;6&#x4E2A;&#xFF0C;&#x82E5;&#x592A;&#x591A;&#x5219;&#x5E94;&#x8003;&#x8651;&#x4E00;&#x4E9B;&#x4E0D;&#x5E38;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x5217;&#x4E0A;&#x5EFA;&#x7684;&#x7D22;&#x5F15;&#x662F;&#x5426;&#x6709; &#x5FC5;&#x8981;&#x3002;</li>
<li>&#x5E94;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x907F;&#x514D;&#x66F4;&#x65B0; clustered &#x7D22;&#x5F15;&#x6570;&#x636E;&#x5217;&#xFF0C;&#x56E0;&#x4E3A; clustered &#x7D22;&#x5F15;&#x6570;&#x636E;&#x5217;&#x7684;&#x987A;&#x5E8F;&#x5C31;&#x662F;&#x8868;&#x8BB0;&#x5F55;&#x7684;&#x7269;&#x7406;&#x5B58;&#x50A8;&#x987A;&#x5E8F;&#xFF0C;&#x4E00;&#x65E6;&#x8BE5;&#x5217;&#x503C;&#x6539;&#x53D8;&#x5C06;&#x5BFC;&#x81F4;&#x6574;&#x4E2A;&#x8868;&#x8BB0;&#x5F55;&#x7684;&#x987A;&#x5E8F;&#x7684;&#x8C03;&#x6574;&#xFF0C;&#x4F1A;&#x8017;&#x8D39;&#x76F8;&#x5F53;&#x5927;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x82E5;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x9891;&#x7E41;&#x66F4;&#x65B0; clustered &#x7D22;&#x5F15;&#x6570;&#x636E;&#x5217;&#xFF0C;&#x90A3;&#x4E48;&#x9700;&#x8981;&#x8003;&#x8651;&#x662F;&#x5426;&#x5E94;&#x5C06;&#x8BE5;&#x7D22;&#x5F15;&#x5EFA;&#x4E3A; clustered &#x7D22;&#x5F15;&#x3002;</li>
<li>&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x6570;&#x5B57;&#x578B;&#x5B57;&#x6BB5;&#xFF0C;&#x82E5;&#x53EA;&#x542B;&#x6570;&#x503C;&#x4FE1;&#x606F;&#x7684;&#x5B57;&#x6BB5;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x8BBE;&#x8BA1;&#x4E3A;&#x5B57;&#x7B26;&#x578B;&#xFF0C;&#x8FD9;&#x4F1A;&#x964D;&#x4F4E;&#x67E5;&#x8BE2;&#x548C;&#x8FDE;&#x63A5;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x5E76;&#x4F1A;&#x589E;&#x52A0;&#x5B58;&#x50A8;&#x5F00;&#x9500;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5F15;&#x64CE;&#x5728;&#x5904;&#x7406;&#x67E5;&#x8BE2;&#x548C;&#x8FDE;&#x63A5;&#x65F6;&#x4F1A;&#x9010;&#x4E2A;&#x6BD4;&#x8F83;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x6BCF;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x6570;&#x5B57;&#x578B;&#x800C;&#x8A00;&#x53EA;&#x9700;&#x8981;&#x6BD4;&#x8F83;&#x4E00;&#x6B21;&#x5C31;&#x591F;&#x4E86;&#x3002;</li>
<li>&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x4F7F;&#x7528; varchar/nvarchar &#x4EE3;&#x66FF; char/nchar &#xFF0C;&#x56E0;&#x4E3A;&#x9996;&#x5148;&#x53D8;&#x957F;&#x5B57;&#x6BB5;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x5C0F;&#xFF0C;&#x53EF;&#x4EE5;&#x8282;&#x7701;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x5176;&#x6B21;&#x5BF9;&#x4E8E;&#x67E5;&#x8BE2;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x8F83;&#x5C0F;&#x7684;&#x5B57;&#x6BB5;&#x5185;&#x641C;&#x7D22;&#x6548;&#x7387;&#x663E;&#x7136;&#x8981;&#x9AD8;&#x4E9B;&#x3002;</li>
<li>&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x90FD;&#x4E0D;&#x8981;&#x4F7F;&#x7528; select <em> from t &#xFF0C;&#x7528;&#x5177;&#x4F53;&#x7684;&#x5B57;&#x6BB5;&#x5217;&#x8868;&#x4EE3;&#x66FF;&#x201C;</em>&#x201D;&#xFF0C;&#x4E0D;&#x8981;&#x8FD4;&#x56DE;&#x7528;&#x4E0D;&#x5230;&#x7684;&#x4EFB;&#x4F55;&#x5B57;&#x6BB5;&#x3002;</li>
<li>&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x8868;&#x53D8;&#x91CF;&#x6765;&#x4EE3;&#x66FF;&#x4E34;&#x65F6;&#x8868;&#x3002;&#x5982;&#x679C;&#x8868;&#x53D8;&#x91CF;&#x5305;&#x542B;&#x5927;&#x91CF;&#x6570;&#x636E;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#x7D22;&#x5F15;&#x975E;&#x5E38;&#x6709;&#x9650;(&#x53EA;&#x6709;&#x4E3B;&#x952E;&#x7D22;&#x5F15;)&#x3002;</li>
<li>&#x907F;&#x514D;&#x9891;&#x7E41;&#x521B;&#x5EFA;&#x548C;&#x5220;&#x9664;&#x4E34;&#x65F6;&#x8868;&#xFF0C;&#x4EE5;&#x51CF;&#x5C11;&#x7CFB;&#x7EDF;&#x8868;&#x8D44;&#x6E90;&#x7684;&#x6D88;&#x8017;&#x3002;</li>
<li>&#x4E34;&#x65F6;&#x8868;&#x5E76;&#x4E0D;&#x662F;&#x4E0D;&#x53EF;&#x4F7F;&#x7528;&#xFF0C;&#x9002;&#x5F53;&#x5730;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x67D0;&#x4E9B;&#x4F8B;&#x7A0B;&#x66F4;&#x6709;&#x6548;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x9700;&#x8981;&#x91CD;&#x590D;&#x5F15;&#x7528;&#x5927;&#x578B;&#x8868;&#x6216;&#x5E38;&#x7528;&#x8868;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x65F6;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x6B21;&#x6027;&#x4E8B;&#x4EF6;&#xFF0C;&#x6700;&#x597D;&#x4F7F;&#x7528;&#x5BFC;&#x51FA;&#x8868;&#x3002;</li>
<li>&#x5728;&#x65B0;&#x5EFA;&#x4E34;&#x65F6;&#x8868;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x6B21;&#x6027;&#x63D2;&#x5165;&#x6570;&#x636E;&#x91CF;&#x5F88;&#x5927;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; select into &#x4EE3;&#x66FF; create table&#xFF0C;&#x907F;&#x514D;&#x9020;&#x6210;&#x5927;&#x91CF; log &#xFF0C;&#x4EE5;&#x63D0;&#x9AD8;&#x901F;&#x5EA6;;&#x5982;&#x679C;&#x6570;&#x636E;&#x91CF;&#x4E0D;&#x5927;&#xFF0C;&#x4E3A;&#x4E86;&#x7F13;&#x548C;&#x7CFB;&#x7EDF;&#x8868;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5E94;&#x5148;create table&#xFF0C;&#x7136;&#x540E;insert&#x3002;</li>
<li>&#x5982;&#x679C;&#x4F7F;&#x7528;&#x5230;&#x4E86;&#x4E34;&#x65F6;&#x8868;&#xFF0C;&#x5728;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x7684;&#x6700;&#x540E;&#x52A1;&#x5FC5;&#x5C06;&#x6240;&#x6709;&#x7684;&#x4E34;&#x65F6;&#x8868;&#x663E;&#x5F0F;&#x5220;&#x9664;&#xFF0C;&#x5148; truncate table &#xFF0C;&#x7136;&#x540E; drop table &#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x7CFB;&#x7EDF;&#x8868;&#x7684;&#x8F83;&#x957F;&#x65F6;&#x95F4;&#x9501;&#x5B9A;&#x3002;</li>
<li>&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x6E38;&#x6807;&#xFF0C;&#x56E0;&#x4E3A;&#x6E38;&#x6807;&#x7684;&#x6548;&#x7387;&#x8F83;&#x5DEE;&#xFF0C;&#x5982;&#x679C;&#x6E38;&#x6807;&#x64CD;&#x4F5C;&#x7684;&#x6570;&#x636E;&#x8D85;&#x8FC7;1&#x4E07;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x6539;&#x5199;&#x3002;</li>
<li>&#x4F7F;&#x7528;&#x57FA;&#x4E8E;&#x6E38;&#x6807;&#x7684;&#x65B9;&#x6CD5;&#x6216;&#x4E34;&#x65F6;&#x8868;&#x65B9;&#x6CD5;&#x4E4B;&#x524D;&#xFF0C;&#x5E94;&#x5148;&#x5BFB;&#x627E;&#x57FA;&#x4E8E;&#x96C6;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x57FA;&#x4E8E;&#x96C6;&#x7684;&#x65B9;&#x6CD5;&#x901A;&#x5E38;&#x66F4;&#x6709;&#x6548;&#x3002;</li>
<li>&#x4E0E;&#x4E34;&#x65F6;&#x8868;&#x4E00;&#x6837;&#xFF0C;&#x6E38;&#x6807;&#x5E76;&#x4E0D;&#x662F;&#x4E0D;&#x53EF;&#x4F7F;&#x7528;&#x3002;&#x5BF9;&#x5C0F;&#x578B;&#x6570;&#x636E;&#x96C6;&#x4F7F;&#x7528; FAST_FORWARD &#x6E38;&#x6807;&#x901A;&#x5E38;&#x8981;&#x4F18;&#x4E8E;&#x5176;&#x4ED6;&#x9010;&#x884C;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x5FC5;&#x987B;&#x5F15;&#x7528;&#x51E0;&#x4E2A;&#x8868;&#x624D;&#x80FD;&#x83B7;&#x5F97;&#x6240;&#x9700;&#x7684;&#x6570;&#x636E;&#x65F6;&#x3002;&#x5728;&#x7ED3;&#x679C;&#x96C6;&#x4E2D;&#x5305;&#x62EC;&#x201C;&#x5408;&#x8BA1;&#x201D;&#x7684;&#x4F8B;&#x7A0B;&#x901A;&#x5E38;&#x8981;&#x6BD4;&#x4F7F;&#x7528;&#x6E38;&#x6807;&#x6267;&#x884C;&#x7684;&#x901F;&#x5EA6;&#x5FEB;&#x3002;&#x5982;&#x679C;&#x5F00;&#x53D1;&#x65F6; &#x95F4;&#x5141;&#x8BB8;&#xFF0C;&#x57FA;&#x4E8E;&#x6E38;&#x6807;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x57FA;&#x4E8E;&#x96C6;&#x7684;&#x65B9;&#x6CD5;&#x90FD;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#xFF0C;&#x770B;&#x54EA;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x6548;&#x679C;&#x66F4;&#x597D;&#x3002;</li>
<li>&#x5728;&#x6240;&#x6709;&#x7684;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x548C;&#x89E6;&#x53D1;&#x5668;&#x7684;&#x5F00;&#x59CB;&#x5904;&#x8BBE;&#x7F6E; SET NOCOUNT ON &#xFF0C;&#x5728;&#x7ED3;&#x675F;&#x65F6;&#x8BBE;&#x7F6E; SET NOCOUNT OFF &#x3002;&#x65E0;&#x9700;&#x5728;&#x6267;&#x884C;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x548C;&#x89E6;&#x53D1;&#x5668;&#x7684;&#x6BCF;&#x4E2A;&#x8BED;&#x53E5;&#x540E;&#x5411;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001; DONE_IN_PROC &#x6D88;&#x606F;&#x3002;</li>
<li>&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5411;&#x5BA2;&#x6237;&#x7AEF;&#x8FD4;&#x56DE;&#x5927;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x82E5;&#x6570;&#x636E;&#x91CF;&#x8FC7;&#x5927;&#xFF0C;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x76F8;&#x5E94;&#x9700;&#x6C42;&#x662F;&#x5426;&#x5408;&#x7406;&#x3002;</li>
<li>&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5927;&#x4E8B;&#x52A1;&#x64CD;&#x4F5C;&#xFF0C;&#x63D0;&#x9AD8;&#x7CFB;&#x7EDF;&#x5E76;&#x53D1;&#x80FD;&#x529B;&#x3002;</li>
</ol>
]]></content>
    
    <summary type="html">
    
      mysql查询语句优化方法
    
    </summary>
    
      <category term="mysql" scheme="http://code.idea4j.com/categories/mysql/"/>
    
    
      <category term="mysql" scheme="http://code.idea4j.com/tags/mysql/"/>
    
  </entry>
  
  <entry>
    <title>美国历任总统，在任年限及所属党派</title>
    <link href="http://code.idea4j.com/2016/11/09/usapresident/"/>
    <id>http://code.idea4j.com/2016/11/09/usapresident/</id>
    <published>2016-11-09T03:20:52.000Z</published>
    <updated>2016-11-09T03:42:08.403Z</updated>
    
    <content type="html"><![CDATA[<table>
<thead>
<tr>
<th style="text-align:center">&#x4EFB;&#x6570;</th>
<th style="text-align:left">&#x59D3;&#x540D;</th>
<th style="text-align:left">&#x5728;&#x4EFB;&#x5E74;&#x9650;</th>
<th style="text-align:left">&#x515A;&#x6D3E;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">1</td>
<td style="text-align:left">&#x4E54;&#x6CBB;&#xB7;&#x534E;&#x76DB;&#x987F;&#xFF08;George Washington&#xFF09;</td>
<td style="text-align:left">1789-1797</td>
<td style="text-align:left">&#x65E0;&#x515A;&#x6D3E;</td>
</tr>
<tr>
<td style="text-align:center">2</td>
<td style="text-align:left">&#x7EA6;&#x7FF0;&#xB7;&#x4E9A;&#x5F53;&#x65AF;&#xFF08;John Adams&#xFF09;</td>
<td style="text-align:left">1797-1801</td>
<td style="text-align:left">&#x8054;&#x90A6;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">3</td>
<td style="text-align:left">&#x6258;&#x9A6C;&#x65AF;&#xB7;&#x6770;&#x6590;&#x900A;&#xFF08;Thomas Jefferson&#xFF09;</td>
<td style="text-align:left">1801-1809</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">4</td>
<td style="text-align:left">&#x8A79;&#x59C6;&#x65AF;&#xB7;&#x9EA6;&#x8FEA;&#x900A;&#xFF08;James Madison&#xFF09;</td>
<td style="text-align:left">1809-1817</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">5</td>
<td style="text-align:left">&#x8A79;&#x59C6;&#x65AF;&#xB7;&#x95E8;&#x7F57;&#xFF08;James Monroe&#xFF09;</td>
<td style="text-align:left">1817-1825</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">6</td>
<td style="text-align:left">&#x7EA6;&#x7FF0;&#xB7;&#x6606;&#x897F;&#xB7;&#x4E9A;&#x5F53;&#x65AF;&#xFF08;John Quincy Adams&#xFF09;</td>
<td style="text-align:left">1825-1829</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">7</td>
<td style="text-align:left">&#x5B89;&#x5FB7;&#x9C81;&#xB7;&#x6770;&#x514B;&#x900A;&#xFF08;Andrew Jackson&#xFF09;</td>
<td style="text-align:left">1829-1837</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">8</td>
<td style="text-align:left">&#x9A6C;&#x4E01;&#xB7;&#x8303;&#x5E03;&#x4F26;&#xFF08;Martin van Buren&#xFF09;</td>
<td style="text-align:left">1837-1841</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">9</td>
<td style="text-align:left">&#x5A01;&#x5EC9;&#xB7;&#x4EA8;&#x5229;&#xB7;&#x54C8;&#x91CC;&#x68EE;&#xFF08;William Henry Harrison&#xFF09;</td>
<td style="text-align:left">1841</td>
<td style="text-align:left">&#x8F89;&#x683C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">10</td>
<td style="text-align:left">&#x7EA6;&#x7FF0;&#xB7;&#x6CF0;&#x52D2;&#xFF08;John Tyler&#xFF09;</td>
<td style="text-align:left">1841-1845</td>
<td style="text-align:left">&#x672C;&#x4E3A;&#x8F89;&#x683C;&#x515A;&#xFF0C;&#x540E;&#x65E0;&#x515A;&#x6D3E;</td>
</tr>
<tr>
<td style="text-align:center">11</td>
<td style="text-align:left">&#x8A79;&#x59C6;&#x65AF;&#xB7;&#x8BFA;&#x514B;&#x65AF;&#xB7;&#x6CE2;&#x5C14;&#x514B;&#xFF08;James Knox Polk&#xFF09;</td>
<td style="text-align:left">1845-1849</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">12</td>
<td style="text-align:left">&#x624E;&#x5361;&#x91CC;&#xB7;&#x6CF0;&#x52D2;&#xFF08;Zachary Taylor&#xFF09;</td>
<td style="text-align:left">1849-1850</td>
<td style="text-align:left">&#x8F89;&#x683C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">13</td>
<td style="text-align:left">&#x7C73;&#x52D2;&#x5FB7;&#xB7;&#x83F2;&#x5C14;&#x83AB;&#x5C14;&#xFF08;Millard Fillmore&#xFF09;</td>
<td style="text-align:left">1850-1853</td>
<td style="text-align:left">&#x8F89;&#x683C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">14</td>
<td style="text-align:left">&#x798F;&#x5170;&#x514B;&#x6797;&#xB7;&#x76AE;&#x5C14;&#x65AF;&#xFF08;Franklin Pierce&#xFF09;</td>
<td style="text-align:left">1853-1857</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">15</td>
<td style="text-align:left">&#x8A79;&#x59C6;&#x65AF;&#xB7;&#x5E03;&#x574E;&#x5357; &#xFF08;James Buchanan&#xFF09;</td>
<td style="text-align:left">1857-1861</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">16</td>
<td style="text-align:left">&#x4E9A;&#x4F2F;&#x62C9;&#x7F55;&#xB7;&#x6797;&#x80AF;&#xFF08;Abraham Lincoln&#xFF09;</td>
<td style="text-align:left">1861-1865</td>
<td style="text-align:left">&#x5171;&#x548C;&#x515A;&#xFF0C;&#x56FD;&#x5BB6;&#x7EDF;&#x4E00;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">17</td>
<td style="text-align:left">&#x5B89;&#x5FB7;&#x9C81;&#xB7;&#x7EA6;&#x7FF0;&#x900A;&#xFF08;Andrew Johnson&#xFF09;</td>
<td style="text-align:left">1865-1869</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x515A;&#xFF0C;&#x56FD;&#x5BB6;&#x7EDF;&#x4E00;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">18</td>
<td style="text-align:left">&#x5C24;&#x91CC;&#x897F;&#x65AF;&#xB7;&#x683C;&#x5170;&#x7279;&#xFF08;Ulysses S.Grant&#xFF09;</td>
<td style="text-align:left">1869-1877</td>
<td style="text-align:left">&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">19</td>
<td style="text-align:left">&#x62C9;&#x745F;&#x798F;&#x5FB7;&#xB7;&#x4F2F;&#x67E5;&#x5FB7;&#xB7;&#x6D77;&#x65AF;&#xFF08;Rutherford Birchard Hayes&#xFF09;</td>
<td style="text-align:left">1877-1881</td>
<td style="text-align:left">&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">20</td>
<td style="text-align:left">&#x8A79;&#x59C6;&#x65AF;&#xB7;&#x963F;&#x5E03;&#x62C9;&#x59C6;&#xB7;&#x52A0;&#x83F2;&#x5C14;&#x5FB7;&#xFF08;James Abram Garfield&#xFF09;</td>
<td style="text-align:left">1881</td>
<td style="text-align:left">&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">21</td>
<td style="text-align:left">&#x5207;&#x65AF;&#x7279;&#xB7;&#x827E;&#x4F26;&#xB7;&#x963F;&#x745F;&#xFF08;Chester Alan Arthur&#xFF09;</td>
<td style="text-align:left">1881-1885</td>
<td style="text-align:left">&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">22</td>
<td style="text-align:left">&#x53F2;&#x8482;&#x82AC;&#xB7;&#x683C;&#x7F57;&#x4F5B;&#xB7;&#x514B;&#x5229;&#x592B;&#x5170;&#xFF08;Stephen Grover Cleveland&#xFF09;</td>
<td style="text-align:left">1885-1889</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">23</td>
<td style="text-align:left">&#x672C;&#x6770;&#x660E;&#xB7;&#x54C8;&#x91CC;&#x68EE; &#xFF08;Benjamin Harrison&#xFF09;</td>
<td style="text-align:left">1889-1893</td>
<td style="text-align:left">&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">24</td>
<td style="text-align:left">&#x53F2;&#x8482;&#x82AC;&#xB7;&#x683C;&#x7F57;&#x4F5B;&#xB7;&#x514B;&#x5229;&#x592B;&#x5170;&#xFF08;Stephen Grover Cleveland &#xFF09;</td>
<td style="text-align:left">1893-1897</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">25</td>
<td style="text-align:left">&#x5A01;&#x5EC9;&#xB7;&#x9EA6;&#x91D1;&#x5229;&#xFF08;William McKinley&#xFF09;</td>
<td style="text-align:left">1897-1901</td>
<td style="text-align:left">&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">26</td>
<td style="text-align:left">&#x897F;&#x5965;&#x591A;&#xB7;&#x7F57;&#x65AF;&#x798F; &#xFF08;Theodore Roosevelt&#xFF09;</td>
<td style="text-align:left">1901-1909</td>
<td style="text-align:left">&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">27</td>
<td style="text-align:left">&#x5A01;&#x5EC9;&#xB7;&#x970D;&#x534E;&#x5FB7;&#xB7;&#x5854;&#x592B;&#x8131;&#xFF08;William Howard Taft&#xFF09;</td>
<td style="text-align:left">1909-1913</td>
<td style="text-align:left">&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">28</td>
<td style="text-align:left">&#x6258;&#x9A6C;&#x65AF;&#xB7;&#x4F0D;&#x5FB7;&#x7F57;&#xB7;&#x5A01;&#x5C14;&#x900A;&#xFF08;Thomas Woodrow Wilson&#xFF09;</td>
<td style="text-align:left">1913-1921</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">29</td>
<td style="text-align:left">&#x6C83;&#x4F26;&#xB7;&#x7518;&#x6885;&#x5229;&#x5C14;&#xB7;&#x54C8;&#x5B9A;&#xFF08;Warren Gamaliel Harding&#xFF09;</td>
<td style="text-align:left">1921-1923</td>
<td style="text-align:left">&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">30</td>
<td style="text-align:left">&#x7EA6;&#x7FF0;&#xB7;&#x5361;&#x5C14;&#x6587;&#xB7;&#x67EF;&#x7ACB;&#x829D;&#xFF08;John Calvin Coolidge&#xFF09;</td>
<td style="text-align:left">1923-1929</td>
<td style="text-align:left">&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">31</td>
<td style="text-align:left">&#x8D6B;&#x4F2F;&#x7279;&#xB7;&#x514B;&#x62C9;&#x514B;&#xB7;&#x80E1;&#x4F5B;&#xFF08;Herbert Clark Hoover&#xFF09;</td>
<td style="text-align:left">1929-1933</td>
<td style="text-align:left">&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">32</td>
<td style="text-align:left">&#x5BCC;&#x5170;&#x514B;&#x6797;&#xB7;&#x5FB7;&#x62C9;&#x8BFA;&#xB7;&#x7F57;&#x65AF;&#x798F;&#xFF08;Franklin Delano Roosevelt&#xFF09;</td>
<td style="text-align:left">1933-1945</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">33</td>
<td style="text-align:left">&#x54C8;&#x91CC;&#xB7;S&#xB7;&#x675C;&#x9C81;&#x95E8;&#xFF08;Harry S. Truman&#xFF09;</td>
<td style="text-align:left">1945-1953</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">34</td>
<td style="text-align:left">&#x5FB7;&#x6000;&#x7279;&#xB7;&#x6234;&#x7EF4;&#xB7;&#x827E;&#x68EE;&#x8C6A;&#x5A01;&#x5C14;&#xFF08;Dwight David Eisenhower&#xFF09;</td>
<td style="text-align:left">1953-1961</td>
<td style="text-align:left">&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">35</td>
<td style="text-align:left">&#x7EA6;&#x7FF0;&#xB7;&#x83F2;&#x8328;&#x6770;&#x62C9;&#x5FB7;&#xB7;&#x80AF;&#x5C3C;&#x8FEA;&#xFF08;John Fitzgerald Kennedy&#xFF09;</td>
<td style="text-align:left">1961-1963</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">36</td>
<td style="text-align:left">&#x6797;&#x767B;&#xB7;&#x62DC;&#x6069;&#x65AF;&#xB7;&#x7EA6;&#x7FF0;&#x900A;&#xFF08;Lyndon Baines Johnson&#xFF09;</td>
<td style="text-align:left">1963-1969</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">37</td>
<td style="text-align:left">&#x7406;&#x67E5;&#x5FB7;&#xB7;&#x7C73;&#x5C14;&#x8C6A;&#x65AF;&#xB7;&#x5C3C;&#x514B;&#x677E;&#xFF08;Richard Milhous Nixon&#xFF09;</td>
<td style="text-align:left">1969-1974</td>
<td style="text-align:left">&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">38</td>
<td style="text-align:left">&#x6770;&#x62C9;&#x5C14;&#x5FB7;&#xB7;&#x9C81;&#x9053;&#x592B;&#xB7;&#x798F;&#x7279;&#xFF08;Gerald Rudolph Ford&#xFF09;</td>
<td style="text-align:left">1974-1977</td>
<td style="text-align:left">&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">39</td>
<td style="text-align:left">&#x8A79;&#x59C6;&#x65AF;&#xB7;&#x5384;&#x5C14;&#xB7;&#xB7;&#x5361;&#x7279;&#xFF08;James Earl Carter &#xFF09;</td>
<td style="text-align:left">1977-1981</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">40</td>
<td style="text-align:left">&#x7F57;&#x7EB3;&#x5FB7;&#xB7;&#x5A01;&#x5C14;&#x900A;&#xB7;&#x91CC;&#x6839;&#xFF08;Ronald Wilson Reagan&#xFF09;</td>
<td style="text-align:left">1981-1989</td>
<td style="text-align:left">&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">41</td>
<td style="text-align:left">&#x4E54;&#x6CBB;&#xB7;&#x8D6B;&#x4F2F;&#x7279;&#xB7;&#x6C83;&#x514B;&#xB7;&#x5E03;&#x4EC0;&#xFF08;George Herbert Walker Bush&#xFF09;</td>
<td style="text-align:left">1989-1993</td>
<td style="text-align:left">&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">42</td>
<td style="text-align:left">&#x5A01;&#x5EC9;&#xB7;&#x6770;&#x6590;&#x900A;&#xB7;&#x514B;&#x6797;&#x987F;&#xFF08;William Jefferson Clinton&#xFF09;</td>
<td style="text-align:left">1993-2001</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">43</td>
<td style="text-align:left">&#x4E54;&#x6CBB;&#xB7;&#x6C83;&#x514B;&#xB7;&#x5E03;&#x4EC0;&#xFF08;George Walker Bush&#xFF09;</td>
<td style="text-align:left">2001-2009</td>
<td style="text-align:left">&#x5171;&#x548C;&#x515A;</td>
</tr>
<tr>
<td style="text-align:center">44</td>
<td style="text-align:left">&#x8D1D;&#x62C9;&#x514B;&#xB7;&#x4FAF;&#x8D5B;&#x56E0;&#xB7;&#x5965;&#x5DF4;&#x9A6C;&#xFF08;Barack Hussein Obama&#xFF09;</td>
<td style="text-align:left">2009-2017</td>
<td style="text-align:left">&#x6C11;&#x4E3B;&#x515A;</td>
</tr>
</tbody>
</table>
]]></content>
    
    <summary type="html">
    
      美国历任总统，在任年限及所属党派
    
    </summary>
    
      <category term="其他" scheme="http://code.idea4j.com/categories/%E5%85%B6%E4%BB%96/"/>
    
    
      <category term="其他" scheme="http://code.idea4j.com/tags/%E5%85%B6%E4%BB%96/"/>
    
  </entry>
  
  <entry>
    <title>改善性能的几个技巧</title>
    <link href="http://code.idea4j.com/2016/11/04/xingnen2/"/>
    <id>http://code.idea4j.com/2016/11/04/xingnen2/</id>
    <published>2016-11-04T07:46:16.000Z</published>
    <updated>2016-11-09T03:30:19.733Z</updated>
    
    <content type="html"><![CDATA[<h3 id="&#x614E;&#x7528;&#x5F02;&#x5E38;"><a href="#&#x614E;&#x7528;&#x5F02;&#x5E38;" class="headerlink" title="&#x614E;&#x7528;&#x5F02;&#x5E38;"></a>&#x614E;&#x7528;&#x5F02;&#x5E38;</h3><h3 id="&#x4F7F;&#x7528;&#x5C40;&#x90E8;&#x53D8;&#x91CF;"><a href="#&#x4F7F;&#x7528;&#x5C40;&#x90E8;&#x53D8;&#x91CF;" class="headerlink" title="&#x4F7F;&#x7528;&#x5C40;&#x90E8;&#x53D8;&#x91CF;"></a>&#x4F7F;&#x7528;&#x5C40;&#x90E8;&#x53D8;&#x91CF;</h3><h3 id="&#x4F4D;&#x8FD0;&#x7B97;&#x4EE3;&#x66FF;&#x4E58;&#x9664;&#x6CD5;"><a href="#&#x4F4D;&#x8FD0;&#x7B97;&#x4EE3;&#x66FF;&#x4E58;&#x9664;&#x6CD5;" class="headerlink" title="&#x4F4D;&#x8FD0;&#x7B97;&#x4EE3;&#x66FF;&#x4E58;&#x9664;&#x6CD5;"></a>&#x4F4D;&#x8FD0;&#x7B97;&#x4EE3;&#x66FF;&#x4E58;&#x9664;&#x6CD5;</h3><h3 id="&#x66FF;&#x6362;switch"><a href="#&#x66FF;&#x6362;switch" class="headerlink" title="&#x66FF;&#x6362;switch"></a>&#x66FF;&#x6362;switch</h3><h3 id="&#x4E00;&#x7EF4;&#x6570;&#x7EC4;&#x4EE3;&#x66FF;&#x4E8C;&#x7EF4;&#x6570;&#x7EC4;"><a href="#&#x4E00;&#x7EF4;&#x6570;&#x7EC4;&#x4EE3;&#x66FF;&#x4E8C;&#x7EF4;&#x6570;&#x7EC4;" class="headerlink" title="&#x4E00;&#x7EF4;&#x6570;&#x7EC4;&#x4EE3;&#x66FF;&#x4E8C;&#x7EF4;&#x6570;&#x7EC4;"></a>&#x4E00;&#x7EF4;&#x6570;&#x7EC4;&#x4EE3;&#x66FF;&#x4E8C;&#x7EF4;&#x6570;&#x7EC4;</h3><h3 id="&#x63D0;&#x53D6;&#x8868;&#x8FBE;&#x5F0F;"><a href="#&#x63D0;&#x53D6;&#x8868;&#x8FBE;&#x5F0F;" class="headerlink" title="&#x63D0;&#x53D6;&#x8868;&#x8FBE;&#x5F0F;"></a>&#x63D0;&#x53D6;&#x8868;&#x8FBE;&#x5F0F;</h3><h3 id="&#x5C55;&#x5F00;&#x5FAA;&#x73AF;"><a href="#&#x5C55;&#x5F00;&#x5FAA;&#x73AF;" class="headerlink" title="&#x5C55;&#x5F00;&#x5FAA;&#x73AF;"></a>&#x5C55;&#x5F00;&#x5FAA;&#x73AF;</h3><h3 id="&#x5E03;&#x5C14;&#x8FD0;&#x7B97;&#x4EE3;&#x66FF;&#x4F4D;&#x8FD0;&#x7B97;"><a href="#&#x5E03;&#x5C14;&#x8FD0;&#x7B97;&#x4EE3;&#x66FF;&#x4F4D;&#x8FD0;&#x7B97;" class="headerlink" title="&#x5E03;&#x5C14;&#x8FD0;&#x7B97;&#x4EE3;&#x66FF;&#x4F4D;&#x8FD0;&#x7B97;"></a>&#x5E03;&#x5C14;&#x8FD0;&#x7B97;&#x4EE3;&#x66FF;&#x4F4D;&#x8FD0;&#x7B97;</h3><h3 id="&#x4F7F;&#x7528;arrayCopy"><a href="#&#x4F7F;&#x7528;arrayCopy" class="headerlink" title="&#x4F7F;&#x7528;arrayCopy"></a>&#x4F7F;&#x7528;arrayCopy</h3><h3 id="&#x4F7F;&#x7528;Buffer&#x8FDB;&#x884C;I-O&#x64CD;&#x4F5C;"><a href="#&#x4F7F;&#x7528;Buffer&#x8FDB;&#x884C;I-O&#x64CD;&#x4F5C;" class="headerlink" title="&#x4F7F;&#x7528;Buffer&#x8FDB;&#x884C;I/O&#x64CD;&#x4F5C;"></a>&#x4F7F;&#x7528;Buffer&#x8FDB;&#x884C;I/O&#x64CD;&#x4F5C;</h3><h3 id="&#x4F7F;&#x7528;clone&#x4EE3;&#x66FF;new"><a href="#&#x4F7F;&#x7528;clone&#x4EE3;&#x66FF;new" class="headerlink" title="&#x4F7F;&#x7528;clone&#x4EE3;&#x66FF;new"></a>&#x4F7F;&#x7528;clone&#x4EE3;&#x66FF;new</h3><h3 id="&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x4EE3;&#x66FF;&#x5B9E;&#x4F8B;&#x65B9;&#x6CD5;"><a href="#&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x4EE3;&#x66FF;&#x5B9E;&#x4F8B;&#x65B9;&#x6CD5;" class="headerlink" title="&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x4EE3;&#x66FF;&#x5B9E;&#x4F8B;&#x65B9;&#x6CD5;"></a>&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x4EE3;&#x66FF;&#x5B9E;&#x4F8B;&#x65B9;&#x6CD5;</h3>]]></content>
    
    <summary type="html">
    
      略
    
    </summary>
    
      <category term="java" scheme="http://code.idea4j.com/categories/java/"/>
    
    
      <category term="java" scheme="http://code.idea4j.com/tags/java/"/>
    
  </entry>
  
  <entry>
    <title>性能概述</title>
    <link href="http://code.idea4j.com/2016/11/03/xingnen/"/>
    <id>http://code.idea4j.com/2016/11/03/xingnen/</id>
    <published>2016-11-03T04:11:59.000Z</published>
    <updated>2016-11-03T08:21:02.304Z</updated>
    
    <content type="html"><![CDATA[<p>&#x7A0B;&#x5E8F;&#x7684;&#x6027;&#x80FD;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#x6765;&#x8868;&#x73B0;&#xFF1A;</p>
<ul>
<li>&#x6267;&#x884C;&#x901F;&#x5EA6;&#xFF1A;</li>
<li>&#x5185;&#x5B58;&#x5206;&#x914D;&#xFF1A;</li>
<li>&#x542F;&#x52A8;&#x65F6;&#x95F4;&#xFF1A;</li>
<li>&#x8D1F;&#x8F7D;&#x627F;&#x53D7;&#x80FD;&#x529B;&#xFF1A;</li>
</ul>
<p>&#x6027;&#x80FD;&#x8C03;&#x4F18;&#x7684;&#x5C42;&#x6B21;</p>
<ul>
<li>&#x8BBE;&#x8BA1;&#x8C03;&#x4F18;</li>
<li>&#x4EE3;&#x7801;&#x8C03;&#x4F18;</li>
<li>JVM&#x8C03;&#x4F18;</li>
<li>&#x6570;&#x636E;&#x5E93;&#x8C03;&#x4F18;</li>
<li>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8C03;&#x4F18;</li>
</ul>
]]></content>
    
    <summary type="html">
    
      &lt;p&gt;&amp;#x7A0B;&amp;#x5E8F;&amp;#x7684;&amp;#x6027;&amp;#x80FD;&amp;#x901A;&amp;#x8FC7;&amp;#x4EE5;&amp;#x4E0B;&amp;#x51E0;&amp;#x4E2A;&amp;#x65B9;&amp;#x9762;&amp;#x6765;&amp;#x8868;&amp;#x73B0;&amp;#xFF1A;&lt;
    
    </summary>
    
      <category term="java" scheme="http://code.idea4j.com/categories/java/"/>
    
    
      <category term="java" scheme="http://code.idea4j.com/tags/java/"/>
    
  </entry>
  
  <entry>
    <title>一行配置文件引发的“血案”</title>
    <link href="http://code.idea4j.com/2016/11/02/servlet3/"/>
    <id>http://code.idea4j.com/2016/11/02/servlet3/</id>
    <published>2016-11-02T09:14:32.000Z</published>
    <updated>2016-11-02T10:00:14.304Z</updated>
    
    <content type="html"><![CDATA[<p>&#x6709;&#x70B9;&#x7A7A;&#x95F2;&#x770B;&#x4E86;&#x770B;servlet3.0&#x89C4;&#x8303;&#xFF0C;&#x5C31;&#x60F3;&#x7740;&#x8981;&#x4E0D;&#x6765;&#x4E2A;&#x201C;hello world&#x201D;&#x73A9;&#x73A9;&#x3002;<br>&#x9A6C;&#x4E0A;&#x5F00;&#x5E72;&#xFF0C;&#x9996;&#x5148;maven&#x751F;&#x6210;&#x5DE5;&#x7A0B;&#x7684;&#x6587;&#x4EF6;&#x7ED3;&#x6784;&#x3002;&#x7136;&#x540E;&#x627E;&#x4E2A;3.0&#x7684;web.xml&#xFF0C;&#x8BB0;&#x5F97;tomcat7&#x4E0B;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4E8E;&#x662F;&#x627E;&#x5230;tomcat7&#x4E0B;&#x7684;manager&#x590D;&#x5236;<br>&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x53BB;&#x6389;&#x4E2D;&#x95F4;&#x90E8;&#x5206;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#xFF1A;<br><figure class="highlight xml"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div></pre></td><td class="code"><pre><div class="line">&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;</div><div class="line"><span class="tag">&lt;<span class="name">web-app</span> <span class="attr">xmlns</span>=<span class="string">&quot;http://java.sun.com/xml/ns/javaee&quot;</span></span></div><div class="line">         <span class="attr">xmlns:xsi</span>=<span class="string">&quot;http://www.w3.org/2001/XMLSchema-instance&quot;</span></div><div class="line">         <span class="attr">xsi:schemaLocation</span>=<span class="string">&quot;http://java.sun.com/xml/ns/javaee</span></div><div class="line">                      http://java.sun.com/xml/ns/javaee/web-app_3_0.xsd&quot;</div><div class="line">         <span class="attr">version</span>=<span class="string">&quot;3.0&quot;</span></div><div class="line">         <span class="attr">metadata-complete</span>=<span class="string">&quot;true&quot;</span>&gt;</div><div class="line">    <span class="tag">&lt;<span class="name">display-name</span>&gt;</span>idea4j<span class="tag">&lt;/<span class="name">display-name</span>&gt;</span></div><div class="line">    <span class="tag">&lt;<span class="name">description</span>&gt;</span><span class="tag">&lt;/<span class="name">description</span>&gt;</span></div><div class="line"><span class="tag">&lt;/<span class="name">web-app</span>&gt;</span></div></pre></td></tr></table></figure></p>
<p>new &#x4E00;&#x4E2A;servlet&#xFF0C;&#x4EE3;&#x7801;&#x81EA;&#x52A8;&#x52A0;&#x5165;&#x4E86;doGet&#xFF0C;doPost&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x4E14;&#x667A;&#x80FD;&#x7684;&#x52A0;&#x4E0A;&#x4E86;@WebServlet&#x6CE8;&#x89E3;(&#x7A83;&#x559C;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x4E0D;&#x8981;&#x5728;web.xml&#x6DFB;&#x52A0;<br>servlet&#x7684;&#x914D;&#x7F6E;&#x4E86;)&#xFF0C;&#x518D;&#x6DFB;&#x52A0;&#x4EE3;&#x7801;&#x5982;&#x4E0B;:<br><figure class="highlight java"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div></pre></td><td class="code"><pre><div class="line"><span class="meta">@WebServlet</span>(<span class="string">&quot;/hello&quot;</span>)</div><div class="line"><span class="keyword">public</span> <span class="class"><span class="keyword">class</span> <span class="title">Servlet</span> <span class="keyword">extends</span> <span class="title">HttpServlet</span> </span>{</div><div class="line">    <span class="function"><span class="keyword">protected</span> <span class="keyword">void</span> <span class="title">doPost</span><span class="params">(HttpServletRequest request, HttpServletResponse response)</span> <span class="keyword">throws</span> ServletException, IOException </span>{</div><div class="line"></div><div class="line">    }</div><div class="line"></div><div class="line">    <span class="function"><span class="keyword">protected</span> <span class="keyword">void</span> <span class="title">doGet</span><span class="params">(HttpServletRequest request, HttpServletResponse response)</span> <span class="keyword">throws</span> ServletException, IOException </span>{</div><div class="line">        request.setAttribute(<span class="string">&quot;now&quot;</span>, <span class="keyword">new</span> SimpleDateFormat(<span class="string">&quot;yyyy-MM-dd HH:mm:ss&quot;</span>).format(<span class="keyword">new</span> Date()));</div><div class="line">        request.getRequestDispatcher(<span class="string">&quot;/WEB-INF/jsp/hello.jsp&quot;</span>).forward(request,response);</div><div class="line">    }</div><div class="line">}</div></pre></td></tr></table></figure></p>
<p>new hello.jsp</p>
<pre><code class="html"><span class="tag">&lt;<span class="name">%@</span> <span class="attr">page</span> <span class="attr">contentType</span>=<span class="string">&quot;text/html;charset=UTF-8&quot;</span> <span class="attr">language</span>=<span class="string">&quot;java&quot;</span> %&gt;</span>
<span class="tag">&lt;<span class="name">html</span>&gt;</span>
<span class="tag">&lt;<span class="name">head</span>&gt;</span>
    <span class="tag">&lt;<span class="name">title</span>&gt;</span>Title<span class="tag">&lt;/<span class="name">title</span>&gt;</span>
<span class="tag">&lt;/<span class="name">head</span>&gt;</span>
<span class="tag">&lt;<span class="name">body</span>&gt;</span>
<span class="tag">&lt;<span class="name">h1</span>&gt;</span>hello<span class="tag">&lt;/<span class="name">h1</span>&gt;</span>
<span class="tag">&lt;<span class="name">h2</span>&gt;</span>&#x5F53;&#x524D;&#x65F6;&#x95F4;&#xFF1A;${now}<span class="tag">&lt;/<span class="name">h2</span>&gt;</span>
<span class="tag">&lt;/<span class="name">body</span>&gt;</span>
<span class="tag">&lt;/<span class="name">html</span>&gt;</span>
</code></pre>
<p>&#x90E8;&#x7F72;&#x542F;&#x52A8;tomcat&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x8F93;&#x5165;localhost:8080/hello/ ,nonono&#xFF01;&#x4E0D;&#x662F;&#x6211;&#x5E0C;&#x671B;&#x7684;&#x9875;&#x9762;&#x554A;&#xFF0C;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#xFF1F;&#x7ADF;&#x7136;&#x662F;404&#xFF1F;<br>&#x4E0D;&#x662F;&#x5E94;&#x7528;&#x540D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x7F16;&#x8BD1;&#x76EE;&#x5F55;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x662F;maven&#x7684;tomcat&#x63D2;&#x4EF6;&#x95EE;&#x9898;&#x2026;<br>&#x989D;&#xFF0C;&#x6211;&#x60F3;&#x9759;&#x9759;&#xFF01;<br>&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;<br>&#x8FD8;&#x662F;&#x7ED9;&#x6211;&#x627E;&#x5230;&#x4E86;web.xml&#xFF0C;&#x6709;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;metadata-complete=&#x201D;true&#x201D;&#xFF0C;&#x8C8C;&#x4F3C;&#x6CA1;&#x600E;&#x4E48;&#x89C1;&#x8FC7;&#x554A;&#xFF0C;&#x6211;&#x53BB;&#x6389;&#x5B83;&#x8BD5;&#x8BD5;&#x5462;&#xFF1F;<br>&#x7EC8;&#x4E8E;&#x51FA;&#x73B0;&#x4E86;&#x6211;&#x8981;&#x7684;hello&#x9875;&#x9762;&#x3002;</p>
<p>&#x4E8E;&#x662F;&#xFF0C;&#x67E5;&#x5230;&#x4E86;&#x5982;&#x4E0B;&#x89E3;&#x91CA;&#xFF1A;<br>metadata-complete &#x5C5E;&#x6027;&#xFF0C;&#x8BE5;&#x5C5E;&#x6027;&#x6307;&#x5B9A;&#x5F53;&#x524D;&#x7684;&#x90E8;&#x7F72;&#x63CF;&#x8FF0;&#x6587;&#x4EF6;&#x662F;&#x5426;&#x662F;&#x5B8C;&#x5168;&#x7684;&#x3002;&#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x4E3A; true&#xFF0C;&#x5219;&#x5BB9;&#x5668;&#x5728;&#x90E8;&#x7F72;&#x65F6;&#x5C06;&#x53EA;&#x4F9D;&#x8D56;&#x90E8;&#x7F72;&#x63CF;&#x8FF0;&#x6587;&#x4EF6;&#xFF0C;<br><em>&#x5FFD;&#x7565;&#x6240;&#x6709;&#x7684;&#x6CE8;&#x89E3;</em>&#xFF08;&#x540C;&#x65F6;&#x4E5F;&#x4F1A;&#x8DF3;&#x8FC7; web-fragment.xml &#x7684;&#x626B;&#x63CF;&#xFF09;&#xFF1B;&#x5982;&#x679C;&#x4E0D;&#x914D;&#x7F6E;&#x8BE5;&#x5C5E;&#x6027;&#xFF0C;&#x6216;&#x8005;&#x5C06;&#x5176;&#x8BBE;&#x7F6E;&#x4E3A; false&#xFF0C;&#x5219;&#x8868;&#x793A;&#x542F;&#x7528;&#x6CE8;&#x89E3;&#x652F;&#x6301;&#x3002;</p>
<p>&#x5FFD;&#x7565;&#x6240;&#x6709;&#x6CE8;&#x89E3;&#xFF0C;&#x5FFD;&#x7565;&#x6240;&#x6709;&#x2026; </p>
<p>ok&#xFF0C;that&#x2019;s all</p>
]]></content>
    
    <summary type="html">
    
      servlet3.0 的metadata-complete 属性
    
    </summary>
    
      <category term="java" scheme="http://code.idea4j.com/categories/java/"/>
    
    
      <category term="java" scheme="http://code.idea4j.com/tags/java/"/>
    
      <category term="servlet" scheme="http://code.idea4j.com/tags/servlet/"/>
    
  </entry>
  
  <entry>
    <title>Class类文件的结构</title>
    <link href="http://code.idea4j.com/2016/10/27/btyeclass/"/>
    <id>http://code.idea4j.com/2016/10/27/btyeclass/</id>
    <published>2016-10-27T02:07:36.000Z</published>
    <updated>2016-10-27T09:34:16.248Z</updated>
    
    <content type="html"><![CDATA[<p>Class &#x6587;&#x4EF6;&#x662F;&#x4E00;&#x7EC4;&#x4EE5;8&#x4F4D;&#x5B57;&#x8282;&#x4E3A;&#x57FA;&#x7840;&#x5355;&#x4F4D;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6D41;&#xFF0C;&#x5404;&#x4E2A;&#x6570;&#x636E;&#x9879;&#x76EE;&#x4E25;&#x683C;&#x6309;&#x7167;&#x987A;&#x5E8F;&#x7D27;&#x51D1;&#x5730;&#x6392;&#x5217;&#x5728;Class&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x4E2D;&#x95F4;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5206;&#x9694;&#x7B26;&#xFF0C;&#x8FD9;<br>&#x4F7F;&#x5F97;&#x6574;&#x4E2A;Class&#x6587;&#x4EF6;&#x4E4B;&#x4E2D;&#x5B58;&#x50A8;&#x7684;&#x5185;&#x5BB9;&#x51E0;&#x4E4E;&#x5168;&#x90E8;&#x662F;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x7684;&#x5FC5;&#x8981;&#x6570;&#x636E;&#xFF0C;&#x6CA1;&#x6709;&#x7A7A;&#x9699;&#x5B58;&#x5728;&#x3002;&#x5F53;&#x9047;&#x5230;&#x9700;&#x8981;&#x5360;&#x7528;8&#x4F4D;&#x5B57;&#x8282;&#x4EE5;&#x4E0A;&#x7A7A;&#x95F4;&#x7684;&#x6570;&#x636E;&#x9879;&#x662F;&#xFF0C;&#x5219;&#x4F1A;<br>&#x6309;&#x7167;&#x9AD8;&#x4F4D;&#x5728;&#x524D;&#x7684;&#x65B9;&#x5F0F;&#x5206;&#x5272;&#x6210;&#x82E5;&#x5E72;&#x4E2A;8&#x4F4D;&#x5B57;&#x8282;&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#x3002;</p>
<p>Class&#x7ED3;&#x6784;&#x4E2D;&#x53EA;&#x6709;&#x4E24;&#x79CD;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF1A;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x548C;&#x8868;</p>
<h3 id="&#x65E0;&#x7B26;&#x53F7;&#x6570;"><a href="#&#x65E0;&#x7B26;&#x53F7;&#x6570;" class="headerlink" title="&#x65E0;&#x7B26;&#x53F7;&#x6570;"></a>&#x65E0;&#x7B26;&#x53F7;&#x6570;</h3><p>&#x5C5E;&#x4E8E;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x4EE5;u1&#x3001;u2&#x3001;u4&#x3001;u8&#x6765;&#x5206;&#x522B;&#x4EE3;&#x8868;1&#x4E2A;&#x5B57;&#x8282;&#x3001;2&#x4E2A;&#x5B57;&#x8282;&#x3001;4&#x4E2A;&#x5B57;&#x8282;&#x3001;8&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#xFF0C;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x63CF;&#x8FF0;&#x6570;&#x5B57;&#x3001;<br>&#x7D22;&#x5F15;&#x5F15;&#x7528;&#x3001;&#x6570;&#x91CF;&#x503C;&#x6216;&#x8005;&#x6309;&#x7167;&#x7F16;&#x7801;&#x6784;&#x6210;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<h3 id="&#x8868;"><a href="#&#x8868;" class="headerlink" title="&#x8868;"></a>&#x8868;</h3><p>&#x8868;&#x662F;&#x7531;&#x591A;&#x4E2A;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x8868;&#x4F5C;&#x4E3A;&#x6570;&#x636E;&#x9879;&#x6784;&#x6210;&#x7684;&#x590D;&#x5408;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x6240;&#x6709;&#x8868;&#x90FD;&#x4E60;&#x60EF;&#x6027;&#x5730;&#x4EE5;&#x201C;_info&#x201D; &#x7ED3;&#x5C3E;&#x3002;&#x8868;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;&#x6709;&#x5C42;&#x6B21;&#x5173;&#x7CFB;&#x7684;&#x590D;<br>&#x5408;&#x7ED3;&#x6784;&#x6570;&#x636E;&#xFF0C;&#x6574;&#x4E2A;Class&#x6587;&#x4EF6;&#x672C;&#x8D28;&#x4E0A;&#x5C31;&#x662F;&#x4E00;&#x5F20;&#x8868;,&#x7531;&#x4E0B;&#x5217;&#x6570;&#x636E;&#x9879;&#x6784;&#x6210;&#x3002;</p>
<table>
<thead>
<tr>
<th style="text-align:center">&#x7C7B;&#x578B;</th>
<th style="text-align:left">&#x540D;&#x79F0;</th>
<th style="text-align:left">&#x6570;&#x91CF;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">u4</td>
<td style="text-align:left">magic</td>
<td style="text-align:left">1</td>
</tr>
<tr>
<td style="text-align:center">u2</td>
<td style="text-align:left">minor_version</td>
<td style="text-align:left">1</td>
</tr>
<tr>
<td style="text-align:center">u2</td>
<td style="text-align:left">major_version</td>
<td style="text-align:left">1</td>
</tr>
<tr>
<td style="text-align:center">u2</td>
<td style="text-align:left">constant_pool_count</td>
<td style="text-align:left">1</td>
</tr>
<tr>
<td style="text-align:center">cp_info</td>
<td style="text-align:left">constant_pool</td>
<td style="text-align:left">constant_pool_count-1</td>
</tr>
<tr>
<td style="text-align:center">u2</td>
<td style="text-align:left">access_flags</td>
<td style="text-align:left">1</td>
</tr>
<tr>
<td style="text-align:center">u2</td>
<td style="text-align:left">this_class</td>
<td style="text-align:left">1</td>
</tr>
<tr>
<td style="text-align:center">u2</td>
<td style="text-align:left">super_class</td>
<td style="text-align:left">1</td>
</tr>
<tr>
<td style="text-align:center">u2</td>
<td style="text-align:left">interfaces_count</td>
<td style="text-align:left">1</td>
</tr>
<tr>
<td style="text-align:center">u2</td>
<td style="text-align:left">interface</td>
<td style="text-align:left">interfaces_count</td>
</tr>
<tr>
<td style="text-align:center">u2</td>
<td style="text-align:left">fields_count</td>
<td style="text-align:left">1</td>
</tr>
<tr>
<td style="text-align:center">field_info</td>
<td style="text-align:left">fields</td>
<td style="text-align:left">fields_count</td>
</tr>
<tr>
<td style="text-align:center">u2</td>
<td style="text-align:left">methods_count</td>
<td style="text-align:left">1</td>
</tr>
<tr>
<td style="text-align:center">method_info</td>
<td style="text-align:left">methods</td>
<td style="text-align:left">methods_count</td>
</tr>
<tr>
<td style="text-align:center">u2</td>
<td style="text-align:left">attributes_count</td>
<td style="text-align:left">1</td>
</tr>
<tr>
<td style="text-align:center">attribute_info</td>
<td style="text-align:left">attributes</td>
<td style="text-align:left">attributes_count</td>
</tr>
</tbody>
</table>
<h3 id="&#x9B54;&#x6570;"><a href="#&#x9B54;&#x6570;" class="headerlink" title="&#x9B54;&#x6570;"></a>&#x9B54;&#x6570;</h3><p>&#x6BCF;&#x4E2A;Class&#x6587;&#x4EF6;&#x7684;&#x5934;4&#x4E2A;&#x5B57;&#x8282;&#x79F0;&#x4E3A;&#x9B54;&#x6570;&#xFF08;Magic Number&#xFF09;&#xFF0C;&#x5B83;&#x7684;&#x552F;&#x4E00;&#x4F5C;&#x7528;&#x662F;&#x786E;&#x5B9A;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x662F;&#x5426;&#x662F;&#x4E00;&#x4E2A;&#x80FD;&#x88AB;&#x865A;&#x62DF;&#x673A;&#x63A5;&#x53D7;&#x7684;Class<br>&#x6587;&#x4EF6;&#x3002;Class&#x6587;&#x4EF6;&#x7684;&#x9B54;&#x6570;&#x503C;&#x4E3A;&#xFF1A;0xCAFEBABE&#xFF08;&#x5496;&#x5561;&#x5B9D;&#x8D1D;&#xFF09;&#x3002;<br>&#x7D27;&#x63A5;&#x7740;&#x9B54;&#x6570;&#x7684;4&#x4E2A;&#x5B57;&#x8282;&#x5B58;&#x50A8;&#x7684;&#x662F;Class&#x6587;&#x4EF6;&#x7684;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#xFF1A;&#x7B2C;5&#x548C;&#x7B2C;6&#x4E2A;&#x5B57;&#x8282;&#x662F;&#x6B21;&#x7248;&#x672C;&#x53F7;&#xFF08;Minor Version&#xFF09;&#xFF0C;&#x7B2C;7&#x548C;&#x7B2C;8&#x4E2A;&#x5B57;&#x8282;&#x662F;<br>&#x4E3B;&#x7248;&#x672C;&#x53F7;&#xFF08;Majer Version&#xFF09;&#x3002;</p>
<p>Class &#x6587;&#x4EF6;&#x7248;&#x672C;&#x53F7;</p>
<table>
<thead>
<tr>
<th style="text-align:center">&#x7F16;&#x8BD1;&#x5668;&#x7248;&#x672C;</th>
<th style="text-align:left">-target&#x53C2;&#x6570;</th>
<th style="text-align:center">&#x5341;&#x516D;&#x8FDB;&#x5236;&#x7248;&#x672C;&#x53F7;</th>
<th style="text-align:center">&#x5341;&#x8FDB;&#x5236;&#x7248;&#x672C;&#x53F7;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">JDK1.1.8</td>
<td style="text-align:left">&#x4E0D;&#x5E26;target&#x53C2;&#x6570;</td>
<td style="text-align:center">00 03 00 2D</td>
<td style="text-align:center">45.3</td>
</tr>
<tr>
<td style="text-align:center">JDK1.2.2</td>
<td style="text-align:left">&#x4E0D;&#x5E26;&#xFF08;&#x9ED8;&#x8BA4;&#x4E3A;-target1.1&#xFF09;</td>
<td style="text-align:center">00 03 00 2D</td>
<td style="text-align:center">45.3</td>
</tr>
<tr>
<td style="text-align:center">JDK1.2.2</td>
<td style="text-align:left">-target1.2</td>
<td style="text-align:center">00 00 00 2E</td>
<td style="text-align:center">46.0</td>
</tr>
<tr>
<td style="text-align:center">JDK1.3.1_19</td>
<td style="text-align:left">&#x4E0D;&#x5E26;&#xFF08;&#x9ED8;&#x8BA4;&#x4E3A;-target1.1&#xFF09;</td>
<td style="text-align:center">00 03 00 2D</td>
<td style="text-align:center">45.3</td>
</tr>
<tr>
<td style="text-align:center">JDK1.3.1_19</td>
<td style="text-align:left">-target1.3</td>
<td style="text-align:center">00 00 00 2F</td>
<td style="text-align:center">47.0</td>
</tr>
<tr>
<td style="text-align:center">JDK1.4.2_10</td>
<td style="text-align:left">&#x4E0D;&#x5E26;&#xFF08;&#x9ED8;&#x8BA4;&#x4E3A;-target1.2&#xFF09;</td>
<td style="text-align:center">00 00 00 2E</td>
<td style="text-align:center">46.0</td>
</tr>
<tr>
<td style="text-align:center">JDK1.4.2_10</td>
<td style="text-align:left">-target1.4</td>
<td style="text-align:center">00 00 00 30</td>
<td style="text-align:center">48.0</td>
</tr>
<tr>
<td style="text-align:center">JDK1.5.0_11</td>
<td style="text-align:left">&#x4E0D;&#x5E26;&#xFF08;&#x9ED8;&#x8BA4;&#x4E3A;-target1.5&#xFF09;</td>
<td style="text-align:center">00 00 00 31</td>
<td style="text-align:center">49.0</td>
</tr>
<tr>
<td style="text-align:center">JDK1.5.0_11</td>
<td style="text-align:left">-target1.4 -source 1.4</td>
<td style="text-align:center">00 00 00 30</td>
<td style="text-align:center">48.0</td>
</tr>
<tr>
<td style="text-align:center">JDK1.6.0_01</td>
<td style="text-align:left">&#x4E0D;&#x5E26;&#xFF08;&#x9ED8;&#x8BA4;&#x4E3A;-target1.6&#xFF09;</td>
<td style="text-align:center">00 00 00 32</td>
<td style="text-align:center">50.0</td>
</tr>
<tr>
<td style="text-align:center">JDK1.6.0_01</td>
<td style="text-align:left">-target1.5</td>
<td style="text-align:center">00 00 00 31</td>
<td style="text-align:center">49.0</td>
</tr>
<tr>
<td style="text-align:center">JDK1.6.0_01</td>
<td style="text-align:left">-target1.4 -source 1.4</td>
<td style="text-align:center">00 00 00 30</td>
<td style="text-align:center">48.0</td>
</tr>
<tr>
<td style="text-align:center">JDK1.7.0</td>
<td style="text-align:left">&#x4E0D;&#x5E26;&#xFF08;&#x9ED8;&#x8BA4;&#x4E3A;-target1.7&#xFF09;</td>
<td style="text-align:center">00 00 00 33</td>
<td style="text-align:center">51.0</td>
</tr>
<tr>
<td style="text-align:center">JDK1.7.0</td>
<td style="text-align:left">-target1.6</td>
<td style="text-align:center">00 00 00 32</td>
<td style="text-align:center">50.0</td>
</tr>
<tr>
<td style="text-align:center">JDK1.7.0</td>
<td style="text-align:left">-target1.4 -source 1.4</td>
<td style="text-align:center">00 00 00 30</td>
<td style="text-align:center">48.0</td>
</tr>
</tbody>
</table>
<h3 id="&#x5E38;&#x91CF;&#x6C60;"><a href="#&#x5E38;&#x91CF;&#x6C60;" class="headerlink" title="&#x5E38;&#x91CF;&#x6C60;"></a>&#x5E38;&#x91CF;&#x6C60;</h3><p>&#x7D27;&#x63A5;&#x7740;&#x4E3B;&#x6B21;&#x7248;&#x672C;&#x53F7;&#x4E4B;&#x540E;&#x7684;&#x662F;&#x5E38;&#x91CF;&#x6C60;&#x5165;&#x53E3;&#xFF0C;&#x5E38;&#x91CF;&#x6C60;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;Class&#x6587;&#x4EF6;&#x7684;&#x8D44;&#x6E90;&#x4ED3;&#x5E93;&#x3002;<br>&#x5E38;&#x91CF;&#x6C60;&#x4E2D;&#x4E3B;&#x8981;&#x6709;&#x4E24;&#x5927;&#x7C7B;&#x5E38;&#x91CF;&#xFF1A;&#x5B57;&#x9762;&#x91CF;&#xFF08;Literal&#xFF09;&#x548C;&#x7B26;&#x53F7;&#x5F15;&#x7528;&#xFF08;Symbolic References)<br>&#x5B57;&#x9762;&#x91CF;&#x63A5;&#x8FD1;&#x4E8E;java&#x8BED;&#x8A00;&#x5C42;&#x9762;&#x7684;&#x5E38;&#x91CF;&#x6982;&#x5FF5;&#xFF0C;&#x5982;&#x6587;&#x672C;&#x5B57;&#x7B26;&#x4E32;&#x3001;&#x58F0;&#x660E;&#x4E3A;final&#x7684;&#x5E38;&#x91CF;&#x7B49;&#x3002;</p>
<p>&#x7B26;&#x53F7;&#x5F15;&#x7528;&#x5C5E;&#x4E8E;&#x7F16;&#x8BD1;&#x539F;&#x7406;&#x65B9;&#x9762;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5305;&#x62EC;&#x4E86;&#x4E09;&#x7C7B;&#x5E38;&#x91CF;&#xFF1A;</p>
<ul>
<li>&#x7C7B;&#x548C;&#x63A5;&#x53E3;&#x7684;&#x5168;&#x9650;&#x5B9A;&#x540D;&#xFF08;Fully Qualifide Name&#xFF09;</li>
<li>&#x5B57;&#x6BB5;&#x7684;&#x540D;&#x79F0;&#x548C;&#x63CF;&#x8FF0;&#x7B26;&#xFF08;Descriper&#xFF09;</li>
<li>&#x65B9;&#x6CD5;&#x7684;&#x540D;&#x79F0;&#x548C;&#x63CF;&#x8FF0;&#x7B26;</li>
</ul>
<p>&#x5E38;&#x91CF;&#x6C60;&#x4E2D;&#x6BCF;&#x4E00;&#x4E2A;&#x5E38;&#x91CF;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x8868;&#xFF0C;JDK1.7&#x4E4B;&#x524D;&#x6709;11&#x79CD;&#xFF0C;JDK1.7&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x652F;&#x6301;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x8C03;&#x7528;&#xFF0C;&#x53C8;&#x589E;&#x52A0;&#x4E86;3&#x79CD;&#xFF08;&#x4E0B;&#x8868;&#x540E;3&#x79CD;&#xFF09;<br>&#x8FD9;14&#x79CD;&#x8868;&#x6709;&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x70B9;&#xFF1A;&#x7B2C;&#x4E00;&#x4F4D;&#x662F;&#x4E00;&#x4E2A;u1&#x7C7B;&#x578B;&#x7684;&#x6807;&#x8BC6;&#x4F4D;&#xFF08;tag&#xFF09;&#xFF0C;&#x4EE3;&#x8868;&#x5F53;&#x524D;&#x8FD9;&#x4E2A;&#x5E38;&#x91CF;&#x5C5E;&#x4E8E;&#x54EA;&#x4E2A;&#x7C7B;&#x578B;&#x7684;&#x5E38;&#x91CF;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x5E38;&#x91CF;&#x6C60;&#x7684;&#x9879;&#x76EE;&#x7C7B;&#x578B;</p>
<table>
<thead>
<tr>
<th style="text-align:left">&#x7C7B;&#x578B;</th>
<th style="text-align:center">&#x6807;&#x5FD7;&#xFF08;tag&#xFF09;</th>
<th style="text-align:left">&#x63CF;&#x8FF0;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:left">CONSTANT_Utf8_info</td>
<td style="text-align:center">1</td>
<td style="text-align:left">UTF-8&#x7F16;&#x7801;&#x7684;&#x5B57;&#x7B26;&#x4E32;</td>
</tr>
<tr>
<td style="text-align:left">CONSTANT_Integer_info</td>
<td style="text-align:center">3</td>
<td style="text-align:left">&#x6574;&#x578B;&#x5B57;&#x9762;&#x91CF;</td>
</tr>
<tr>
<td style="text-align:left">CONSTANT_Float_info</td>
<td style="text-align:center">4</td>
<td style="text-align:left">&#x6D6E;&#x70B9;&#x578B;&#x5B57;&#x9762;&#x91CF;</td>
</tr>
<tr>
<td style="text-align:left">CONSTANT_Long_info</td>
<td style="text-align:center">5</td>
<td style="text-align:left">&#x957F;&#x6574;&#x578B;&#x5B57;&#x9762;&#x91CF;</td>
</tr>
<tr>
<td style="text-align:left">CONSTANT_Double_info</td>
<td style="text-align:center">6</td>
<td style="text-align:left">&#x53CC;&#x7CBE;&#x5EA6;&#x6D6E;&#x70B9;&#x578B;&#x5B57;&#x9762;&#x91CF;</td>
</tr>
<tr>
<td style="text-align:left">CONSTANT_Class_info</td>
<td style="text-align:center">7</td>
<td style="text-align:left">&#x7C7B;&#x6216;&#x63A5;&#x53E3;&#x7684;&#x7B26;&#x53F7;&#x5F15;&#x7528;</td>
</tr>
<tr>
<td style="text-align:left">CONSTANT_String_info</td>
<td style="text-align:center">8</td>
<td style="text-align:left">&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;&#x5B57;&#x9762;&#x91CF;</td>
</tr>
<tr>
<td style="text-align:left">CONSTANT_Fieldref_info</td>
<td style="text-align:center">9</td>
<td style="text-align:left">&#x5B57;&#x6BB5;&#x7684;&#x7B26;&#x53F7;&#x5F15;&#x7528;</td>
</tr>
<tr>
<td style="text-align:left">CONSTANT_Methodref_info</td>
<td style="text-align:center">10</td>
<td style="text-align:left">&#x7C7B;&#x4E2D;&#x65B9;&#x6CD5;&#x7684;&#x7B26;&#x53F7;&#x5F15;&#x7528;</td>
</tr>
<tr>
<td style="text-align:left">CONSTANT_InterfaceMethodref_info</td>
<td style="text-align:center">11</td>
<td style="text-align:left">&#x63A5;&#x53E3;&#x4E2D;&#x65B9;&#x6CD5;&#x7684;&#x7B26;&#x53F7;&#x5F15;&#x7528;</td>
</tr>
<tr>
<td style="text-align:left">CONSTANT_NameAndType_info</td>
<td style="text-align:center">12</td>
<td style="text-align:left">&#x5B57;&#x6BB5;&#x6216;&#x65B9;&#x6CD5;&#x7684;&#x90E8;&#x5206;&#x7B26;&#x53F7;&#x5F15;&#x7528;</td>
</tr>
<tr>
<td style="text-align:left">CONSTANT_MethodHandle_info</td>
<td style="text-align:center">15</td>
<td style="text-align:left">&#x8868;&#x793A;&#x65B9;&#x6CD5;&#x53E5;&#x67C4;</td>
</tr>
<tr>
<td style="text-align:left">CONSTANT_MethodType_info</td>
<td style="text-align:center">16</td>
<td style="text-align:left">&#x6807;&#x8BC6;&#x65B9;&#x6CD5;&#x7C7B;&#x578B;</td>
</tr>
<tr>
<td style="text-align:left">CONSTANT_InvokDynamic_info</td>
<td style="text-align:center">18</td>
<td style="text-align:left">&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x52A8;&#x6001;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x70B9;</td>
</tr>
</tbody>
</table>
]]></content>
    
    <summary type="html">
    
      Class类文件解析
    
    </summary>
    
      <category term="jvm" scheme="http://code.idea4j.com/categories/jvm/"/>
    
    
      <category term="java" scheme="http://code.idea4j.com/tags/java/"/>
    
      <category term="jvm" scheme="http://code.idea4j.com/tags/jvm/"/>
    
  </entry>
  
  <entry>
    <title>java虚拟机性能监控与故障管理工具</title>
    <link href="http://code.idea4j.com/2016/10/24/jvm1/"/>
    <id>http://code.idea4j.com/2016/10/24/jvm1/</id>
    <published>2016-10-24T08:52:59.000Z</published>
    <updated>2016-10-25T07:44:30.628Z</updated>
    
    <content type="html"><![CDATA[<h3 id="jps&#xFF1A;&#x865A;&#x62DF;&#x673A;&#x8FDB;&#x7A0B;&#x72B6;&#x51B5;&#x5DE5;&#x5177;"><a href="#jps&#xFF1A;&#x865A;&#x62DF;&#x673A;&#x8FDB;&#x7A0B;&#x72B6;&#x51B5;&#x5DE5;&#x5177;" class="headerlink" title="jps&#xFF1A;&#x865A;&#x62DF;&#x673A;&#x8FDB;&#x7A0B;&#x72B6;&#x51B5;&#x5DE5;&#x5177;"></a>jps&#xFF1A;&#x865A;&#x62DF;&#x673A;&#x8FDB;&#x7A0B;&#x72B6;&#x51B5;&#x5DE5;&#x5177;</h3><p>&#x5168;&#x79F0;&#xFF1A;JVM Process Status Tool<br>&#x7528;&#x9014;&#xFF1A;&#x5217;&#x51FA;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x865A;&#x62DF;&#x673A;&#x8FDB;&#x7A0B;&#xFF0C;&#x5E76;&#x663E;&#x793A;&#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;&#x4E3B;&#x7C7B;&#xFF08;Main Class&#xFF0C;main()&#x51FD;&#x6570;&#x6240;&#x5728;&#x7C7B;&#xFF09;&#x540D;&#x79F0;&#x4EE5;&#x53CA;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x7684;&#x672C;&#x5730;<br>&#x865A;&#x62DF;&#x673A;&#x552F;&#x4E00;ID&#xFF08;Local Virtual Machine Identifier,LVMID&#xFF09;<br>&#x547D;&#x4EE4;&#x683C;&#x5F0F;&#xFF1A;<em>jps [option] [hostid]</em></p>
<table>
<thead>
<tr>
<th style="text-align:center">&#x9009;&#x9879;</th>
<th style="text-align:left">&#x4F5C;&#x7528;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">-q</td>
<td style="text-align:left">&#x53EA;&#x8F93;&#x51FA;&#x7701;&#x7565;&#x4E3B;&#x7C7B;&#x7684;&#x540D;&#x79F0;</td>
</tr>
<tr>
<td style="text-align:center">-m</td>
<td style="text-align:left">&#x8F93;&#x51FA;&#x865A;&#x62DF;&#x673A;&#x8FDB;&#x7A0B;&#x542F;&#x52A8;&#x65F6;&#x4F20;&#x9012;&#x7ED9;&#x4E3B;&#x7C7B;main()&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;</td>
</tr>
<tr>
<td style="text-align:center">-l</td>
<td style="text-align:left">&#x8F93;&#x51FA;&#x4E3B;&#x7C7B;&#x7684;&#x5168;&#x540D;&#xFF0C;&#x5982;&#x679C;&#x8FDB;&#x7A0B;&#x6267;&#x884C;&#x7684;&#x662F;jar&#x5305;&#xFF0C;&#x8F93;&#x51FA;jar&#x8DEF;&#x5F84;</td>
</tr>
<tr>
<td style="text-align:center">-v</td>
<td style="text-align:left">&#x8F93;&#x51FA;&#x865A;&#x62DF;&#x673A;&#x8FDB;&#x7A0B;&#x542F;&#x52A8;&#x65F6;JVM&#x53C2;&#x6570;</td>
</tr>
</tbody>
</table>
<h3 id="jstat-&#x865A;&#x62DF;&#x673A;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#x76D1;&#x89C6;&#x5DE5;&#x5177;"><a href="#jstat-&#x865A;&#x62DF;&#x673A;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#x76D1;&#x89C6;&#x5DE5;&#x5177;" class="headerlink" title="jstat:&#x865A;&#x62DF;&#x673A;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#x76D1;&#x89C6;&#x5DE5;&#x5177;"></a>jstat:&#x865A;&#x62DF;&#x673A;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#x76D1;&#x89C6;&#x5DE5;&#x5177;</h3><p>&#x5168;&#x79F0;&#xFF1A;JVM Statistics Monitoring Tool<br>&#x7528;&#x9014;&#xFF1A;&#x76D1;&#x89C6;&#x865A;&#x62DF;&#x673A;&#x5404;&#x79CD;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#xFF08;&#x663E;&#x793A;&#x672C;&#x5730;&#x6216;&#x8FDC;&#x7A0B;&#x865A;&#x62DF;&#x673A;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x3001;&#x5185;&#x5B58;&#x3001;&#x5783;&#x573E;&#x6536;&#x96C6;&#x3001;JIT&#x7F16;&#x8BD1;&#x7B49;&#x8FD0;&#x884C;&#x6570;&#x636E;&#xFF09;&#x3002;<br>&#x547D;&#x4EE4;&#x683C;&#x5F0F;&#xFF1A;<em>jstat [option vmid[interval[s|ms][count]]]</em><br>&#x6817;&#x5B50;&#xFF1A;jstat -gc 2092 300 10 //&#x6BCF;300&#x6BEB;&#x79D2;&#x67E5;&#x8BE2;&#x4E00;&#x6B21;&#x8FDB;&#x7A0B;2092&#x5783;&#x573E;&#x6536;&#x96C6;&#x60C5;&#x51B5;</p>
<table>
<thead>
<tr>
<th style="text-align:center">&#x9009;&#x9879;</th>
<th style="text-align:left">&#x4F5C;&#x7528;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">-class</td>
<td style="text-align:left">&#x76D1;&#x89C6;&#x7C7B;&#x88C5;&#x8F7D;&#x3001;&#x5378;&#x8F7D;&#x6570;&#x91CF;&#x3001;&#x603B;&#x7A7A;&#x95F4;&#x4EE5;&#x53CA;&#x7C7B;&#x88C5;&#x8F7D;&#x6240;&#x8017;&#x8D39;&#x7684;&#x65F6;&#x95F4;</td>
</tr>
<tr>
<td style="text-align:center">-gc</td>
<td style="text-align:left">&#x76D1;&#x89C6;&#x5806;&#x72B6;&#x51B5;&#xFF0C;&#x5305;&#x62EC;Eden&#x533A;&#x3001;&#x4E24;&#x4E2A;survivor&#x533A;&#x3001;&#x8001;&#x5E74;&#x4EE3;&#x3001;&#x6C38;&#x4E45;&#x4EE3;&#x7B49;&#x7684;&#x5BB9;&#x91CF;&#x3001;&#x5DF2;&#x7528;&#x7A7A;&#x95F4;&#x3001;GC&#x65F6;&#x95F4;&#x5408;&#x8BA1;&#x7B49;&#x4FE1;&#x606F;</td>
</tr>
<tr>
<td style="text-align:center">-gccapacity</td>
<td style="text-align:left">&#x76D1;&#x89C6;&#x5185;&#x5BB9;&#x4E0E;-gc&#x57FA;&#x672C;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x8F93;&#x51FA;&#x4E3B;&#x8981;&#x5173;&#x6CE8;java&#x5806;&#x5404;&#x4E2A;&#x533A;&#x57DF;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x6700;&#x5927;&#x3001;&#x6700;&#x5C0F;&#x7A7A;&#x95F4;</td>
</tr>
<tr>
<td style="text-align:center">-gcutil</td>
<td style="text-align:left">&#x76D1;&#x89C6;&#x5185;&#x5BB9;&#x4E0E;-gc&#x57FA;&#x672C;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x8F93;&#x51FA;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x5DF2;&#x4F7F;&#x7528;&#x7A7A;&#x95F4;&#x5360;&#x603B;&#x7A7A;&#x95F4;&#x7684;&#x767E;&#x5206;&#x6BD4;</td>
</tr>
<tr>
<td style="text-align:center">-gccause</td>
<td style="text-align:left">&#x4E0E;-gcutil&#x529F;&#x80FD;&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x989D;&#x5916;&#x8F93;&#x51FA;&#x5BFC;&#x81F4;&#x4E0A;&#x4E00;&#x6B21;GC&#x4EA7;&#x751F;&#x7684;&#x539F;&#x56E0;</td>
</tr>
<tr>
<td style="text-align:center">-gcnew</td>
<td style="text-align:left">&#x76D1;&#x89C6;&#x65B0;&#x751F;&#x4EE3;GC&#x72B6;&#x51B5;</td>
</tr>
<tr>
<td style="text-align:center">-gcnewcapacity</td>
<td style="text-align:left">&#x76D1;&#x89C6;&#x5185;&#x5BB9;&#x4E0E;-gcnew&#x57FA;&#x672C;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x8F93;&#x51FA;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x6700;&#x5927;&#x3001;&#x6700;&#x5C0F;&#x7A7A;&#x95F4;</td>
</tr>
<tr>
<td style="text-align:center">-gcold</td>
<td style="text-align:left">&#x76D1;&#x89C6;&#x8001;&#x5E74;&#x4EE3;GC&#x72B6;&#x51B5;</td>
</tr>
<tr>
<td style="text-align:center">-gcoldcapacity</td>
<td style="text-align:left">&#x76D1;&#x89C6;&#x5185;&#x5BB9;&#x4E0E;-gcold&#x57FA;&#x672C;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x8F93;&#x51FA;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x6700;&#x5927;&#x3001;&#x6700;&#x5C0F;&#x7A7A;&#x95F4;</td>
</tr>
<tr>
<td style="text-align:center">-gcpermcapacity</td>
<td style="text-align:left">&#x8F93;&#x51FA;&#x6C38;&#x4E45;&#x4EE3;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x6700;&#x5927;&#x3001;&#x6700;&#x5C0F;&#x7A7A;&#x95F4;</td>
</tr>
<tr>
<td style="text-align:center">-complier</td>
<td style="text-align:left">&#x8F93;&#x51FA;JIT&#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;&#x8FC7;&#x7684;&#x65B9;&#x6CD5;&#x3001;&#x8017;&#x65F6;&#x7B49;&#x4FE1;&#x606F;</td>
</tr>
<tr>
<td style="text-align:center">-printcompilation</td>
<td style="text-align:left">&#x8F93;&#x51FA;&#x5DF2;&#x7ECF;&#x88AB;JIT&#x7F16;&#x8BD1;&#x7684;&#x65B9;&#x6CD5;</td>
</tr>
</tbody>
</table>
<p>&#x6267;&#x884C;&#x7ED3;&#x679C;&#x8868;&#x5934;&#x542B;&#x4E49;</p>
<table>
<thead>
<tr>
<th style="text-align:center">&#x5B57;&#x6BCD;</th>
<th style="text-align:left">&#x542B;&#x4E49;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">E</td>
<td style="text-align:left">Eden&#x65B0;&#x751F;&#x4EE3;</td>
</tr>
<tr>
<td style="text-align:center">S0</td>
<td style="text-align:left">Survivor0</td>
</tr>
<tr>
<td style="text-align:center">S1</td>
<td style="text-align:left">Survivor1</td>
</tr>
<tr>
<td style="text-align:center">O</td>
<td style="text-align:left">Old&#x8001;&#x5E74;&#x4EE3;</td>
</tr>
<tr>
<td style="text-align:center">P</td>
<td style="text-align:left">Permanent&#x6C38;&#x4E45;&#x4EE3;</td>
</tr>
<tr>
<td style="text-align:center">YGC</td>
<td style="text-align:left">Young GC</td>
</tr>
<tr>
<td style="text-align:center">FGC</td>
<td style="text-align:left">Full GC</td>
</tr>
<tr>
<td style="text-align:center">YGCT</td>
<td style="text-align:left">Young GC Time</td>
</tr>
<tr>
<td style="text-align:center">FGCT</td>
<td style="text-align:left">Full GC Time</td>
</tr>
<tr>
<td style="text-align:center">GCT</td>
<td style="text-align:left">GC Time</td>
</tr>
</tbody>
</table>
<h3 id="jinfo&#xFF1A;java&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x5DE5;&#x5177;"><a href="#jinfo&#xFF1A;java&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x5DE5;&#x5177;" class="headerlink" title="jinfo&#xFF1A;java&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x5DE5;&#x5177;"></a>jinfo&#xFF1A;java&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x5DE5;&#x5177;</h3><p>&#x5168;&#x79F0;&#xFF1A;Configuration Info for java<br>&#x7528;&#x9014;&#xFF1A;&#x5B9E;&#x65F6;&#x5730;&#x67E5;&#x770B;&#x548C;&#x8C03;&#x6574;&#x865A;&#x62DF;&#x673A;&#x5404;&#x9879;&#x53C2;&#x6570;&#x3002;<br>&#x547D;&#x4EE4;&#x683C;&#x5F0F;&#xFF1A;<em>jinfo [option] pid</em></p>
<h3 id="jmap-java&#x5185;&#x5B58;&#x6620;&#x50CF;&#x5DE5;&#x5177;"><a href="#jmap-java&#x5185;&#x5B58;&#x6620;&#x50CF;&#x5DE5;&#x5177;" class="headerlink" title="jmap:java&#x5185;&#x5B58;&#x6620;&#x50CF;&#x5DE5;&#x5177;"></a>jmap:java&#x5185;&#x5B58;&#x6620;&#x50CF;&#x5DE5;&#x5177;</h3><p>&#x5168;&#x79F0;&#xFF1A;Memory Map for Java<br>&#x7528;&#x9014;&#xFF1A;&#x751F;&#x6210;&#x5806;&#x8F6C;&#x50A8;&#x5FEB;&#x7167;&#xFF08;heapdump&#x6216;dump&#x6587;&#x4EF6;&#xFF09;<br>&#x547D;&#x4EE4;&#x683C;&#x5F0F;&#xFF1A;<em>jmap [option] vmid</em></p>
<p>jmap&#x5DE5;&#x5177;&#x4E3B;&#x8981;&#x9009;&#x9879;</p>
<table>
<thead>
<tr>
<th style="text-align:center">&#x9009;&#x9879;</th>
<th style="text-align:left">&#x4F5C;&#x7528;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">-dump</td>
<td style="text-align:left">&#x751F;&#x6210;Java&#x5806;&#x8F6C;&#x50A8;&#x5FEB;&#x7167;&#x3002;&#x683C;&#x5F0F;&#x4E3A;&#xFF1A;-dump:[live,] fomat=b,file=<filename>,&#x5176;&#x4E2D;live&#x5B50;&#x53C2;&#x6570;&#x8BF4;&#x660E;&#x662F;&#x5426;&#x53EA;dump&#x51FA;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;</filename></td>
</tr>
<tr>
<td style="text-align:center">-finalizerinfo</td>
<td style="text-align:left">&#x663E;&#x793A;&#x5B50;F-Queue&#x4E2D;&#x7B49;&#x5F85;Finalizer&#x7EBF;&#x7A0B;&#x6267;&#x884C;finalize&#x65B9;&#x6CD5;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x53EA;&#x5728;Linux/Solaris&#x5E73;&#x53F0;&#x4E0B;&#x6709;&#x6548;</td>
</tr>
<tr>
<td style="text-align:center">-heap</td>
<td style="text-align:left">&#x663E;&#x793A;javja&#x5806;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x5982;&#x4F7F;&#x7528;&#x54EA;&#x79CD;&#x56DE;&#x6536;&#x5668;&#xFF0C;&#x53C2;&#x8003;&#x914D;&#x7F6E;&#xFF0C;&#x5206;&#x4EE3;&#x72B6;&#x51B5;&#x7B49;&#xFF0C;&#x53EA;&#x5728;Linux/Solaris&#x5E73;&#x53F0;&#x4E0B;&#x6709;&#x6548;</td>
</tr>
<tr>
<td style="text-align:center">-histo</td>
<td style="text-align:left">&#x663E;&#x793A;&#x5806;&#x4E2D;&#x5BF9;&#x8C61;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC;&#x7C7B;&#x3001;&#x5B9E;&#x4F8B;&#x6570;&#x91CF;&#x3001;&#x5408;&#x8BA1;&#x5BB9;&#x91CF;</td>
</tr>
<tr>
<td style="text-align:center">-permstat</td>
<td style="text-align:left">&#x4EE5;ClassLoader&#x4E3A;&#x7EDF;&#x8BA1;&#x53E3;&#x5F84;&#x663E;&#x793A;&#x6C38;&#x4E45;&#x4EE3;&#x5185;&#x5B58;&#x72B6;&#x6001;&#xFF0C;&#x53EA;&#x5728;Linux/Solaris&#x5E73;&#x53F0;&#x4E0B;&#x6709;&#x6548;</td>
</tr>
<tr>
<td style="text-align:center">-F</td>
<td style="text-align:left">&#x5F53;&#x865A;&#x62DF;&#x673A;&#x8FDB;&#x7A0B;&#x5BF9;-dump&#x9009;&#x9879;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#x65F6;&#xFF0C;&#x53EF;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x9009;&#x9879;&#x5F3A;&#x5236;&#x751F;&#x6210;dump&#x5FEB;&#x7167;&#xFF0C;&#x53EA;&#x5728;Linux/Solaris&#x5E73;&#x53F0;&#x4E0B;&#x6709;&#x6548;</td>
</tr>
</tbody>
</table>
<h3 id="jhat&#xFF1A;&#x865A;&#x62DF;&#x673A;&#x5806;&#x8F6C;&#x50A8;&#x5FEB;&#x7167;&#x5206;&#x6790;&#x5DE5;&#x5177;"><a href="#jhat&#xFF1A;&#x865A;&#x62DF;&#x673A;&#x5806;&#x8F6C;&#x50A8;&#x5FEB;&#x7167;&#x5206;&#x6790;&#x5DE5;&#x5177;" class="headerlink" title="jhat&#xFF1A;&#x865A;&#x62DF;&#x673A;&#x5806;&#x8F6C;&#x50A8;&#x5FEB;&#x7167;&#x5206;&#x6790;&#x5DE5;&#x5177;"></a>jhat&#xFF1A;&#x865A;&#x62DF;&#x673A;&#x5806;&#x8F6C;&#x50A8;&#x5FEB;&#x7167;&#x5206;&#x6790;&#x5DE5;&#x5177;</h3><p>&#x5168;&#x79F0;&#xFF1A;JVM Heap Analysis Tool<br>&#x7528;&#x9014;&#xFF1A;&#x5206;&#x6790;jmap&#x751F;&#x6210;&#x7684;&#x5FEB;&#x7167;<br>&#x547D;&#x4EE4;&#x683C;&#x5F0F;&#xFF1A;<em>jhat filename</em></p>
<h3 id="jstack&#xFF1A;java&#x5806;&#x6808;&#x8DDF;&#x8E2A;&#x5DE5;&#x5177;"><a href="#jstack&#xFF1A;java&#x5806;&#x6808;&#x8DDF;&#x8E2A;&#x5DE5;&#x5177;" class="headerlink" title="jstack&#xFF1A;java&#x5806;&#x6808;&#x8DDF;&#x8E2A;&#x5DE5;&#x5177;"></a>jstack&#xFF1A;java&#x5806;&#x6808;&#x8DDF;&#x8E2A;&#x5DE5;&#x5177;</h3><p>&#x5168;&#x79F0;&#xFF1A;Stack Trace for Java<br>&#x7528;&#x9014;&#xFF1A;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x865A;&#x62DF;&#x673A;&#x5F53;&#x524D;&#x65F6;&#x523B;&#x7684;&#x7EBF;&#x7A0B;&#x5FEB;&#x7167;&#x3002;<br>&#x547D;&#x4EE4;&#x683C;&#x5F0F;&#xFF1A;<em>jstack [option] vmid</em></p>
<p>jstack&#x5DE5;&#x5177;&#x4E3B;&#x8981;&#x9009;&#x9879;</p>
<table>
<thead>
<tr>
<th style="text-align:center">&#x9009;&#x9879;</th>
<th style="text-align:left">&#x4F5C;&#x7528;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">-F</td>
<td style="text-align:left">&#x5F53;&#x6B63;&#x5E38;&#x8F93;&#x51FA;&#x7684;&#x8BF7;&#x6C42;&#x4E0D;&#x88AB;&#x54CD;&#x5E94;&#x662F;&#xFF0C;&#x5F3A;&#x5236;&#x8F93;&#x51FA;&#x7EBF;&#x7A0B;&#x5806;&#x6808;</td>
</tr>
<tr>
<td style="text-align:center">-l</td>
<td style="text-align:left">&#x9664;&#x5806;&#x6808;&#x5916;&#xFF0C;&#x663E;&#x793A;&#x5173;&#x4E8E;&#x9501;&#x7684;&#x9644;&#x52A0;&#x4FE1;&#x606F;</td>
</tr>
<tr>
<td style="text-align:center">-m</td>
<td style="text-align:left">&#x5982;&#x679C;&#x8C03;&#x7528;&#x5230;&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x4EE5;&#x663E;&#x793A;c/c++&#x7684;&#x5806;&#x6808;</td>
</tr>
</tbody>
</table>
]]></content>
    
    <summary type="html">
    
      jps，jstat
    
    </summary>
    
      <category term="jvm" scheme="http://code.idea4j.com/categories/jvm/"/>
    
    
      <category term="jvm" scheme="http://code.idea4j.com/tags/jvm/"/>
    
  </entry>
  
  <entry>
    <title>Maven 打包实现环境配置分离</title>
    <link href="http://code.idea4j.com/2016/10/21/mvnenvironmentseparate/"/>
    <id>http://code.idea4j.com/2016/10/21/mvnenvironmentseparate/</id>
    <published>2016-10-21T02:16:09.000Z</published>
    <updated>2016-10-21T03:28:11.818Z</updated>
    
    <content type="html"><![CDATA[<p>&#x4E3B;&#x8981;&#x662F;&#x901A;&#x8FC7;&#x6253;&#x5305;&#x65F6;&#x4F20;&#x9012;&#x4E0D;&#x540C;&#x7684;&#x53C2;&#x6570;&#x6765;&#x5B9E;&#x73B0;&#x4E0D;&#x540C;&#x7684;&#x73AF;&#x5883;&#x4EA7;&#x751F;&#x4E0D;&#x540C;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF08;&#x5982;&#x6570;&#x636E;&#x5E93;&#x8FDE;&#x63A5;&#x7B49;&#xFF09;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x540C;&#x4E00;&#x7248;&#x672C;&#x4EE3;&#x7801;&#x4E0D;&#x540C;&#x90E8;&#x7F72;&#x73AF;&#x5883;&#x3002;</p>
<p>&#x5E9F;&#x8BDD;&#x4E0D;&#x591A;&#x8BF4;&#xFF0C;&#x76F4;&#x63A5;&#x4E0A;&#x5E72;&#x8D27;&#xFF0C;&#x8FDB;&#x884C;&#x4EE5;&#x4E0B;&#x6B65;&#x9AA4;&#x5C31;&#x53EF;&#x4EE5;&#x6539;&#x9020;&#x4F60;&#x7684;&#x5DE5;&#x7A0B;&#x4E86;</p>
<h3 id="&#x5148;&#x4FEE;&#x6539;pom-xml"><a href="#&#x5148;&#x4FEE;&#x6539;pom-xml" class="headerlink" title="&#x5148;&#x4FEE;&#x6539;pom.xml"></a>&#x5148;&#x4FEE;&#x6539;pom.xml</h3><p>build&#x4E0B;&#x914D;&#x7F6E;<br><figure class="highlight xml"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div></pre></td><td class="code"><pre><div class="line"><span class="tag">&lt;<span class="name">resources</span>&gt;</span></div><div class="line">    <span class="tag">&lt;<span class="name">resource</span>&gt;</span></div><div class="line">        <span class="tag">&lt;<span class="name">directory</span>&gt;</span>${basedir}/src/main/resources<span class="tag">&lt;/<span class="name">directory</span>&gt;</span></div><div class="line">        <span class="tag">&lt;<span class="name">includes</span>&gt;</span></div><div class="line">            <span class="tag">&lt;<span class="name">include</span>&gt;</span>**/*<span class="tag">&lt;/<span class="name">include</span>&gt;</span></div><div class="line">        <span class="tag">&lt;/<span class="name">includes</span>&gt;</span></div><div class="line">    <span class="tag">&lt;/<span class="name">resource</span>&gt;</span></div><div class="line">    <span class="comment">&lt;!--&#x8BBE;&#x7F6E;&#x81EA;&#x52A8;&#x66FF;&#x6362;--&gt;</span></div><div class="line">    <span class="tag">&lt;<span class="name">resource</span>&gt;</span></div><div class="line">        <span class="tag">&lt;<span class="name">directory</span>&gt;</span>${basedir}/src/main/resources<span class="tag">&lt;/<span class="name">directory</span>&gt;</span></div><div class="line">        <span class="tag">&lt;<span class="name">includes</span>&gt;</span></div><div class="line">            <span class="tag">&lt;<span class="name">include</span>&gt;</span>conf/config.properties<span class="tag">&lt;/<span class="name">include</span>&gt;</span></div><div class="line">        <span class="tag">&lt;/<span class="name">includes</span>&gt;</span></div><div class="line">        <span class="comment">&lt;!--&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x6392;&#x9664;&#x6807;&#x7B7E;--&gt;</span></div><div class="line">        <span class="comment">&lt;!--&lt;excludes&gt;&lt;/excludes&gt;--&gt;</span></div><div class="line">        <span class="comment">&lt;!--&#x5F00;&#x542F;&#x8FC7;&#x6EE4;--&gt;</span></div><div class="line">        <span class="tag">&lt;<span class="name">filtering</span>&gt;</span>true<span class="tag">&lt;/<span class="name">filtering</span>&gt;</span></div><div class="line">    <span class="tag">&lt;/<span class="name">resource</span>&gt;</span></div><div class="line"><span class="tag">&lt;/<span class="name">resources</span>&gt;</span></div></pre></td></tr></table></figure></p>
<p>profiles&#x914D;&#x7F6E;<br><figure class="highlight xml"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div><div class="line">22</div><div class="line">23</div><div class="line">24</div><div class="line">25</div><div class="line">26</div><div class="line">27</div><div class="line">28</div><div class="line">29</div></pre></td><td class="code"><pre><div class="line"><span class="tag">&lt;<span class="name">profiles</span>&gt;</span></div><div class="line">   <span class="tag">&lt;<span class="name">profile</span>&gt;</span></div><div class="line">       <span class="tag">&lt;<span class="name">id</span>&gt;</span>product<span class="tag">&lt;/<span class="name">id</span>&gt;</span></div><div class="line">       <span class="tag">&lt;<span class="name">build</span>&gt;</span></div><div class="line">           <span class="tag">&lt;<span class="name">filters</span>&gt;</span></div><div class="line">               <span class="tag">&lt;<span class="name">filter</span>&gt;</span>${basedir}/src/main/resources/environments/config-product.properties<span class="tag">&lt;/<span class="name">filter</span>&gt;</span></div><div class="line">           <span class="tag">&lt;/<span class="name">filters</span>&gt;</span></div><div class="line">       <span class="tag">&lt;/<span class="name">build</span>&gt;</span></div><div class="line">   <span class="tag">&lt;/<span class="name">profile</span>&gt;</span></div><div class="line">   <span class="tag">&lt;<span class="name">profile</span>&gt;</span></div><div class="line">       <span class="tag">&lt;<span class="name">id</span>&gt;</span>test<span class="tag">&lt;/<span class="name">id</span>&gt;</span></div><div class="line">       <span class="tag">&lt;<span class="name">build</span>&gt;</span></div><div class="line">           <span class="tag">&lt;<span class="name">filters</span>&gt;</span></div><div class="line">               <span class="tag">&lt;<span class="name">filter</span>&gt;</span>${basedir}/src/main/resources/environments/config-test.properties<span class="tag">&lt;/<span class="name">filter</span>&gt;</span></div><div class="line">           <span class="tag">&lt;/<span class="name">filters</span>&gt;</span></div><div class="line">       <span class="tag">&lt;/<span class="name">build</span>&gt;</span></div><div class="line">   <span class="tag">&lt;/<span class="name">profile</span>&gt;</span></div><div class="line">   <span class="tag">&lt;<span class="name">profile</span>&gt;</span></div><div class="line">       <span class="tag">&lt;<span class="name">id</span>&gt;</span>dev<span class="tag">&lt;/<span class="name">id</span>&gt;</span></div><div class="line">       <span class="tag">&lt;<span class="name">activation</span>&gt;</span></div><div class="line">           <span class="tag">&lt;<span class="name">activeByDefault</span>&gt;</span>true<span class="tag">&lt;/<span class="name">activeByDefault</span>&gt;</span></div><div class="line">       <span class="tag">&lt;/<span class="name">activation</span>&gt;</span></div><div class="line">       <span class="tag">&lt;<span class="name">build</span>&gt;</span></div><div class="line">           <span class="tag">&lt;<span class="name">filters</span>&gt;</span></div><div class="line">               <span class="tag">&lt;<span class="name">filter</span>&gt;</span>${basedir}/src/main/resources/environments/config-dev.properties<span class="tag">&lt;/<span class="name">filter</span>&gt;</span></div><div class="line">           <span class="tag">&lt;/<span class="name">filters</span>&gt;</span></div><div class="line">       <span class="tag">&lt;/<span class="name">build</span>&gt;</span></div><div class="line">   <span class="tag">&lt;/<span class="name">profile</span>&gt;</span></div><div class="line"><span class="tag">&lt;/<span class="name">profiles</span>&gt;</span></div></pre></td></tr></table></figure></p>
<h3 id="&#x4FEE;&#x6539;&#x914D;&#x7F6E;&#x6587;&#x4EF6;config-properties"><a href="#&#x4FEE;&#x6539;&#x914D;&#x7F6E;&#x6587;&#x4EF6;config-properties" class="headerlink" title="&#x4FEE;&#x6539;&#x914D;&#x7F6E;&#x6587;&#x4EF6;config.properties"></a>&#x4FEE;&#x6539;&#x914D;&#x7F6E;&#x6587;&#x4EF6;config.properties</h3><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line">jdbc.driver=${db.driver}</div><div class="line">jdbc.url=${db.url}</div><div class="line">jdbc.username=${db.username}</div><div class="line">jdbc.password=${db.password}</div></pre></td></tr></table></figure>
<p>&#x6DFB;&#x52A0;&#x7279;&#x5B9A;&#x73AF;&#x5883;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;<br>&#x5F00;&#x53D1;&#x73AF;&#x5883;config-dev.properties<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line">db.driver=com.mysql.jdbc.Driver</div><div class="line">db.url=jdbc:mysql://127.0.0.1:3306/blog?useUnicode=true&amp;amp;characterEncoding=utf-8</div><div class="line">db.username=root</div><div class="line">db.password=root</div></pre></td></tr></table></figure></p>
<p>&#x6D4B;&#x8BD5;&#x73AF;&#x5883;config-test.properties<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line">db.driver=com.mysql.jdbc.Driver</div><div class="line">db.url=jdbc:mysql://127.0.0.1:3306/blog?useUnicode=true&amp;amp;characterEncoding=utf-8</div><div class="line">db.username=root</div><div class="line">db.password=root</div></pre></td></tr></table></figure></p>
<p>&#x5176;&#x4ED6;&#x73AF;&#x5883;&#x7684;&#x6587;&#x4EF6;&#xFF08;&#x7565;&#xFF09;<br><em><font color="red">&#x6CE8;&#x610F;</font></em>&#xFF1A;</p>
<ul>
<li>&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x540D;&#x79F0;&#x4E0E;pom.xml&#x4E2D;profiles&#x8282;&#x70B9;&#x4E2D;&#x4E00;&#x81F4;</li>
<li>&#x6587;&#x4EF6;&#x7684;key&#xFF08;&#x5982;db.driver&#xFF09;&#x4E0E;config.properties&#x4E2D;&#x7684;${db.driver}&#x5BF9;&#x5E94;</li>
</ul>
<h3 id="maven&#x6253;&#x5305;&#x547D;&#x4EE4;"><a href="#maven&#x6253;&#x5305;&#x547D;&#x4EE4;" class="headerlink" title="maven&#x6253;&#x5305;&#x547D;&#x4EE4;"></a>maven&#x6253;&#x5305;&#x547D;&#x4EE4;</h3><p>mvn clean install -Pdev<br>mvn clean install -product<br>mvn clean install -Ptest</p>
<p>Intellij IDEA  maven&#x6253;&#x5305;&#x8BBE;&#x7F6E;<br><img src="/2016/10/21/mvnenvironmentseparate/maven2.jpg" alt=""></p>
<h3 id="&#x90E8;&#x7F72;war&#x5305;"><a href="#&#x90E8;&#x7F72;war&#x5305;" class="headerlink" title="&#x90E8;&#x7F72;war&#x5305;"></a>&#x90E8;&#x7F72;war&#x5305;</h3><p>&#x4EE3;&#x7801;&#x5730;&#x5740;&#xFF1A;<a href="https://github.com/beijinguang/ssm" target="_blank" rel="external">https://github.com/beijinguang/ssm</a><br>&#x6B22;&#x8FCE;&#x5927;&#x5BB6;fork&#xFF0C;star</p>
<p>&#x5B89;&#x5229;&#x4E0B;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;:<br><img src="/2016/10/21/mvnenvironmentseparate/code.jpg" alt=""></p>
]]></content>
    
    <summary type="html">
    
      使用maven实现环境配置分离
    
    </summary>
    
      <category term="maven" scheme="http://code.idea4j.com/categories/maven/"/>
    
    
      <category term="maven" scheme="http://code.idea4j.com/tags/maven/"/>
    
  </entry>
  
</feed>
